<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN" "http://www.w3.org/TR/html4/HTMLlat1.ent">
<HTML lang="de">
<HEAD>
<TITLE>Nxtvepg Dokumentation</TITLE>
<META http-equiv="Content-Type" content="text/html; charset=iso-8859-1">
<META name="language" content="de">
<META name="author" content="Tom Zoerner">
<META name="copyright" content="Tom Zoerner">
<META name="keywords" content="nexTView,nxtvepg,TV-Programm,Linux,bttv,video4linux,VBI,Austastlücke,Multimedia,kostenlos,TV-Karte,Bt848,Booktree,Brooktree,Dekoder,Browser,EPG,Teletext,Bt878,Elektronische Programmzeitschrift,Fernsehprogramm">
<META name="description" content="Dokumentation für die nxtvepg Software, die den Empfang der kostenlosen TV-Programmzeitschrift Nextview ermöglicht. Nextview wird im TV-Programmen in Deutschland, Östereich, der Schweiz, und Frankreich ausgestrahlt und deckt alle überregionalen Sender der jeweiligen Länder ab.">
<META name="robots" content="index, follow">
<META name="revisit-after" content="01 month">
<LINK rel="stylesheet" type="text/css" href="nxtvepg.css">
<LINK rel="shortcut icon" type="image/x-icon" href="nxtvepg.ico">
<LINK rel="alternate" type="text/html" href="man.html" hreflang="en" lang="en" title="nxtvepg manual">
<LINK rel="top" href="http://nxtvepg.sourceforge.net/index-de.html" title="nxtvepg homepage">
</HEAD>
<BODY>

<DIV CLASS="navBar">
<P><SMALL>
<IMG ALT="" SRC="nxtv_icon.gif">&nbsp;nxtvepg&nbsp;
<A HREF="index-de.html">home</A> &nbsp;|&nbsp;
<A HREF="intro-de.html">about</A>
</SMALL></P></DIV>

<DIV class="navBlock">
<H2 class="navhead">Language</H2>
<P>
<IMG ALT="" SRC="en.png" WIDTH="16" HEIGHT="10"> <A HREF="man.html">English</A><BR>
<IMG ALT="" SRC="de.png" WIDTH="16" HEIGHT="10"> Deutsch<BR>
<IMG ALT="" SRC="fr.png" WIDTH="16" HEIGHT="10"> <SPAN class="navDisabled">Français</SPAN><BR>
</P>

<H2 class="navhead">News</H2>
<P>
</P>

<H2 class="navhead">Documentation</H2>
<P>
<A HREF="index-de.html">Homepage</A><BR>
<A HREF="intro-de.html">Introduction</A><BR>
<A HREF="provnets.html">Providers list</A><BR>
<A HREF="links.html">Links</A><BR>
<A HREF="faq.html">FAQ</A><BR>
<BR>
<SPAN CLASS="navPointer">nxtvepg manual</SPAN><BR>
<A HREF="ttx_grab.html">teletext grabber</A><BR>
</P>

<H2 class="navhead">Download</H2>
<P>
<A HREF="download.html">Download</A><BR>
<A HREF="download.html#requirements">System requirements</A><BR>
<A HREF="changelog.html">Changelog</A><BR>
</P>

<H2 class="navhead">Screenshots</H2>
<P>
<A HREF="screenshot-274.png">Main window</A><BR>
<A HREF="screenshot-grid1.png">"Grid" layout</A><BR>
<A HREF="screenshot-reminder.png">Reminders</A><BR>
<A HREF="screenshot-timescales.png">Network timescales</A><BR>
<A HREF="screenshot-stats.png">Statistics windows</A><BR>
<A HREF="screenshot-series.png">Series menu</A><BR>
<A HREF="screenshot-xawtv.jpg">xawtv with EPG OSD</A><BR>
</P>
<span class="center"><span class="logo"><a href="http://sourceforge.net"><img
src="http://sourceforge.net/sflogo.php?group_id=64430&amp;type=4"
width="125" height="37" alt="SourceForge.net Logo"></a></span></span>
</DIV>

<DIV class="mainBlock">
<H1>Dokumentation zu nxtvepg 3.0.0</H1>

<ul id="index">
  <li><a href="#NAME">NAME</a></li>
  <li><a href="#SYNOPSIS">SYNOPSIS</a></li>
  <li><a href="#DESCRIPTION">DESCRIPTION</a></li>
  <li><a href="#OPTIONS">OPTIONS</a></li>
  <li><a href="#GETTING-STARTED">GETTING STARTED</a>
    <ul>
      <li><a href="#Configuring-the-Teletext-EPG-Grabber">Configuring the Teletext EPG Grabber</a></li>
      <li><a href="#Configuring-TV-card-input">Configuring TV card input</a></li>
      <li><a href="#Configuring-a-TV-application">Configuring a TV application</a></li>
    </ul>
  </li>
  <li><a href="#BASIC-BROWSING">BASIC BROWSING</a></li>
  <li><a href="#TELETEXT-EPG-GRABBER">TELETEXT EPG GRABBER</a>
    <ul>
      <li><a href="#Using-Teletext-EPG">Using Teletext EPG</a></li>
      <li><a href="#Acquisition-modes">Acquisition modes</a></li>
    </ul>
  </li>
  <li><a href="#STATISTICS">STATISTICS</a>
    <ul>
      <li><a href="#Status-line">Status line</a></li>
      <li><a href="#Timescale-popup-window">Timescale popup window</a></li>
      <li><a href="#Database-statistics">Database statistics</a></li>
      <li><a href="#Teletext-Grabber-Statistics">Teletext Grabber Statistics</a></li>
    </ul>
  </li>
  <li><a href="#MERGED-DATABASES">MERGED DATABASES</a></li>
  <li><a href="#FILTERING">FILTERING</a>
    <ul>
      <li><a href="#Filter-Types">Filter Types</a></li>
      <li><a href="#Inverting-filters">Inverting filters</a></li>
    </ul>
  </li>
  <li><a href="#FILTER-SHORTCUTS">FILTER SHORTCUTS</a>
    <ul>
      <li><a href="#Editing-Filter-Shortcuts">Editing Filter Shortcuts</a></li>
      <li><a href="#Filter-Masks">Filter Masks</a></li>
      <li><a href="#Shortcut-combination-modes">Shortcut combination modes</a></li>
      <li><a href="#Shortcut-update-dialog">Shortcut update dialog</a></li>
    </ul>
  </li>
  <li><a href="#COMPOSITE-ATTRIBUTES">COMPOSITE ATTRIBUTES</a></li>
  <li><a href="#REMINDERS">REMINDERS</a>
    <ul>
      <li><a href="#Edit-reminder-list">Edit reminder list</a></li>
      <li><a href="#Reminder-group-configuration">Reminder group configuration</a></li>
      <li><a href="#Reminder-Messages">Reminder Messages</a></li>
    </ul>
  </li>
  <li><a href="#CONTEXT-MENU">CONTEXT MENU</a></li>
  <li><a href="#CONTROL-MENU">CONTROL MENU</a>
    <ul>
      <li><a href="#Load-XMLTV-file">Load XMLTV file</a></li>
      <li><a href="#Merge-XMLTV-files">Merge XMLTV files</a></li>
      <li><a href="#Load-Teletext-EPG">Load Teletext EPG</a></li>
      <li><a href="#Enable-acquisition">Enable acquisition</a></li>
      <li><a href="#Connect-to-acq.-daemon">Connect to acq. daemon</a></li>
      <li><a href="#View-statistics-timescales">View statistics/timescales</a></li>
      <li><a href="#Export-as-text">Export as text</a></li>
      <li><a href="#Export-as-XMLTV">Export as XMLTV</a></li>
      <li><a href="#Export-as-HTML">Export as HTML</a></li>
      <li><a href="#Quit">Quit</a></li>
    </ul>
  </li>
  <li><a href="#CONFIGURE-MENU">CONFIGURE MENU</a>
    <ul>
      <li><a href="#Teletext-Grabber">Teletext Grabber</a></li>
      <li><a href="#TV-channel-scan">TV channel scan</a></li>
      <li><a href="#TV-card-input">TV card input</a></li>
      <li><a href="#Client-Server">Client/Server</a></li>
      <li><a href="#TV-application-interaction">TV application interaction</a></li>
      <li><a href="#Select-attributes">Select attributes</a></li>
      <li><a href="#Attribute-composition">Attribute composition</a></li>
      <li><a href="#Select-networks">Select networks</a></li>
      <li><a href="#Network-names">Network names</a></li>
      <li><a href="#Context-menu-configuration">Context menu configuration</a></li>
      <li><a href="#Themes-language">Themes language</a></li>
      <li><a href="#Show-Hide">Show/Hide</a></li>
      <li><a href="#List-layout">List layout</a></li>
    </ul>
  </li>
  <li><a href="#FILES">FILES</a>
    <ul>
      <li><a href="#Files-used-on-UNIX-systems">Files used on UNIX systems</a></li>
      <li><a href="#Files-used-on-Windows-systems">Files used on Windows systems</a></li>
    </ul>
  </li>
  <li><a href="#AUTHOR">AUTHOR</a></li>
  <li><a href="#COPYRIGHT">COPYRIGHT</a></li>
</ul>

<h1 id="NAME">NAME</h1>

<p>nxtvepg - Anzeige von EPG aus XMLTV Dateien und Teletext EPG Grabber</p>

<h1 id="SYNOPSIS">SYNOPSIS</h1>

<p><b>nxtvepg</b> <span style="white-space: nowrap;">[ options ]</span> <span style="white-space: nowrap;">[ XMLTV_files ... ]</span></p>

<p><b>nxtvepgd</b> <span style="white-space: nowrap;">[ daemon options ]</span></p>

<h1 id="DESCRIPTION">DESCRIPTION</h1>

<p><b>nxtvepg</b> ist eine X11- und Windows-Anwendung zur Anzeige von TV-Programminformationen (EPG) aus Dateien in XMLTV Format. Wenn eine TV-Karte vorhanden ist, kann nxtvepg zus&auml;tzlich Programminformationen aus Teletext-Seiten ausgew&auml;hlter TV-Programme extrahieren und anzeigen, oder im XMLTV Format exportieren.</p>

<p><b>nxtvepgd</b> ist eine reduzierte Variante von nxtvepg, die nur den Teletext EPG Grabber beinhaltet. Das Programm hat keine graphische Oberfl&auml;che, sondern arbeitet im Hintergrund als sogenannter &quot;daemon&quot; Prozess. Der Prozess akquiriert kontinuierlich TV-Programminformationen aus dem Teletext und aktualisiert XMLTV Dateien, die dann im nxtvepg GUI oder anderen Anwendungen geladen werden k&ouml;nnen.</p>

<p>Neue Anwender sollten mit dem Lesen dieser Bedienungsanleitung bei Kapitel <a href="#GETTING-STARTED">&quot;GETTING STARTED&quot;</a> beginnen, das die Konfiguration des Teletext EPG Grabbers beschreibt. Falls Sie dieses Feature nicht verwenden wollen, k&ouml;nnen Sie mit Kapitel <a href="#BASIC-BROWSING">&quot;BASIC BROWSING&quot;</a> beginnen.</p>

<h1 id="OPTIONS">OPTIONS</h1>

<p>Als <i>XMLTV_files ...</i> Parameter auf der Kommandozeile k&ouml;nnen eine oder mehrere Dateien im XMLTV Format angegeben werden. Falls mehr als eine Datei angegeben ist, werden sie zusammengef&uuml;hrt wie im Kapitel <a href="#MERGED-DATABASES">&quot;MERGED DATABASES&quot;</a> beschrieben. Die Daten aus den XMLTV Dateien werden dann im GUI angezeigt.</p>

<p>Zusammenfassung der Kommandozeilenoptionen:</p>

<dl>

<dt id="display-display"><b>-display</b> <i>display</i></dt>
<dd>

<p>Nur UNIX: Das Display auf dem die Benutzeroberfl&auml;che platziert werden soll, zum Beispiel <b>localhost:0.0</b>. Vorgabe: Aus der Umgebungsvariable <i>DISPLAY</i>. Weitere Informationen siehe UNIX-Manuals zur <i>X</i>-Sektion <b>Display Names</b></p>

</dd>
<dt id="tvdisplay-display"><b>-tvdisplay</b> <i>display</i></dt>
<dd>

<p>Nur UNIX: Das Display auf welchem die TV-Anwendung gesucht wird, z.B. auf einem zweiten Rechner oder einem anderen Bildschirm eines Systems mit mehreren Monitoren. Vorgabe: auf gleichem Display wie die Hauptanwendung.</p>

</dd>
<dt id="geometry-geometry"><b>-geometry</b> <i>geometry</i></dt>
<dd>

<p>Spezifiziert die Position des Hauptfensters, z.B. <b>-geometry -0+0</b> um das Hauptfenster in die obere rechte Ecke des sichtbaren Bereiches zu platzieren. Die Gr&ouml;&szlig;e des Fensters kann nicht ver&auml;ndert werden.</p>

</dd>
<dt id="iconic"><b>-iconic</b></dt>
<dd>

<p>Starte mit dem Hauptfenster als Icon (bzw. minimiert)</p>

<p>F&uuml;r Windows-Nutzer ist diese Option besonders hilfreich, wenn nxtvepg &uuml;ber die <i>Autostart</i>-Gruppe gestartet wird. Wird &quot;<i>Hide on minimize</i>&quot; benutzt, startet nxtvepg fast unsichtbar im Hintergrund nur mit einem Symbol im Tray der Taskleiste (siehe auch <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;Show/Hide&quot;).</p>

</dd>
<dt id="rcfile-path"><b>-rcfile</b> <i>path</i></dt>
<dd>

<p>Spezifiziert eine alternative Konfigurationsdatei. Vorgabe: auf UNIX <i>$HOME/.config/nxtvepg/nxtvepgrc</i>, auf Windows <i>nxtvepg.ini</i> im aktuellen Verzeichnis.</p>

</dd>
<dt id="dbdir-directory"><b>-dbdir</b> <i>directory</i></dt>
<dd>

<p>Spezifiziert ein alternatives Verzeichnis f&uuml;r die durch den Teletext EPG Grabber erzeugten XMLTV Dateien. Vorgabe: Auf UNIX <i>$HOME/.cache/nxtvepg</i>, auf Windows das aktuelle Verzeichnis.</p>

<p>Achtung: Es besteht kein Schutz vor gleichzeitigem Schreiben durch mehrere nxtvepg-Instanzen. In dem Fall m&uuml;ssen Sie diese Option f&uuml;r mindestens eine der Instanzen verwenden, damit verschiedene Verzeichnisse verwendet werden.</p>

<p>Wenn nxtvepg im &quot;Daemon&quot;-Modus benutzt wird, muss der Browser so konfiguriert werden, dass er das gleiche Verzeichnis wie der Daemon-Prozess verwendet. L&auml;uft der Daemon auf einem anderen Host, muss auf das dort verwendete Verzeichnis z.B. &uuml;ber NFS mount lokal verf&uuml;gbar gemacht werden.</p>

</dd>
<dt id="card-index"><b>-card</b> <i>index</i></dt>
<dd>

<p>Gibt an welche TV-Hardware benutzt werden soll, wenn mehr als eine Karte verf&uuml;gbar ist. Vorgabe: Index 0. Bei Linux wird der Index an den Ger&auml;tenamen angeh&auml;ngt, z.B. <i>/dev/vbi2</i> und <i>/dev/video2</i> (siehe auch <a href="#FILES">&quot;FILES&quot;</a>). Auf Windows bedeutet der Index &quot;n&quot; die n-te gefundene Karte, die beim Scan des PCI-Busses nach Karten mit unterst&uuml;tztem Capture-Chip (z.B. Brooktree Bt878, Bt878A, Bt848, Bt849, Philips SAA7134, Conexant 23881) gefunden wurde. Wird mehr als eine Karte mit dem gleichen Chip gefunden, ist die Reihenfolge dieser undefiniert aber konstant. (Die Reihenfolge wird vom Treiber, nicht von nxtvepg festgelegt.)</p>

</dd>
<dt id="provider-CNI"><b>-provider</b> <i>CNI</i></dt>
<dd>

<p>W&auml;hlt einen Provider mit dessen hexadezimalen CNI (Country and Network Identifier), z.B. <i>-provider d92</i> f&uuml;r <b>Kabel1</b>. Den CNI des Providers k&ouml;nnen Sie w&auml;hrend dem Provider-Suchlauf oder aus den Namen der Datenbank-Dateien herausfinden. Verwenden Sie das Schl&uuml;sselwort <i>merged</i>, um eine zusammengef&uuml;hrte Datenbank zu dumpen (oder den Code <i>FF</i> wie er von fr&uuml;heren Versionen von nxtvepg ben&ouml;tigt wurde). Achtung, bevor Sie eine zusammengef&uuml;hrte Datenbank nutzen k&ouml;nnen, sollten Sie diese konfigurieren, siehe <a href="#MERGED-DATABASES">&quot;MERGED DATABASES&quot;</a>. Vorgabe wenn diese Option weggelassen wird: der letzte Provider, der w&auml;hrend einer vorangehenden Session gew&auml;hlt wurde.</p>

</dd>
<dt id="noacq"><b>-noacq</b></dt>
<dd>

<p>Starte mit abgeschalteter Akquisition. Die Akquisition kann sp&auml;ter immer noch &uuml;ber das Contol-Men&uuml; gestartet werden (siehe <a href="#CONTROL-MENU:-Enable-acquisition">&quot;CONTROL MENU: Enable acquisition&quot;</a>)</p>

</dd>
<dt id="daemon"><b>-daemon</b></dt>
<dd>

<p>Starte ohne grafische Oberfl&auml;che. Der Prozess wird von der Oberfl&auml;che getrennt (d.h. ohne sichtbares Fenster auf dem Desktop) und f&uuml;hrt die Akquisition im Hintergrund aus. Wenn keine anderen Optionen angegeben sind, wird der gleiche Akquisitionsmodus wie in der GUI konfiguriert benutzt. Die Option <i>-daemon</i> kann nicht mit <i>-noacq</i>, <i>-remctrl</i> oder anderen GUI-bezogenen Optionen kombiniert werden.</p>

<p>Der Daemon erzeugt immer einen Socket im Verzeichnis <i>/tmp</i> (nur UNIX) und optional einen TCP/IP-Socket, um Browserprozessen Verbindungen zu erlauben. Wenn verbunden, wird der Browser benachrichtigt wenn der Teletext EPG Grabber XMLTV Dateien aktualisiert; Wenn die Verbindung nicht besteht kann es vorkommen, dass die Programmdaten des Browsers unvollst&auml;ndig oder veraltet bleiben.</p>

<p>Zu beachten ist dass der Browser das gleiche XMLTV Datenbankverzeichnis (siehe Option <i>-dbdir</i>) nutzen <b>muss</b>, weil der Daemon nur Unterschiede an den im selben Verzeichnis gespeicherten Datenbank-Dateien sendet. Weitere Details siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;Client/Server&quot;.</p>

<p>UNIX Warnung: Aus Sicherheitsgr&uuml;nden ist davon abzuraten, den Daemon-Prozess mit Administrator-Rechten laufen zu lassen (d.h. als &quot;root&quot;). Nxtvepg wurde nicht auf m&ouml;gliche Schwachstellen untersucht. Wenn der Daemon schon beim Systemstart geladen werden soll, sollten Sie das &quot;su&quot;-Kommando verwenden. Auch ist zu beachten, dass wahrscheinlich die Optionen <i>-rcfile</i> und <i>-dbdir</i> angegeben werden m&uuml;ssen, da die Umgebungsvariable $HOME m&ouml;glicherweise nicht (korrekt) gesetzt ist. Beispiel:</p>

<pre><code>su nobody -c &quot;/usr/local/bin/nxtvepg -daemon \
              -rcfile /usr/local/etc/nxtvepgrc&quot;</code></pre>

<p>Zum Beenden des Daemon-Prozesses siehe unten stehende Option <i>-daemonstop</i>.</p>

</dd>
<dt id="daemonstop"><b>-daemonstop</b></dt>
<dd>

<p>Mit dieser Option wird ein im Hintergrund laufender Akquistionsprozess gesucht und falls gefunden angehalten; danach beendet sich das Programm. Beachten Sie, dass Sie die entsprechende Berechtigung ben&ouml;tigen, ein Signal zum Beenden des Prozesses zu senden (muss mit derselben Benutzer-ID laufen). Diese Option ist dazu gedacht, die Steuerung der Akquisition durch Skripte zu erm&ouml;glichen, z.B. um diese zu einer bestimmten Zeit automatisch zu starten oder zu terminieren.</p>

<p><b>Tipp:</b> Wenn der Daemon auf dem gleichen Host und der selben uid l&auml;uft, k&ouml;nnen Sie ihn auch beenden, indem Sie die Option &quot;<i>Enable acquisition</i>&quot; unter dem <i>Control</i>-Men&uuml; abstellen, w&auml;hrend Sie mit dem Daemon verbunden sind. Weitere Details siehe <a href="#CONTROL-MENU">&quot;CONTROL MENU&quot;</a> und <a href="#FILES">&quot;FILES&quot;</a>.</p>

</dd>
<dt id="daemonquery"><b>-daemonquery</b></dt>
<dd>

<p>Mit dieser Option wird der Status eines im Hintergrund laufender Akquistionsprozess erfragt und ausgegeben. Auf diese Weise kann der Status ohne Verwendung der grafischen Benutzerschnittstelle von nxtvepg abgefragt werden. Dies erm&ouml;glicht auch den Status innerhalb von Skripten automatisch zu verarbeiten. Der Statustext wird auf das Terminal ausgegeben falls sie nicht umgelenkt werden (siehe auch Option <i>-outfile</i>.) Fehlermeldung erscheinen ebenfalls auf dem Terminal.</p>

<p>F&uuml;r die Abfrage aus anderen Programmen heraus kann der Status auch direkt vom Hintergrundproze&szlig; abgefragt werden, d.h. ohne Option <i>-daemonquery</i>. Dazu mu&szlig; eine TCP Verbindung zum Host und Port an dem der Daemon Client-Verbindungen annimmt aufgebaut werden und der Bin&auml;r-String &quot;\x00\x11\x00\x00ACQSTAT&quot; gesendet werden. Der Daemon antwortet dann mit einem 4-Byte Header und danach dem Statustext in variabler L&auml;nge. Die ersten beiden Bytes des Headers spezifizieren die L&auml;nge des Texts inklusive Header in &quot;Big-Endian&quot;; die n&auml;chsten zwei Bytes k&ouml;nnen in diesem Fall ignoriert werden. Hier ist ein Beispielprogramm implementiert in der Programmiersprache <i>Tcl</i>:</p>

<pre><code>#!/usr/bin/tclsh
if {[catch {set sock_fd [socket localhost 7658]} err] == 0} {
   fconfigure $sock_fd -buffering none -encoding binary
   puts -nonewline $sock_fd [binary format Scxa7 11 0 ACQSTAT]
   set line [read $sock_fd 4]
   binary scan $line &quot;Scx&quot; len type
   set line [read $sock_fd [expr {$len - 4}]]
   binary scan $line &quot;a*&quot; msg
   puts -nonewline $msg
} else {
   puts stderr &quot;Failed to connect to daemon ($err)&quot;
}</code></pre>

</dd>
<dt id="nodetach"><b>-nodetach</b></dt>
<dd>

<p>Nur UNIX: Im Daemon-Modus verhindert diese Option, dass sich der Prozess vom Terminal abkoppelt. Logmeldungen ab Level <i>warning</i> werden dann am Terminal ausgegeben (z.B. Konfigurationsfehler die zu unmittelbarem Programmabbruch f&uuml;hren). Au&szlig;erdem kann das Programm mit &quot;Strg+C&quot; abgebrochen werden. Dieser Modus dient nur Debugging-Zwecken.</p>

</dd>
<dt id="acqpassive"><b>-acqpassive</b></dt>
<dd>

<p>Im Daemon-Modus &uuml;berschreibt diese Option die Akquisitionseinstellung der Konfigurationsdatei und zwingt die Akquisition in den passiven Modus (siehe <a href="#TELETEXT-EPG-GRABBER">&quot;TELETEXT EPG GRABBER&quot;</a>). Die Konfigurationsdatei wird nicht ge&auml;ndert, sodass Sie verschiedene Akqusitionsstrategien f&uuml;r Daemon und GUI verwenden k&ouml;nnen.</p>

</dd>
<dt id="acqonce-phase"><b>-acqonce</b> <i>phase</i></dt>
<dd>

<p>Im Daemon-Modus h&auml;lt diese Option automatisch die Akquisition an und beendet den Daemon nachdem die vorgegebene Phase f&uuml;r alle Provider abgeschlossen wurde. Die Phasen sind die gleichen wie unter <a href="#TELETEXT-EPG-GRABBER">&quot;TELETEXT EPG GRABBER&quot;</a> definiert, d.h. <i>now</i> oder <i>full</i>.</p>

<p>Falls Sie nach dem Schlie&szlig;en von nxtvepg ein anderes Programm starten m&ouml;chten, verwenden Sie Option <i>-nodetach</i> (nur auf UNIX verf&uuml;gbar). In diesem Fall wird die aufrufende Shell mit dem Start des n&auml;chsten Kommandos in Ihrem Skript warten bis nxtvepg beendet ist. Auf Windows gibt es keinen einfachen Weg um dies zu erreichen, da nxtvepg keine so genannte &quot;Console&quot;-Applikation ist und somit immer im Hintergrund gestartet wird. Deshalb ben&ouml;tigen Sie eine Skript-Sprache die es erlaubt darauf zu warten, dass nxtvepg terminiert.</p>

</dd>
<dt id="dump-mode"><b>-dump</b> <i>mode</i></dt>
<dd>

<p>Mit diesem Argument exportiert nxtvepg nur die Datenbank und beendigt sich danach ohne den Browser zu starten. Dieses Argument muss mit <i>-provider</i> kombiniert werden, um die zu exportierende Datenbank auszuw&auml;hlen.</p>

<p>Verwenden Sie das Schl&uuml;sselwort <i>xml</i> als Modus, um die Datenbank in das XML-Format zu exportieren. Ben&ouml;tigen Sie eine andere als die zuletzt im &quot;Export&quot;-Dialog des Control-Men&uuml;s eingestellte XMLTV-Variante, verwenden Sie <i>xml5utc</i> oder <i>xml5ltz</i> um die Variante direkt festzulegen. Weitere Details siehe <a href="#CONTROL-MENU:-Export-as-XMLTV">&quot;CONTROL MENU: Export as XMLTV&quot;</a>.</p>

<p>Verwenden Sie das Schl&uuml;sselwort <i>html</i> als Modus, um Programmdaten in ein HTML Dokument zu exportieren. Es werden die zuletzt im HTML-Export Dialog eingestellten Optionen verwendet. (Es sei denn &quot;nxtvepgd&quot;, d.h. der reine Akquisitions-Daemon wird f&uuml;r den Export verwendet.) Weitere Details siehe <a href="#CONTROL-MENU:-Export-as-HTML">&quot;CONTROL MENU: Export as HTML&quot;</a>. Zus&auml;tzlich k&ouml;nnen Sie die Zahl der exportierten Programme limitieren indem Sie das Limit durch Doppelpunkt getrennt anh&auml;ngen (z.B. <code>-dump html:50</code>.) Das Format der Programmliste ist jedoch nicht &uuml;ber Kommandozeilenparameter konfigurierbar.</p>

<p>Um die Daten in tabellarischer Form in eine Textdatei zu exportieren (z.B. f&uuml;r den Import in eine SQL-Datenbank) sind die folgenden Schl&uuml;sselw&ouml;rter vorhanden: <i>pi</i>, um die gesamte TV-Sendungsbeschreibungen auszugeben; <i>ai</i>, um die Kanal- bzw. Sendertabelle auszugeben; <i>themes</i>, um die Themenkategorien-Tabelle auszugeben. Weitere Details siehe <a href="#CONTROL-MENU:-Export-as-text">&quot;CONTROL MENU: Export as text&quot;</a>.</p>

<p>Alle Ausgaben werden auf das Terminal ausgegeben (das so genannte <i>stdout</i>) falls sie nicht per Pipeline &quot;|&quot; in ein anderes Programm oder per &quot;&gt;&quot; in eine Datei umgelenkt werden. Siehe auch Option <i>-outfile</i>.</p>

</dd>
<dt id="outfile-path"><b>-outfile</b> <i>path</i></dt>
<dd>

<p>Diese Option erm&ouml;glicht es, die Ausgaben von <i>-dump</i> oder anderen Betriebsmodi, die standardm&auml;&szlig;ig auf das Terminal schreiben, umzulenken. Die Option kann auch im Normalmodus verwendet werden, jedoch wird die erzeugte Datei leer bleiben. nxtvepg bricht mit einem Fehler ab wenn die angegebene Datei schon existiert, um zu verhindern dass Sie aus Versehen andere Dateien &uuml;berschreiben. Wenn Sie die Option in einem Skript oder einer Batch-Datei verwenden, k&ouml;nnen sie ein Kommando voranstellen das die Zieldatei l&ouml;scht, falls sie schon existiert.</p>

<p>Diese Option ist insbesondere f&uuml;r Windows-Nutzer hilfreich, da dieses Betriebssystem Ausgaben nach <i>stdout</i> schlicht und einfach verwirft (da nxtvepg keine Konsolenapplikation ist, sondern ein GUI hat). Dies bedeutet, dass Sie &uuml;berhaupt keine Ausgabe sehen werden, wenn Sie nicht eine der hier beschriebenen Methoden zur Umlenkung der Ausgabe verwenden.</p>

<p><b>Tipp:</b> Anstelle der Option -outfile k&ouml;nnen Sie die Ausgabe auch mit &quot;&gt;&quot; oder &quot;|&quot; umleiten. Dies funktioniert unter UNIX in jedem beliebigen Terminal bzw. jeder Shell und unter Windows in einem MS-DOS Kommandofenster oder einer Batch-Datei. Beispiele:</p>

<pre><code>nxtvepg -dump ai tv.xml &gt; networks.txt
nxtvepg -dump ai tv.xml | more</code></pre>

<p>Das erste Beispiel schreibt die Sendertabelle der XMLTV Datei &quot;tv.xml&quot; in eine Datei namens <i>networks.txt</i>; das zweite lenkt die Ausgabe zum Programm &quot;more&quot; um, einem Programm zur Textanzeige.</p>

</dd>
<dt id="epgquery-FILTER-option"><b>-epgquery</b> <i>FILTER=option</i></dt>
<dd>

<p>Diese Option kann zusammen mit <b>-dump</b> verwendet werden um die Ausgabe von Programminformationen einzuschr&auml;nken. Die verf&uuml;gbaren Filter entsprechen denen des Filter Men&uuml;s in der grafischen Benutzeroberfl&auml;che. Die Option kann mehrfach angegeben werden um mehrere Filter einzuschalten.</p>

<p>F&uuml;r eine Liste der verf&uuml;gbaren Filter siehe die englische Version des Manuals.</p>

</dd>
<dt id="remctrl-command"><b>-remctrl</b> <i>command</i></dt>
<dd>

<p>Mit dieser Option k&ouml;nnen Sie eine andere, zuvor gestartete GUI-Instanz von nxtvepg fernsteuern, also den jeweiligen Befehl an die andere Instanz senden.</p>

<p>Folgende Befehle sind verf&uuml;gbar: <i>quit</i> beendet den anderen nxtvepg-Prozess; <i>iconify</i> minimiert das Fenster; <i>deiconify</i> macht eine vorhergehende Minimierung r&uuml;ckg&auml;ngig; <i>raise</i> macht eine Minimierung des anderen Fensters r&uuml;ckg&auml;ngig und holt es in den Vordergrund (f&uuml;r den Fall, dass es von anderen Fenstern &uuml;berdeckt sein sollte); <i>acqon</i> startet die Akquisition; <i>acqoff</i> beendet die Akquisition.</p>

</dd>
<dt id="clock-mode"><b>-clock</b> <i>mode</i></dt>
<dd>

<p>Mit dieser Option startet nxtvepg in einem besonderen Betriebsmodus in dem nur Datum und Uhrzeit aus dem Teletext ermittelt werden. Danach beendet sich das Programm wieder. Als Quelle wird das erste Programm in der Programmtabelle der konfigurierten TV-Applikation verwendet.</p>

<p><b>Wichtige Einschr&auml;nkung:</b> nxtvepg kann die Zeit nur von Sendern lesen die im Teletext ein so genanntes <i>packet 8/30/1</i> ausstrahlen. Dieses enth&auml;lt Datum, Zeit und Zeitzone in einer genau festgelegten Bin&auml;rkodierung. nxtvepg wird niemals die Uhrzeit aus der Teletextkopfzeile verwenden, da diese wegen Laufschriften, unterschiedlichen Formaten uvm. sehr unzuverl&auml;ssig ist.</p>

<p>Mit dem Modus <i>print</i> wird Datum und Zeit ermittelt und auf das Terminal ausgegeben. Auch hier empfiehlt sich die Umlenkung der Ausgaben, wie bei Option <i>-outfile</i> beschrieben.</p>

<p>Mit dem Modus <i>set</i> wird die ermittelte Zeit als aktuelle Systemzeit eingestellt. Voraussetzung ist, dass der aufrufende Benutzer die dazu erforderlichen Privilegien besitzt (z.B. m&uuml;ssen sie unter UNIX als Administrator <i>root</i> angemeldet sein).</p>

<p>Wenn Sie UNIX verwenden, sollten Sie au&szlig;erdem bedenken, dass das Kommando <i>date</i> nicht die batteriegest&uuml;tzte Echtzeituhr einstellt (auch genannt Real Time Clock, <b>RTC</b>). Deshalb kann es passieren, dass die Korrektur mit dem n&auml;chsten reboot vergessen wird. Um die RTC zu korrigieren, k&ouml;nnen Sie abschlie&szlig;end <i>hwclock --systohc</i> oder ein entsprechendes Kommando aufrufen. Manche Linux-Distributionen rufen dieses Kommando beim Herunterfahren des Rechners auch automatisch auf.</p>

</dd>
<dt id="help"><b>-help</b></dt>
<dd>

<p>Gibt eine kurze &Uuml;bersicht aller verf&uuml;gbaren Befehlszeilen-Optionen aus.</p>

</dd>
</dl>

<p>Wenn Sie XMLTV Dateien auf der Kommandozeile angeben, m&uuml;ssen diese an letzter Stelle sein, d.h. nach allen Optionen.</p>

<p>Hinweis f&uuml;r Windows-Benutzer: alle diese Optionen sind - sofern nicht anders angegeben - auch in der Windows-Version verf&uuml;gbar. Sie k&ouml;nnen die Optionen entweder an der &quot;MS-DOS&quot;-Eingabeaufforderung oder in einer Batchdatei &uuml;bergeben, oder durch Anh&auml;ngen an Pfad und Namen der ausf&uuml;hrbaren Datei in einer Verkn&uuml;pfungsdefinition (engl. &quot;shortcut&quot;).</p>

<h1 id="GETTING-STARTED">GETTING STARTED</h1>

<p>Dieses Handbuch beschreibt alle Eigenschaften von nxtvepg detailliert. Sie m&uuml;ssen nicht alles davon auf einmal lesen, um die Software bedienen zu k&ouml;nnen.</p>

<p>Falls Sie nxtvepg nur zur Anzeige von Programminformationen aus Dateien im XMLTV Format benutzen m&ouml;chten, k&ouml;nnen Sie dieses Kapitel &uuml;berspringen. Es empfiehlt sich jedoch, wenigstens die Kapitel <a href="#BASIC-BROWSING">&quot;BASIC BROWSING&quot;</a> und <a href="#FILTERING">&quot;FILTERING&quot;</a> querzulesen.</p>

<p>Die folgenden Abschnitte beschreiben die minimal notwendigen Schritte um den Teletext EPG Grabber zu starten und damit TV-Programminformationen zu erhalten. Normalerweise sollte das nur einige wenige Mausklicks an den richtigen Stellen erfordern.</p>

<p>F&uuml;r eine detaillierte Beschreibung der Konfiguration des Teletext Grabbers und seiner Funktionsweise, siehe Kapitel <a href="#TELETEXT-EPG-GRABBER">&quot;TELETEXT EPG GRABBER&quot;</a>.</p>

<h2 id="Configuring-the-Teletext-EPG-Grabber">Configuring the Teletext EPG Grabber</h2>

<p>Der Teletext EPG Grabber ist in nxtvepg initial nicht aktiviert, da eine TV-Kanaltabelle konfiguriert werden mu&szlig;, damit nxtvepg in der Lage ist von diesen TV-Kan&auml;len Teletext zu empfangen. Dies geschieht &uuml;ber den <i>Teletext Grabber</i> Eintrag im <i>Configure</i> Men&uuml;.</p>

<p>Um den Teletext Grabber einzuschalten mu&szlig; zuerst der Haken am obersten Feld des Dialogfensters gesetzt werden. Danach w&auml;hlen Sie eine TV-Applikation aus dem Men&uuml; innerhalb des Rahmens <i>TV channel table</i>. nxtvepg wird daraufhin versuchen die Kanaltabelle automatisch zu finden. Falls der Pfad nicht im Eingabefeld unterhalb des Auswahlmen&uuml;s erscheint, klicken Sie auf das Verzeichnissymbol neben dem Eingabefeld und geben Sie den Pfad manuell an. Danach kann der <i>Test</i>-Knopf verwendet werden um zu pr&uuml;fen ob nxtvepg die Kanaltabelle aus der Datei auslesen kann.</p>

<p>Optional, jedoch empfehlenswert, ist danach den Wert im Eingabefeld <i>Number of TV channels to grab</i> im Rahmen <i>Teletext options</i> zu pr&uuml;fen. Der Teletext Grabber wird nur von der angegebenen Zahl von TV-Kan&auml;len Programminformationen sammeln, beginnend am Anfang der Kanaltabelle (Radiokan&auml;le werden damit nicht mitgez&auml;hlt). Falls Sie die Kanaltabelle so sortiert haben, dass die f&uuml;r Sie interessanten Kan&auml;le am Anfang stehen, k&ouml;nnen Sie diese Einstellung nutzen um nicht interessante Sender auszuschlie&szlig;en. Dies vermeidet das der Grabber nutzlose Daten sammelt. Die Einstellung bestimmt au&szlig;erdem, wie viele Sender in die Anzeige geladen werden, wenn Sie den <i>Load Teletext EPG</i> Men&uuml;eintrag im <i>Control</i> Men&uuml; verwenden um Teletext EPG anzuzeigen.</p>

<p>Erkl&auml;rungen zu weiteren Einstellungen im Teletext Grabber Men&uuml; finden Sie in der &quot;Teletext Grabber&quot; Sektion des Kapitels <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>.</p>

<p>Wenn die den Konfigurationsdialog mit dem &quot;Ok&quot; Knopf verlassen, wird nxtvepg automatisch beginnen Programminformationen aus dem Teletext zu laden (es sei denn Die haben im Dialog die Option <i>Start acquisition automatically</i> deaktiviert). Es erscheint dann eine entsprechende Notiz in der Statuszeile am unteren Ende des Hauptfensters. Falls noch keine anderen XMLTV Dateien geladen wurden, wird nxtvepg automatisch die generierten Programminformationen anzeigen sobald sie verf&uuml;gbar werden. Normalerweise dauert dies ca. 2 Minuten (einstellbar im Konfigurationsmen&uuml;). Falls nach dieser Zeit keine Anzeige erscheint, pr&uuml;fen Sie die Einstellungen wie im n&auml;chsten Abschnitt beschrieben, und pr&uuml;fen Sie ob die ersten TV-Kan&auml;le in der konfigurierten Kanaltabelle Teletext aussenden.</p>

<h2 id="Configuring-TV-card-input">Configuring TV card input</h2>

<p>Der Teletext EPG Grabber ben&ouml;tigt eine TV-Karte um Teletext empfangen zu k&ouml;nnen. Initial verwendet nxtvepg die erste TV-Karte die vom Betriebssystem gemeldet wird, und davon die erste Eingabequelle. Falls Sie nur eine TV-Karte in Ihrem PC verbaut haben und diese nur einen Antenneneingang hat, wird die Voreinstellung ausreichend sein. Andernfalls sollten Sie die automatisch getroffene Auswahl mittels &uuml;ber das <i>Configure</i> Men&uuml; erreichbaren <i>TV card input</i> Dialogs &uuml;berpr&uuml;fen.</p>

<p>Im Rahmen an der Oberseite des Dialogs wird eine TV-Karte ausgew&auml;hlt. Zur Wahl stehen alle vom Betriebssystem erkannten TV-Karten. Stellen Sie zuerst den Kartentyp mittels des Optionsfelds ein: W&auml;hlen Sie <i>Digital TV</i> f&uuml;r DVB, oder <i>Analog TV</i>. Zuerst sollte &uuml;ber die Kn&ouml;pfe ein Kartentyp ausgew&auml;hlt werden: Digital TV steht f&uuml;r DVB Karten (die die aktuellen &Uuml;bertragungsstandards), Analog TV f&uuml;r PAL/SECAM (d.h. die &auml;lteren, in Europa nicht mehr f&uuml;r TV verwendeten &Uuml;bertragungsstandards). Nach der Auswahl wird der vom Treiber identifizierte Name der TV-Karte oberhalb angezeigt. Haben Sie mehr als eine TV-Tunerkarte in Ihrem Rechner, k&ouml;nnen Sie dann w&auml;hlen, welche Sie nutzen wollen.</p>

<p>Nachdem Sie die TV-Karte ausgew&auml;hlt haben, pr&uuml;fen Sie ob als Eingabequelle <i>Video source</i> die TV-Antenne eingestellt ist. Je nach Kartentreiber, kann der angezeigte Text daf&uuml;r unterschiedlich ausfallen, wie z.B. &quot;TV tuner&quot; oder &quot;RF input&quot;. Wenn die Einstellung korrekt ist, k&ouml;nnen Sie den Dialog mit &quot;Ok&quot; verlassen. Falls der Teletext Grabber schon aktiviert ist, werden die neuen Einstellungen sofort &uuml;bernommen. Ansonsten k&ouml;nnen Sie den Grabber jetzt mittels des <i>Enable acquisition</i> Eintrags im Control Men&uuml; aktivieren. Es sollte dann die Notiz &quot;Acquisition working...&quot; in der Statuszeile erscheinen.</p>

<h2 id="Configuring-a-TV-application">Configuring a TV application</h2>

<p>nxtvepg kann wie folgt mit TV-Anwendungen zusammenarbeiten:</p>

<ul>

<li><p>Das Laden der TV-Kanalliste der von Ihnen verwendeten TV-Applikation erlaubt die einfache Synchronisation der Sendernamen in der Programm&uuml;bersicht f&uuml;r den Fall das Ihr EPG Provider andere Sendernamen verwendet. Siehe dazu Dialog &quot;<i>Network name</i>&quot; im <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>. Falls Sie den Teletext-EPG Grabber verwenden ist dieser Schritt jedoch nicht notwendig, da der Grabber bereits die Namen aus derselben Kanalliste verwendet.</p>

</li>
<li><p>Die Interaktion zwischen nxtvepg und der TV-Anwendung, um Ihnen n&uuml;tzliche Features zur Verf&uuml;gung zu stellen, wie z.B. ein On-Screen-Display des Titels der aktuell laufenden Sendung nach dem Kanalwechsel, wenn Sie aus nxtvepg heraus mit dem Button &quot;<i>Tune TV</i>&quot; den Kanal &auml;ndern, sowie auch z.B. die im Hintergrund laufende Akquisition der EPG Daten w&auml;hrend Sie Ihr TV-Programm ansehen.</p>

</li>
</ul>

<p>Das erste Feature ist eine passive Funktion, d.h. nur nxtvepg muss an die entsprechende TV-Anwendung angepasst werden. Der zweite jedoch erfordert die Kooperation beider Seiten. Aus diesem Grund wird die Zahl der TV-Anwendungen, f&uuml;r die passive Funktionen unterst&uuml;tzt werden, immer wesentlich gr&ouml;&szlig;er sein.</p>

<p>Betreffend das zweite, aktive Feature: Auf Windows werden die Interaktionsfunktionen derzeit nur von K!TV unterst&uuml;tzt (einer TV-Anwendung f&uuml;r analoge TV-Karten). Auf UNIX werden bisher leider nur &auml;ltere analoge TV-Applikationen wie z.B. &quot;xawtv&quot; f&uuml;r diese Features unterst&uuml;tzt, jedoch keine DVB TV-Applikationen. Die Liste der unterst&uuml;tzten Applikationen finden Sie im Konfigurationsdialog &quot;<i>TV app. interaction</i>&quot; (siehe Kapitel <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>).</p>

<p>Sie k&ouml;nnen testen ob nxtvepg mit einer TV-Anwendung interagieren kann, indem Sie beide Programme starten und danach in nxtvepg den Dialog zur &quot;<i>TV app. interaction</i>&quot; im Konfigurationsmen&uuml; &ouml;ffnen. Der Verbindungsstatus ist in der Mitte des Dialogfensters angegeben. Nur mit kooperierenden TV-Anwendungen ist nxtvepg in der Lage, die Karte auch dann automatisch frei zu geben, wenn die TV-Anwendung bereits gestartet ist (Fernsehen hat immer den Vorrang gegen&uuml;ber der Akquisition der EPG-Daten).</p>

<p>Falls Sie nicht den Teletext EPG Grabber verwenden, sollten Sie nach dem Einstellen von TV-Anwendungstyp und -pfad den Konfigurationsdialog &quot;<i>Network name</i>&quot; &ouml;ffnen, um die Sendernamen zwischen TV-Anwendung und nxtvepg zu synchronisieren. Selbst wenn keine Interaktion m&ouml;glich ist, erleichtert es die Bedienung wenn dieselben Sendernamen in beiden Applikationen gezeigt werden. Details sind in <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;Network names&quot; zu finden.</p>

<h1 id="BASIC-BROWSING">BASIC BROWSING</h1>

<p>Das Hauptfenster des Browsers besteht haupts&auml;chlich aus zwei Bereichen: Der Obere enth&auml;lt eine Liste nach Startzeit sortierter Titel der Sendungen. Alle aktuell laufenden Sendungen (oder eher: alle Sendungen, die gem&auml;&szlig; der Startzeit laufen sollten) sind durch eine hellblaue Hintergrundfarbe gekennzeichnet. Eine Zeile in der Liste ist von einem Cursor ausgew&auml;hlt (fokussiert); der untere Bereich enth&auml;lt die Beschreibung f&uuml;r den ausgew&auml;hlten Titel. Die Menge der hier verf&uuml;gbaren Informationen h&auml;ngt ausschlie&szlig;lich vom Inhaltsprovider ab.</p>

<p>Das einfache Bl&auml;ttern durch die Programm-Informationen sollte intuitiv m&ouml;glich sein. Man kann entweder die Maus oder die Pfeiltasten der Tastatur verwenden:</p>

<p>Mit der Maus kann jeder Titel durch einen Klick ausgew&auml;hlt werden. Im unteren Fenster wird dabei die Beschreibung angezeigt. Mit dem linken Scrollbalken kann die Liste vorw&auml;rts zu in fernerer Zukunft laufenden Programmen bewegt werden. Mit der Wochenanzeige rechts kann man direkt zu einer bestimmten Zeit an einem bestimmten Datum springen.</p>

<p>Benutzen Sie bei Verwendung des Keyboards die &quot;Pfeil auf/ab&quot;-Tasten, um einen Titel auszuw&auml;hlen. F&uuml;r das schnelle Scrollen verwenden Sie die &quot;Bild auf/ab&quot;-Tasten. Mit der &quot;Pos 1&quot;-Taste gelangen Sie immer zur&uuml;ck zum ersten Titel. Mit TAB oder SHIFT+TAB k&ouml;nnen Sie den Fokus der Tastatureingabe auf andere Eingabeelemente bewegen, z.B. zu den Sender- und Shortcut-Listen; um ein gew&auml;hltes Thema oder einen Shortcut als Filter zu best&auml;tigen dr&uuml;cken Sie die Leertaste. Die ersten 10 Shortcuts k&ouml;nnen auch direkt vom Hauptfenster aus &uuml;ber die Zahlentasten 1-9 und 0 aktiviert werden. STRG+C im Hauptfenster &ouml;ffnet das Kontextmen&uuml;; STRG+F &ouml;ffnet den Dialog zur Textsuche; die ESCAPE-Taste ist gleichbedeutend dem Reset-Button (Dismiss/Abort). Die Men&uuml;s k&ouml;nnen Sie erreichen, indem Sie die ALT-Taste zusammen mit dem unterstrichenen Buchstaben des entsprechenden Men&uuml;eintrags dr&uuml;cken.</p>

<p>Sie k&ouml;nnen die Programmwahl auf verschiedenste Art einschr&auml;nken, um dadurch leichter zu finden was Sie interessiert. Beispielsweise k&ouml;nnen Sie die Liste auf Sendungen bestimmter Sender beschr&auml;nken; oder Sie beschr&auml;nken die Liste nur auf Filme. Dieser Prozess wird <i>filtering</i> genannt und weiter unten detailliert beschrieben, siehe <a href="#FILTERING">&quot;FILTERING&quot;</a>. F&uuml;r die gel&auml;ufigsten Filteroptionen gibt es eine Liste mit <i>Shortcuts</i> auf der linken Seite des Hauptfensters. Zu bemerken ist, dass diese Liste frei konfigurierbar ist, siehe <a href="#FILTER-SHORTCUTS">&quot;FILTER SHORTCUTS&quot;</a>.</p>

<p>Seit Version 2.5.0 bietet nxtvepg zwei Layouts f&uuml;r die TV-Programm&uuml;bersicht an: Standardm&auml;&szlig;ig sind die Programme aller Sender nach Startzeit sortiert in eine Liste kombiniert. Alternativ k&ouml;nnen Programme spaltenweise nach Sendern getrennt angezeigt werden, sodass jeder TV-Sender seine eigene Spalte erh&auml;lt. Dieses Format &auml;hnelt dem der meisten Programmzeitschriften. In diesem Layout kann sowohl vertikal nach Anfangszeit als auch horizontal nach Sendern gescrollt werden.</p>

<p>Wenn Sie die H&ouml;he des Programmfensters ver&auml;ndern, wird das Infotext-Fenster unten entsprechend angepasst. Sie k&ouml;nnen die Gr&ouml;&szlig;enverh&auml;ltnisse zwischen Programmliste und Infotext mit dem dazwischen liegenden Button mit den zwei kleinen auf/ab-Pfeilen anpassen, indem Sie diese mit gedr&uuml;ckt gehaltener Maustaste verschieben.</p>

<p>Nxtvepg kann mit TV-Anwendungen interagieren (z.B. <i>xawtv</i> auf UNIX; erfordert zuvor ein Setup, siehe <a href="#GETTING-STARTED">&quot;GETTING STARTED&quot;</a>), um eine Verbindung in beide Richtungen zu gew&auml;hrleisten: Erstens werden Sie einen &quot;<i>Tune TV</i>&quot;-Button im Hauptfenster unterhalb der Uhr vorfinden. Wenn Sie diesen anklicken, wird der Sender der aktuell gew&auml;hlten Sendung in der TV-Anwendung aufgerufen. Dies geht auch mit einem Doppelklick auf das Programm oder &uuml;ber das Dr&uuml;cken der ENTER-Taste. Durch einen Klick der rechten Maustaste auf den Button &quot;<i>Tune TV</i>&quot; links k&ouml;nnen Sie auch ein kleines Men&uuml; aufrufen, das eine grundlegende TV-Steuerung bietet. Zweitens wird der Cursor im nxtvepg-Hauptfenster automatisch auf die im aktuellen Sender laufende Sendung springen, wenn Sie den Kanal innerhalb der TV-Anwendung wechseln. Sie k&ouml;nnen diese Reaktion manuell durch das Dr&uuml;cken der Keyboard-Taste &quot;i&quot; ausl&ouml;sen. Siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;TV application interaction&quot; f&uuml;r mehr Details.</p>

<p>Am unteren Rand des Fensters gibt es eine Statuszeile, die &uuml;ber den Status der Datenbank und der Akquisition informiert. Im Prinzip ist es eine stark komprimierte Zusammenfassung des <b>Statistics</b>-Popups des <b>Control</b>-Men&uuml;s und besonders n&uuml;tzlich, um &uuml;ber das Alter der Datenbank zu informieren oder bei unterbrochener Akquisition zu warnen.</p>

<p><i>Beachten Sie:</i> Die meisten Provider &uuml;bertragen Inhaltsbeschreibungen (d.h. den Text im unteren nxtvepg-Fenster) nur f&uuml;r gegenw&auml;rtig laufende Sendungen und solche, deren Startzeit sehr nahe liegen. Diese Zeitspanne f&uuml;r den vollen Sendebereich kann maximal 2 Stunden oder 3 Titel pro Sender sein. Als Konsequenz hieraus sollten Sie die Datenakquisition so oft wie nur m&ouml;glich aktivieren; erw&auml;gen Sie, den Akquisitions-Daemon permanent im Hintergrund laufen zu lassen. Mehr Details zum Akquisitionsprozess siehe nachfolgendes Kapitel.</p>

<h1 id="TELETEXT-EPG-GRABBER">TELETEXT EPG GRABBER</h1>

<p>Der Teletext EPG Grabber erm&ouml;glicht es, TV-Programminformationen aus dem Teletext vieler europ&auml;ischer TV-Sender zu extrahieren und in eine gemeinsame &Uuml;bersicht zusammenzufassen. Der Grabber ben&ouml;tigt zum Empfang des Teletext eine TV-Karte und einen Antennenanschlu&szlig;. Aus dem vom einer einstellbaren TV-Kanalliste empfangenen Teletextseiten werden dann zuerst die Programm&uuml;bersichtstabellen extrahiert und danach die darauf referenzierten Seiten mit Beschreibungstexten. Die extrahierten Informationen werden sofort in die Anzeige &uuml;bernommen; des weiteren stehen die Informationen in Dateien in XMLTV Format f&uuml;r die Verwendung in anderen Applikationen zur Verf&uuml;gung.</p>

<p>Die Breite und Tiefe der extrahierten Informationen variiert stark zwischen den verschiedenen TV-Sendern. Falls &uuml;berhaupt Teletext ausgestrahlt wird, ist &uuml;berlicherweise mindestens der aktuelle und folgende Tag abgedeckt. Manche Sender decken aber sogar mehr als eine Woche ab. Meistens finden sich zus&auml;tzlich Inhaltsbeschreibungen zumindest f&uuml;r zeitnah folgenden Spielfilme und popul&auml;re Serien. Im Vergleich mit anderen Quellen f&uuml;r TV-Programminformationen, sind Beschreibungen zu Nachrichtenmagazinen und anderen tagesaktuellen Sendungen oft aktueller und ausf&uuml;hrlicher. Andererseits hat Teletext u.a. den Nachteil dass Sendungen nicht zuverl&auml;ssig in Kategorien wie z.B. Spielfilme, Serien usw. eingeteilt werden k&ouml;nnen.</p>

<p>In der aktuellen Version unterst&uuml;tzt der Teletext Grabber haupts&auml;chlich den Teletext &uuml;berregionaler deutscher Sender. Um Sender anderer L&auml;nder verarbeiten zu k&ouml;nnen, m&uuml;&szlig;ten die Algorithmen an die unterschiedlichen Formate und sprachliche Bezeichnungen angepasst werden. Der Hintergrund ist, dass es eine gro&szlig;e Bandbreite von Darstellungsm&ouml;glichkeiten von Tabellen, Datum und Uhrzeiten gibt.</p>

<p>Da der Teletext Grabber Teletext jedes TV-Senders nacheinander empfangen mu&szlig;, und die meisten Sender f&uuml;r die Programm&uuml;bersichten in gro&szlig;em Umfang Unterseiten verwenden, kann der Empfang aller Daten recht lange dauern: F&uuml;r die meisten Sender werden zwischen 1,5 bis 2 Minuten pro Sender ben&ouml;tigt. Beim Empfang via DVB kann reduziert sich die Dauer gl&uuml;cklicherweise jedoch stark, da alle Sender eines Transponders gleichzeitig empfangen werden k&ouml;nnen, wodurch sich je nach Kanalauswahl eine Beschleunigung von Faktor 5 bis 10 ergeben kann. Trotzdem empfiehlt sich, die Kanalliste des Teletext Grabbers auf die wirklich interessanten Sender zu begrenzen.</p>

<p>Programminformationen im Teletext werden &uuml;berlicherweise nicht mehr als einmal t&auml;glich aktualisiert (au&szlig;er bei Programm&auml;nderungen aus aktuellem Anlass). Daher ist es ausreichend den Teletext Grabber einmal t&auml;glich zu starten. Es empfiehlt sich andererseits ihn nicht seltener als jeden zweiten Tag zu starten, erstens da einige Sendern die &Uuml;bersicht auf zwei Tage beschr&auml;nken, und zweitens da bei selbst bei anderen Sendern Beschreibungstexte f&uuml;r Sendungen weiter in der Zukunft fehlen.</p>

<p>Es gibt eine Reihe von Konfigurationsoptionen mit denen der Teletext Grabber angepasst werden kann, wie z.B. der Seitenbereich und die Minimalempfangsdauer pro Sender. Aktuell kann diese Konfiguration allerdings nur global f&uuml;r alle Sender vorgenommen werden. F&uuml;r mehr Details dazu siehe den Abschnitt &quot;Teletext Grabber&quot; im Kapitel <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>.</p>

<h2 id="Using-Teletext-EPG">Using Teletext EPG</h2>

<p>Der Teletext Grabber speichert die gesammelten Programminformationen in Dateien im XMLTV Format, so da&szlig; diese prinzipiell wie jede andere Datei dieses Formats &uuml;ber die &quot;Load...&quot; bzw. &quot;Merge...&quot; Eintr&auml;ge im Kontrollmen&uuml; geladen werden k&ouml;nnen. Um die Dateien zu finden, klicken Sie in den entsprechenden Dialogfenstern auf das Verzeichnissymbol neben den <i>Select directory</i> Eingabefeldern (am oberen Rang der Dialogfenster). Dann erscheint ein Men&uuml; in dem sie mittels Eintrag &quot;Teletext Grabber XMLTV directory&quot; die Dateiliste im Dialogfenster anzeigen lassen k&ouml;nnen.</p>

<p>F&uuml;r den Merge ist die Option <i>Automatically include Teletext EPG</i> eine einfachere M&ouml;glichkeit als alle Dateien manuell auszuw&auml;hlen. Wenn die Option angew&auml;hlt ist, werden Dateien aller vom Teletext Grabber aktualisierten Sender automatisch mit zusammengef&uuml;hrt, ohne sie manuell in die Auswahlliste auf der rechten Seite zu &uuml;bernehmen. Auch sp&auml;ter neu angelegte Dateien werden automatisch zusammengef&uuml;hrt und deren Daten in die Anzeige &uuml;bernommen.</p>

<p>Die einfachste M&ouml;glichkeit ist jedoch der <i>Load Teletext EPG</i> Befehl im Control Men&uuml;: Damit werden mit einem Klick automatisch alle vom Teletext Grabber aktualisierten Progamm&uuml;bersichten zusammengef&uuml;hrt und angezeigt. (Genauer gesagt, zusammengef&uuml;hrt werden Programminformationen der im Teletext Grabber Konfigurationsmen&uuml; ausgew&auml;hlten Zahl von Sendern aus der Kanaltabelle.) Dieser Modus ist voreingestellt solange keine andere XMLTV Datei geladen wurde.</p>

<p>Zu mehr Details zu den genannten Befehlen und Optionen siehe Kapitel <a href="#CONTROL-MENU">&quot;CONTROL MENU&quot;</a>.</p>

<p>Unabh&auml;ngig von der Art auf der die Daten geladen wurden wird die Anzeige immer aktualisiert sobald der Teletext Grabber im Hintergrund neue Programminformationen geladen hat. Bei der Aktualisierung bleibt die Cursorposition unver&auml;ndert, es sei denn er befindet sich auf dem allerersten Eintrag.</p>

<h2 id="Acquisition-modes">Acquisition modes</h2>

<p>Die Vorgehensweise des Teletext Grabbers ist reihum Teletext von allen konfigurierten TV-Sendern f&uuml;r eine bestimmte Zeit zu empfangen und speichern. Wenn alle ben&ouml;tigten Teletext-Seiten empfangen wurden, wird daraus die TV-Programm&uuml;bersicht extrahiert und in Dateien im XMLTV Format gespeichert. Wie zuvor beschrieben, kann dies bei DVB parallel f&uuml;r alle TV-Sender eines Transponders erfolgen. Sie k&ouml;nnen den Fortschritt &uuml;ber die im Control-Men&uuml; aufrufbaren Statistikfenster beobachten. (Siehe <a href="#STATISTICS">&quot;STATISTICS&quot;</a> f&uuml;r Details.)</p>

<p>Der Dialog zur Konfiguration des Teletext-Grabbers erm&ouml;glicht es Ihnen die Strategie f&uuml;r Akquisition von EPG Daten zu beeinflussen: Die ersten beiden Modi sind nur f&uuml;r den Spezialfall dass sie nicht den Tuner der TV-Karte verwenden, so dass nxtvepg keine TV-Sender umschalten kann. Die anderen Modi bestimmen die zeitliche Abfolge in der Daten gesucht werden.</p>

<dl>

<dt id="Cyclic:-Full"><b>Cyclic: Full</b></dt>
<dd>

<p>Dieser Modus ist voreingestellt. Der Modus arbeitet wie bei <a href="#TELETEXT-EPG-GRABBER">&quot;TELETEXT EPG GRABBER&quot;</a> schon beschrieben. Das hei&szlig;t, EPG wird der Reihe nach von den TV-Sendern in der geladenen Sendertabelle empfangen und verarbeitet. F&uuml;r jeden Sender wird solange empfangen wie n&ouml;tig alle vom EPG verwendeten Seiten und Unterseiten zu laden. Die EPG Akquisition ist beendet nach einem Durchlauf &uuml;ber alle Sender.</p>

<p>Technische Details: Da mit &Uuml;bertragungsfehlern gerechnet werden muss, wird tats&auml;chlich nicht versucht, jede einzelne Unterseite der von EPG verwendeten Teletext Seiten zu laden bevor der EPG Grabber zum n&auml;chsten Sender schaltet. Stattdessen empf&auml;ngt der Grabber so viele Seitenzyklen wie maximal an Unterseiten im EPG Bereich verwendet werden. (Die meisten Teletextanbieter verwenden keine Unterseiten f&uuml;r die heutige Programmtabelle; oft wird jedoch f&uuml;r Folgetage nur eine Seite f&uuml;r den ganzen Tag verwendet und die Tabellen dann auf so viele Unterseiten verteilt wie n&ouml;tig um die gesamte Liste darzustellen. In jedem Seitenzyklus wird nur eine Unterseite pro Teletextseite &uuml;bertragen; die Dauer eines Zyklus h&auml;ngt von der Gesamt zahl der Seiten im Teletext ab; ein typischer Wert ist 20 Sekunden.)</p>

</dd>
<dt id="Cyclic:-Now---Full"><b>Cyclic: Now - Full</b></dt>
<dd>

<p>In diesem Modus werden die EPG Daten in zwei Durchl&auml;ufen geladen: Im ersten Durchlauf wird Teletext nur kurz von jedem Sender geladen, n&auml;mlich nur solange wie n&ouml;tig um den EPG Seitenbereich einmal zu empfangen (d.h. nur eine Unterseite wird geladen, siehe vorheriger Abschnitt). Dies ist ausreichend f&uuml;r das Programm des heutigen Tages, da f&uuml;r dieses &uuml;blicherweise keine Unterseiten verwendet werden. Nach dem ersten Durchlauf wird ein weiterer gestartet, der dann genau wie bei <i>Cyclic: Full</i> beschrieben arbeitet.</p>

<p>Technische Details: Der erste Durchlauf ist weiterhin optimiert um die Laufzeit zu minimieren indem nach jedem Senderwechsel kontrolliert wird welche Seite im Zyklus gerade &uuml;bertragen wird. Ist der Abstand zum Beginn der EPG Seiten gro&szlig;, wird zwischenzeitlich ein anderer Sender probiert um unn&ouml;tige Wartezeit zu vermeiden.</p>

</dd>
<dt id="Passive"><b>Passive</b></dt>
<dd>

<p>In diesem Modus greift die Software nie auf das Video-Ger&auml;t zu und &auml;ndert auch nie Input-Kanal oder Tuner-Frequenz. Dies ist n&uuml;tzlich, wenn Sie das Setup der Quelle &uuml;ber Befehlszeilen-Tools wie <i>v4lctl</i> durchf&uuml;hren wollen. Verwenden Sie Applikationen die Videodaten verarbeitet (z.B. eine TV-Anwendung), brauchen Sie diesen Modus nicht, weil nxtvepg automatisch in den passiven Modus umschaltet, wenn ein Kanalwechsel aus diesem Grund fehlschl&auml;gt.</p>

<p>Bitte beachten Sie: wenn nxtvepg den TV-Kanal nicht kontrolliert, kann es sich nicht automatisch um die Aktualisierung Ihrer Datenbank k&uuml;mmern. Sogar wenn die Browserdatenbank komplett leer sein sollte, werden keine Daten erscheinen bis Sie den Kanal des Providers manuell &uuml;ber eine externe Applikation angesteuert haben. Aus diesem Grund ist von der Verwendung des passiven Modus abzuraten.</p>

</dd>
</dl>

<p>Welcher Modus der Beste f&uuml;r Sie ist, h&auml;ngt davon ab wie Sie Ihren Browser nutzen. Falls Sie hautps&auml;chlich am aktuellen Programm interessiert sind, ist &quot;Now - Full&quot; ideal. Falls Sie die gesamt &Uuml;bersicht ben&ouml;tigen, ist es schneller &quot;Full&quot; zu verwenden, da der &quot;Now - Full&quot; Modus l&auml;nger braucht um alle Daten komplett zu laden. (Genauer gesagt, der &quot;Full&quot; Durchlauf dauert in beiden Modi genauso lange, so dass die Zeit f&uuml;r den &quot;Now&quot; Durchlauf zur Gesamtlaufzeit hinzukommt.)</p>

<h1 id="STATISTICS">STATISTICS</h1>

<p>Es gibt eine Reihe von M&ouml;glichkeiten, Informationen zum Status der Datenbank und des Akquisitions-Prozesses zu erhalten: Der Erste und pr&auml;gnanteste ist die Statuszeile am unteren Rand des Hauptfensters (nur wenn diese auch aktiviert ist, siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>). Der Zweite besteht aus dem Zeitskalen-Fenster (&quot;timescale&quot;), welche die mit TV-Programmdaten belegten Zeitspannen jedes TV-Senders visualisiert. Der Dritte besteht aus der Datenbankstatistik, welche technische Details &uuml;ber die im Browser geladene Datenbank liefern (wie z.B. welcher Prozentsatz an Eintr&auml;gen bereits aktualisiert ist usw.). Weiterhin gibt es ein Fenster das Status des Teletext EPG Grabbers widerspiegelt.</p>

<h2 id="Status-line">Status line</h2>

<p>Die Statuszeile fasst separat den Status der Browserdatenbank und den des Akquisitionsprozesses zusammen. Aus Platzgr&uuml;nden enth&auml;lt sie nur die relevanteste Information, d.h. die angezeigte Information h&auml;ngt vom jeweiligen Status ab.</p>

<p>Zur Browserdatenbank sehen Sie normalerweise nur den Namen der XMLTV Datei. Ist die Datei mehr als einen Tag alt, wird zus&auml;tzlich das Alter und der Anteil der seit der letzten Aktualisierung abgelaufenen Programme angezeigt. (In welchem Intervall die Daten aktualisiert werden sollten ist nxtvepg nicht bekannt, da dies von der Vorschaul&auml;nge und Dynamik Ihres Anbieters abh&auml;ngt. F&uuml;r den Teletext EPG Grabber ist eine t&auml;gliche Aktualisierung empfohlen; siehe auch <a href="#TELETEXT-EPG-GRABBER">&quot;TELETEXT EPG GRABBER&quot;</a>).</p>

<p>Falls der Teletext EPG Grabber eingeschaltet ist, wird zus&auml;tzlich der Status der Akquisition dargestellt. Dies umfasst die Information ob die Akquisition aktuell aktiv ist und falls ja, der Anteil der bereits geladenen TV-Programme und der Name des Sender von dem aktuell empfangen wird. Zus&auml;tzlich erscheint eine Angabe zur Akquisitionsphase, wie z.B. &quot;Now&quot; falls der initiale Schnelldurchgang l&auml;uft (falls diese Option in der Konfiguration eingeschaltet ist), &quot;Full&quot; w&auml;hrend des Ladens der kompletten Daten, oder &quot;Complete&quot; nachdem die Daten aller Programme geladen sind.</p>

<p>Falls die Akquisition blockiert ist oder ein Fehler aufgetreten ist, wird dies hier angezeigt. Insbesondere erscheint der Hinweis &quot;forced passive&quot; wenn nxtvepg nicht in der Lage ist TV-Programme umzuschalten um dort Teletext zu laden. (In der Regel ist die Ursache daf&uuml;r dass eine andere Applikation die TV-Karte belegt.)</p>

<h2 id="Timescale-popup-window">Timescale popup window</h2>

<p>Das Zeitskalenfenster spiegelt f&uuml;r jeden TV-Sender wieder, welche Zeitspannen mit TV-Programminformationen in der Datenbank belegt sind.</p>

<p>Das Fenster besitzt eine Skala f&uuml;r jeden TV-Sender, der von der geladenen XMLTV Datei abgedeckt wird. Das linke Ende der Skalen verweist auf die Startzeit der &auml;ltesten in der Datenbank vorhandenen TV-Sendung. Abh&auml;ngig davon wie lange das letzte Update der Datenbank zur&uuml;ckliegt und wie lange der EPG Anbieter abgelaufene Programme in der Datenbank h&auml;lt, k&ouml;nnen die Sendungen teilweise oder sogar ganz in der Vergangenheit liegen. Die exakten Datierungen werden in der Datumsskala am oberen Rand des Fensters ausgegeben, wobei die aktuelle Zeit zus&auml;tzlich durch einen mit &quot;now&quot; gekennzeichneten kleinen Pfeil markiert ist.</p>

<p>Bereiche die von Sendungen des jeweiligen Senders in der Datenbank belegt werden, sind durch gelbe, rote, pink, oder blaue Farbe markiert. Bereiche ohne Programminformationen sind grau. Die Bereiche vor dem ersten und jenseits des letzten bekannten Programms sind schwarz. Die Bedeutung der unterschiedlichen Farben im einzelnen ist wie folgt:</p>

<dl>

<dt id="Hellrot"><i>Hellrot:</i></dt>
<dd>

<p>Programminformationen des aktuellen Tages. Der Start einen Tages ist hier auf 6 Uhr morgens festgelegt.</p>

</dd>
<dt id="Helles-pink"><i>Helles pink:</i></dt>
<dd>

<p>Programminformationen des folgenden Tages.</p>

</dd>
<dt id="Hellblau"><i>Hellblau:</i></dt>
<dd>

<p>Programminformationen des &uuml;bern&auml;chsten und folgender Tage.</p>

</dd>
<dt id="Dunkelrot-dunkles-pink-oder-Dunkelblau"><i>Dunkelrot, dunkles pink oder Dunkelblau:</i></dt>
<dd>

<p>Wie oben, jedoch liegt die Aktualisierung der Programminformationen mehr als einen Tage zur&uuml;ck.</p>

</dd>
<dt id="Gelb"><i>Gelb:</i></dt>
<dd>

<p>Ung&uuml;ltige PI-Bl&ouml;cke (&Uuml;berschneidung oder 0 Minuten Laufzeit)</p>

</dd>
<dt id="Grau"><i>Grau:</i></dt>
<dd>

<p>L&uuml;cken in den Programminformationen. Grund daf&uuml;r k&ouml;nnen Sendepausen sein (d.h. bei TV-Sendern die nicht 24 Stunden am Tag senden), oder &Uuml;bertragungsfehler in der EPG Akquisition</p>

</dd>
<dt id="Schwarz"><i>Schwarz:</i></dt>
<dd>

<p>Zeitspanne die vom Inhalteanbieter nicht abgedeckt wird.</p>

</dd>
</dl>

<p>Sendungen f&uuml;r die momentan Beschreibungstexte verf&uuml;gbar sind werden zus&auml;tzlich durch eine gr&ouml;&szlig;ere H&ouml;he der Skala innerhalb der belegten Zeitspanne markiert.</p>

<h2 id="Database-statistics">Database statistics</h2>

<p>&Uuml;ber das Control-Men&uuml; kann ein Fenster ge&ouml;ffnet werden welches statistische Informationen &uuml;ber den Inhalt der Browserdatenbank darstellt.</p>

<dl>

<dt id="Last-update"><i>Last update:</i></dt>
<dd>

<p>Die Uhrzeit zu welcher die Datenbank zuletzt aktualisiert wurde (basierend auf dem Modifikationszeitstempel der zugeh&ouml;rigen XMLTV Datei). F&uuml;r zusammengef&uuml;hrte Datenbanken ist dies der letzte Zeitpunkt zu dem eine der enthaltenen XMLTV Dateien aktualisiert wurde.</p>

</dd>
<dt id="Block-count-db"><i>Block count db:</i></dt>
<dd>

<p>Wie viele Bl&ouml;cke sind in der lokalen Datenbank. Maximal kann dies der Anzahl der Bl&ouml;cke laut AI-Block entsprechen.</p>

</dd>
<dt id="Current-version"><i>Current version:</i></dt>
<dd>

<p>Wie viele Bl&ouml;cke sind in der lokalen Datenbank vorhanden und haben die neueste Version.</p>

</dd>
<dt id="Expired"><i>Expired:</i></dt>
<dd>

<p>Gesamtzahl und Prozentsatz abgelaufener Bl&ouml;cke in der Datenbank. Es ist v&ouml;llig normal dass dieser Wert im Laufe der Zeit ansteigt, bis zur n&auml;chsten Aktualisierung der Datenbank.</p>

<p>Wie bei der Aktualisierung mit abgelaufenen Programminformationen umgegangen wird, h&auml;ngt vom gew&auml;hlten EPG Anbieter ab: Anbieter k&ouml;nnen abgelaufene Programme sofort l&ouml;schen, oder f&uuml;r eine gewisse Zeit erhalten (z.B. um zu Erlauben Informationen wie Programmbeschreibung und Darsteller auch nach Ablauf der Sendung nochmal nachzulesen, wie &uuml;ber den <i>Expired display</i> Filter m&ouml;glich.) Beim Teletext EPG Grabber k&ouml;nnen Sie dies selbst bestimmen, siehe Kapitel <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, &quot;Teletext Grabber&quot;.</p>

</dd>
<dt id="Defective-blocks"><i>Defective blocks:</i></dt>
<dd>

<p>Anzahl der Bl&ouml;cke mit ung&uuml;ltiger oder &uuml;berlappender Startzeit. Diese Bl&ouml;cke tauchen nicht im Browser auf (da es schwer w&auml;re damit umzugehen, dass mehr als ein &quot;now&quot;-Eintrag eines Senders existiert).</p>

</dd>
</dl>

<p>Das Tortendiagramm zur Linken des Fensters visualisiert diese Zahlen. Der Kreis repr&auml;sentiert 100% der Bl&ouml;cke in der Datenbank. Er ist aufgeteilt in Bl&ouml;cke zum Programm des heutigen Tags (rot), des morgigen Tags (pink) und folgende Tage (blau). Die schraffierten Segmente stellen die Bl&ouml;cke dar, die mehr als einen Tag akquiriert wurden, die gelben Segmente den Prozentsatz an abgelaufenen und/oder fehlerhaften Bl&ouml;cken.</p>

<p>Falls die Datenbank vom Teletext EPG Grabber aktualisiert wird, wird ein zus&auml;tzlicher Bereich unterhalb der Statistiken eingeblendet, in dem ein Histogramm und Statusinformationen zur Akquisition dargestellt sind. Das Histogram zeigt dieselbe Information wie das Tortendiagramm, jedoch in Form eines Balkendiagramms &uuml;ber einer Zeitachse. Die Statusinformationen zur Rechten des Balkendiagramms haben dieselbe Bedeutung wie im n&auml;chsten Kapitel f&uuml;r die Teletext Grabber statistics beschrieben.</p>

<h2 id="Teletext-Grabber-Statistics">Teletext Grabber Statistics</h2>

<p>&Uuml;ber das Control-Men&uuml; kann ein Fenster ge&ouml;ffnet werden welches Informationen &uuml;ber den Status des Teletext EPG Grabber gibt. Das Fenster pr&auml;sentiert die Informationen in zwei getrennten Bereichen: Der obere Bereich zeigt die Konfiguration und &uuml;bergreifenden aktuellen Status. Der untere Bereich zeigt eine Reihe von Statistiken &uuml;ber Teletextempfang aus den aktuell eingestellten TV-Sendern.</p>

<p>Beschreibung der Informationen im oberen Bereich des Fensters:</p>

<dl>

<dt id="Acq-mode"><i>Acq mode:</i></dt>
<dd>

<p>Der derzeitige Akquisitionsmodus wie vom Benutzer konfiguriert, und dessen aktuelle Phase: &quot;Now&quot;, &quot;Full&quot;, oder &quot;Complete&quot;.</p>

</dd>
<dt id="Acq-passive"><i>Acq passive:</i></dt>
<dd>

<p>Falls Wechsel des TV-Senders zum Zweck des Teletextempfangs nicht m&ouml;glich ist, wird hier der Grund daf&uuml;r angegeben.</p>

</dd>
<dt id="Channels-done"><i>Channels done:</i></dt>
<dd>

<p>Gibt die Anzahl der f&uuml;r Teletext EPG Akquisition konfigurierten TV-Sender an, und die Zahl der davon bereits erledigten Sender.</p>

</dd>
<dt id="Current-channels"><i>Current channels:</i></dt>
<dd>

<p>Gibt die Anzahl der Sender an von denen aktuell Teletext empfangen wird. Bei analogen TV-Karten ist dies h&ouml;chstens ein Sender. Bei DVB ist jedoch paralleler Empfang mehrerer TV-Sender m&ouml;glich (d.h. aller Sender die einen Transponder teilen).</p>

</dd>
<dt id="Acq.-runtime"><i>Acq. runtime:</i></dt>
<dd>

<p>Der erste Wert gibt an, wie lange der Teletext vom aktuell eingestellten TV-Sender empfangen wurde (in Sekunden, Format MM::SS). Der Wert in Klammern dahinter gibt die f&uuml;r den aktuellen Sender konfigurierte &quot;Capture duration&quot; an (siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, &quot;Teletext Grabber&quot;).</p>

</dd>
<dt id="Acq.-state"><i>Acq. state:</i></dt>
<dd>

<p>Der Status des Empfangs auf dem aktuellen Sender: &quot;Capturing&quot; w&auml;hrend des Ladens von Teletextseiten; &quot;Starting up&quot; in der Zeit zwischen Senderwechsel und dem ersten Empfang einer Teletextseite im eingestellten Bereich; &quot;Scanning&quot; in der Phase &quot;Now&quot; bei der Suche nach einem Sender wo zeitnah die erste Seite des eingestellten Bereichs empfangen werden kann.</p>

</dd>
</dl>

<p>Der untere Bereich des Fensters besteht aus einer Tabelle: Die erste Zeile gibt die Namen der TV-Sender an von denen aktuell Teletext empfangen wird. Die folgenden Zeilen zeigen die folgenden statistische Informationen f&uuml;r jeden der Sender in der entsprechenden Spalte:</p>

<dl>

<dt id="Channel-VPS-PDC"><i>Channel VPS/PDC:</i></dt>
<dd>

<p>Der Senderidentifikationscode (CNI) welche zuletzt auf dem jeweiligen TV-Sender empfangen wurde. Quelle daf&uuml;r kann PDC (Packet 8/30/2), NI (Packet 8/30/1), oder VPS sein. Die ausgegebene CNI ist das PDC &Auml;quivalent, falls vorhanden, sonst NI.</p>

<p>Wurde ein Programme Identification Label (PIL) empfangen, wird er nach der CNI in dekodiertem Format (z.B. DD.MM HH:MM mit Tag, Monat, Stunde und Minute) angeh&auml;ngt. Das PIL identifiziert die aktuell ausgestrahlte Sendung mittels deren originaler Startzeit. Das VPS Label wurde in Videorekordern verwendet um den Start und Dauer der Aufzeichnung mit der Sendung zu Synchonisieren, unabh&auml;ngig von Programm&auml;nderungen.</p>

</dd>
<dt id="Capture-range"><i>Capture range:</i></dt>
<dd>

<p>Dies gibt die Nummern der f&uuml;r die jeweiligen Sender konfigurierten ersten und letzten Teletextseite die geladen werden an. Die Angabe ist direkt aus der Konfiguration des Teletext-Grabbers &uuml;bernommen.</p>

</dd>
<dt id="Captured-pages"><i>Captured pages:</i></dt>
<dd>

<p>Anzahl der empfangenen Teletext Seiten (inklusive Wiederholungen und Unterseiten, d.h. vereinfacht gesagt die Anzahl der empfangen Kopfzeilen.)</p>

</dd>
<dt id="Captured-packages"><i>Captured packages:</i></dt>
<dd>

<p>Anzahl der verarbeiteten Teletext &quot;Packets&quot; (d.h. Textzeilen) aus der aktuellen &quot;Capture range&quot;. Eine Teletextseite besteht meist aus 23-25 Zeilen. Die zweite Angabe in dieser Tabellenzeile gibt an wie viel Prozent der insgesamt empfangen &quot;packets&quot; verarbeitet wurden.</p>

</dd>
<dt id="Decoding-errors"><i>Decoding errors:</i></dt>
<dd>

<p>Gibt die Anzahl Dekodierfehler bei der Verarbeitung von Teletext an. (Kontrollinformation ist Hamming-8/4 gesch&uuml;tzt, Textdaten nur mit Parity Bits.) Der Prozentsatz ist berechnet aus der Gesamtzahl verarbeiteter Packets mit je 45 Bytes.</p>

</dd>
<dt id="TTX-data-rate"><i>TTX data rate:</i></dt>
<dd>

<p>Die Rate in Baud, d.h. Bits pro Sekunde, mit welcher Teletext-Datenzeilen im aktuellen Kanal empfangen werden. Jede Teletextzeile hat 45 Bytes.</p>

</dd>
</dl>

<h1 id="MERGED-DATABASES">MERGED DATABASES</h1>

<p>Unter &quot;Merge&quot; versteht man das Zusammenf&uuml;hren von EPG Daten aus verschiedenen XMLTV Dateien. Der prim&auml;re Einsatz des Mechanismus ist f&uuml;r den Fall, dass Sie mehrere EPG Anbieter verwenden die unterschiedliche Teilmengen der empfangbaren Sender abdecken. Durch den Merge, k&ouml;nnen Sie eine Datenbank erzeugen die die Sender aller EPG Anbieter enth&auml;lt.</p>

<p>Ein weiterer Einsatz ist der Fall das Sie mehrere EPG Anbieter verwenden die dieselben Sender abdecken. In dem Fall erlaubt der Merge die Daten f&uuml;r jedes TV-Programm in der Anzeige zu vereinigen. F&uuml;r Informationen wie Beschreibungstexte werden die Daten aller EPG Anbieter aneinenderge&uuml;gt. F&uuml;r Informationstypen wo das Aneinanderf&uuml;gen nicht sinnvoll ist, wird die Information aus den Daten des ersten Anbieters angezeigt (d.h. die Reihenfolge der Auswahl ist relevant; Details siehe unten).</p>

<p>&Uuml;ber den Men&uuml;eintrag <b>Merge XMLTV files</b> im <b>Control</b>-Men&uuml; erhalten Sie einen Dialog mit zwei Listenfeldern: das Linke davon enth&auml;lt eine Liste von XMLTV Dateien. Ein anderes Verzeichnis kann mit Klick auf den Knopf neben dem Eingabefeld gew&auml;hlt werden. Der Verzeichnisname kann auch manuell editiert werden; Nach Dr&uuml;cken der Return-Taste wird die Liste der Dateien aktualisiert. Normalerweise werden nur Dateien mit Endung &quot;<code>.xml</code>&quot; angezeigt; Diese Beschr&auml;nkung kann jedoch durch Auswahl von &quot;<code>all (*.*)</code>&quot; im Men&uuml; unterhalb des Pfadeingabefelds aufgehoben werden.</p>

<p>Das rechte Liste stellt die Dateien dar, die Sie zusammenf&uuml;hren wollen. Bei der ersten Verwendung des Dialogs wird die Liste leer sein; Bei folgenden Aufrufen wird die zuletzt verwendete Auswahl wieder angezeigt, falls dieselben Dateien noch existieren. Sie k&ouml;nnen Eintr&auml;ge in der rechten Liste hinzuf&uuml;gen, durch Auswahl eines Eintrags in der linken Liste und Dr&uuml;cken des &quot;Add&quot; Knopfes. Eintr&auml;ge k&ouml;nnen aus der rechten Liste gel&ouml;scht werden durch Auswahl eines oder mehrerer Eintr&auml;ge und Dr&uuml;cken des &quot;Delete&quot; Knopfes. Die Reihenfolge kann durch Auswahl von einem oder mehreren Eintr&auml;gen und Dr&uuml;cken der beiden Pfeil-Kn&ouml;pfe ge&auml;ndert werden. Sind Sie fertig mit Ihrer Auswahl, dr&uuml;cken Sie <b>OK</b>, um das Zusammenf&uuml;hren der ausgew&auml;hlten Dateien zu starten und die so neu erzeugte EPG Datenbank anzuzeigen.</p>

<p>Durch die Reihenfolge der Provider in Ihrer Auswahl weisen Sie ihnen Priorit&auml;ten zu, die f&uuml;r eine Konfliktl&ouml;sung von Bedeutung. Ein Konflikt tritt dann auf, wenn Start- und Stopzeiten der Sendung bei den Providern verschieden sind. Die Wahrscheinlichkeit solch eines Konfliktes h&auml;ngt von der Qualit&auml;t Ihrer Provider ab; theoretisch sollten sie nie auftreten, au&szlig;er wenn kurzfristige Programm&auml;nderungen erfolgen. In der Realit&auml;t sind solche Konflikte gar nicht so unwahrscheinlich (erfahrungsgem&auml;&szlig; speziell bei Sendungen, die fr&uuml;h am Morgen ausgestrahlt werden.) Sie sollten den verl&auml;sslichsten Provider an die erste Stelle setzen, da widerspr&uuml;chliche Sendungen von darunter stehenden Providern abgelehnt werden, d.h. nicht mit in die zusammengef&uuml;hrte Datenbank aufgenommen werden.</p>

<p>Durch Anw&auml;hlen der Option <b>Automatically include Teletext EPG</b> werden alle durch den Teletext EPG Grabber erzeugten XMLTV Dateien mit eingebunden. Auch erst sp&auml;ter neu angelegte Dateien werden dynamisch hinzugef&uuml;gt. Bei Verwendung der Option ist die Reihenfolge der Dateien beim Zusammenf&uuml;hren nicht festgelegt; Dies ist jedoch in dem Fall nicht entscheidend, da zwischen den Dateien des Grabbers keine Konflikte bestehen da jede Datei ein separates Netzwerk abdeckt. Falls Sie dennoch das Zusammenf&uuml;hren genauer konfigurieren wollen, k&ouml;nnen Sie die Dateien des Teletext Grabbers auch manuell angeben. Das geht am schnellsten indem Sie im &uuml;ber den kleinen Pfeil neben dem Pfadeingabefeld erreichbaren Men&uuml; den Eintrag <i>Teletext Grabber XMLTV directory</i> anklicken. Danach k&ouml;nnen Sie alle Eintr&auml;ge in der Linken liste selektieren und mit dem &quot;add&quot; Knopf in die Liste der zusammenzuf&uuml;hrenden Dateien &uuml;bernehmen.</p>

<p>Der Button <b>Configure</b> im Dialog erm&ouml;glicht Ihnen die Feinkontrolle &uuml;ber die Priorit&auml;t der Provider w&auml;hrend des Zusammenf&uuml;hrens aller sich unterscheidenden Attribute der Sendungen. Sie k&ouml;nnen einen Provider sogar f&uuml;r ein Attribut komplett entfernen, z.B. falls dieser falsche Daten &uuml;bermittelt. Eine Ausnahme stellt hierbei der Titel dar, den Sie von keinem Provider l&ouml;schen k&ouml;nnen.</p>

<p>Attribute, die nicht zusammengef&uuml;hrt werden k&ouml;nnen, z.B. das Editorial Rating, werden aus der ersten Datenbank in die Liste aufgenommen, die das Attribut f&uuml;r eine vorgegebene Sendung enth&auml;lt (siehe auch <a href="#FILTERING">&quot;FILTERING&quot;</a>).</p>

<h1 id="FILTERING">FILTERING</h1>

<p>Dieses Men&uuml; erm&ouml;glicht Kontrolle dar&uuml;ber, welche der TV-Sendungen der Datenbank in der Liste angezeigt werden. F&uuml;r jede Art von TV-Sendungen zugeordneten Attributen gibt es einen Filter. Attribute sind zum Beispiel Sendername, Startzeit, Themenbeschreibung und Beschreibungstext.</p>

<p>Filter k&ouml;nnen entweder einmalig durch erneutes Ausw&auml;hlen desselben Eintrages im Filtermen&uuml; zur&uuml;ckgesetzt werden, oder global durch einen Klick auf <i>Reset</i>-Button oder -Men&uuml;eintrag.</p>

<p>Sie k&ouml;nnen beliebig viele Filter miteinander kombinieren um einen komplexen Filter zusammenzustellen. Wenn Sie zwei Filter unterschiedlichen Typs kombinieren, werden nur solche Sendungen aufgelistet, auf die beide Attribute zutreffen (logisches UND). W&auml;hlen Sie zwei Filter vom gleichen Typ, werden alle Sendungen mit einem von beiden Attributen aufgelistet (logisches ODER). Beachten Sie, dass einige Filtertypen auch mehrere &quot;Klassen&quot; unterst&uuml;tzen, was ein logisches UND innerhalb einer Kategorie erm&ouml;glicht; dies wird ausf&uuml;hrlicher in der unten stehenden Liste der Filtertypen erkl&auml;rt.</p>

<p><i>Beispiele:</i> Wollen Sie etwa alle Sendungen aufgelistet bekommen f&uuml;r entweder Sender A <b>ODER</b> Sender B, w&auml;hlen Sie einfach beide Sender in der Filterliste. Wollen Sie alle auf A geplanten Filme, d.h. alle Sendungen, die auf Sender A laufen <b>UND</b> mit Themenkategorie Spielfilm gekennzeichnet sind, w&auml;hlen Sie Sender A und als Themenkategorie &quot;Spielfilm&quot;.</p>

<h2 id="Filter-Types">Filter Types</h2>

<p>Die folgenden Filtertypen sind verf&uuml;gbar:</p>

<dl>

<dt id="Theme-categories"><b>Theme categories</b></dt>
<dd>

<p>Begrenzt die Auflistung auf Sendungen denen die ausgew&auml;hlte Themenkategorie zugeordnet ist. Wird mehr als eine Kategorie ausgew&auml;hlt, zeigt die Auflistung Sendungen den eine beliebige der ausgew&auml;hlten Kategorien zugeordnet ist (logisches ODER).</p>

<p>Die Liste von verf&uuml;gbaren Themenkategorien ist die Summe aller Kategorien die in der Datenbank verwendet werden. Daher unterscheidet sich die Liste je nach der verwendeten Datenbank. Dies bedeutet jedoch leider dass Shortcuts die Themen-Filter beinhalten nicht generell zwischn Providern &uuml;bertragbar sind. (Dies ist auch der Grund, dass solche Shortcuts nicht in der Grundeinstellung von nxtvepg enthalten sind.)</p>

<p>F&uuml;r Provider die ein hierarchisches System von Themenkategorien verwenden, ist es &uuml;blich dass einer Sendung mehrere Kategorien zugeordnet sind. Zum Beispiel, es k&ouml;nnte Hauptkategorien &quot;Film&quot; und &quot;Serie&quot; geben und Unterkategorien &quot;Kom&ouml;die&quot; usw. Wenn nun als Kategorien &quot;Film&quot; und &quot;Kom&ouml;die&quot; ausgew&auml;hlt wird, w&uuml;rden auch kom&ouml;diantische Serien in der Liste angezeigt. Um nur Filme die Kom&ouml;dien sind anzuzeigen, wird ein logisches &quot;UND&quot; zwischen Kategorien ben&ouml;tigt. Dies kann erreicht werden, indem man die Kategorien verschiedenen &quot;Klassen&quot; zuordnet. Zum Beispiel: Man w&auml;hlt zuerst in Klasse 1 Kategorie &quot;Film&quot;, wechselt dann zu Klasse 2 und w&auml;hlt &quot;Kom&ouml;die&quot;. Welche Nummern verwendet werden ist dabei egal, es kommt nur darauf an unterschiedliche Klassen zu verwenden um ein &quot;UND&quot; zwischen den Kategorien zu erzwingen.</p>

</dd>
<dt id="Networks"><b>Networks</b></dt>
<dd>

<p>Beschr&auml;nkt die Liste der Programme auf einen oder mehrere Sender. Der Filter ist abgeschaltet, wenn alle Kontrollk&auml;stchen deaktiviert sind.</p>

<p><b>Tipp:</b> Die Senderauswahlliste kann permanent im Hauptfenster eingeblendet werden, indem eine der Checkboxen &quot;<i>Show networks</i>&quot; im Untermen&uuml; <i>Show/Hide</i> des Konfigurationsmen&uuml;s (siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;Show/Hide&quot;) aktiviert wird. Au&szlig;erdem sind sowohl die Senderreihenfolge als auch die Sendernamen konfigurierbar. Insbesondere k&ouml;nnen Sie auch uninteressante Sender permanent aus der Liste entfernen.</p>

</dd>
<dt id="Text-search"><b>Text search</b></dt>
<dd>

<p>Begrenzt die Auflistung auf Sendungen, deren Titel oder Beschreibung einen (oder eins von beiden, falls beide Optionen aktiviert sind) der eingegeben Textteile enthalten. Wenn Sie die Option &quot;<i>match complete text</i>&quot; aktivieren, wird eine exakte &Uuml;bereinstimmung ben&ouml;tigt, d.h. eine Suche nach &quot;heute&quot; wird nicht auf &quot;heute journal&quot; zutreffen. (Dies ist vorgesehen f&uuml;r Nur-Titel-Suchanfragen, wie sie vom Kontextmen&uuml; aus gestartet werden). Wenn Sie die Option &quot;<i>match case</i>&quot; aktivieren, wird die Gro&szlig;-/Kleinschreibung relevant, d.h. eine Suche nach &quot;heute&quot; wird keine Treffer f&uuml;r &quot;Heute Abend&quot; ergeben.</p>

<p>Sie k&ouml;nnen nach mehr als einem Text gleichzeitig suchen; Sie werden alle Sendungen erhalten, die irgendeinen der vorgegebenen Texte enthalten (logisches ODER). Das Listenfeld oberhalb des Texteingabefeldes reiht alle zurzeit aktiven Texte auf. Sie k&ouml;nnen auf die Optionen in der Liste doppelklicken, um sie zwischen &quot;yes&quot; und &quot;no&quot; umzuschalten (d.h. Option aktiviert oder deaktiviert). Die Eintr&auml;ge besitzen auch kleine Kontextmen&uuml;s, die es erm&ouml;glichen, einzelne Texte zu entfernen oder zwischen den Optionen umzuschalten.</p>

<p>Dr&uuml;cken Sie &quot;<i>Click here to open...</i>&quot;, um einen kleinen Dialog zu &ouml;ffnen, der es Ihnen erlaubt, schnell eine gro&szlig;e Liste von Texten (beispielsweise eine Liste Ihrer bevorzugten Filmtitel) anzuf&uuml;gen. Ebenso k&ouml;nnen Sie Text zum Beispiel aus einem Texteditor heraus in den Dialog einf&uuml;gen (STRG+V) oder diesen direkt aus einer Datei laden. Jede Zeile in den Textfeldern wird als separate Suchanfrage angef&uuml;gt, wenn Sie OK dr&uuml;cken, und alle neuen Eintr&auml;ge werden dieselben Optionen besitzen. Leerzeichen am Beginn oder Ende von Zeilen werden automatisch entfernt und mit # beginnende Zeilen werden &uuml;bersprungen, wenn sie aus einer Datei heraus geladen werden.</p>

<p>Ein Verlauf der letzten 50 Suchbegriffe (nur manuell eingegebene) einschlie&szlig;lich deren Optionen ist im Dropdown-Men&uuml; unterhalb des Texteingabefeldes verf&uuml;gbar. Sie k&ouml;nnen es mit dem Pfeilknopf an der rechten Seite des Eingebefeldes &ouml;ffnen, oder mit einer der &quot;Pfeil auf/ab&quot;-Tasten. Ebenso stehen die letzten 10 Suchw&ouml;rter im Men&uuml; des Spaltenkopfs <i>Title</i> der Programmliste zur Verf&uuml;gung (letzteres nur im &quot;Single List&quot;-Layout.)</p>

</dd>
<dt id="Recurring-titles"><b>Recurring titles</b></dt>
<dd>

<p>Das Filtermen&uuml; dieses Namems listet alle Programmtitel auf, die mehr als einmal in der Datenbank vorkommen. Intern basiert die Suche schlicht auf der Textsuche, d.h. es handelt sich nicht um einen eigenen Filtertyp. Um einzelne &uuml;ber dieses Men&uuml; gesetzten Filter aufzuheben k&ouml;nnen sie daher den <i>Text search</i> Dialog verwenden.</p>

</dd>
<dt id="Features"><b>Features</b></dt>
<dd>

<p>Begrenzt die Auflistung auf Sendungen, bei denen alle vorgegebenen Attribute zutreffen (logisches UND), d.h. sound format, picture format, analog/digital, encrypted yes/no, live/new/repeat und subtitles yes/no.</p>

<p>Wenn Sie mehr als einen Wert des gleichen Attributes erlauben wollen (z.B. Bildformat widescreen ODER Pal+), m&uuml;ssen Sie diese in unterschiedliche Featureklassen setzen (z.B. zuerst Format widescreen w&auml;hlen, dann die Filterklasse auf 2, danach PAL+ w&auml;hlen).</p>

</dd>
<dt id="Parental-Rating"><b>Parental Rating</b></dt>
<dd>

<p>Begrenzt die Auflistung auf Sendungen, die f&uuml;r Kinder des angegebenen Alters oder &auml;lter geeignet sind. Zum Beispiel: wenn Sie 14 w&auml;hlen, erhalten Sie alle Sendungen f&uuml;r Kinder zwischen 0 und 14 Jahren.</p>

<p><b>Tipp:</b> Sie k&ouml;nnen die Filterinvertierung benutzen um Sendungen zu finden, die erst ab einem bestimmten Alter freigegeben sind (siehe n&auml;chstes Kapitel). Um z.B. alle Sendungen mit Freigabe ab 16 oder ab 18 zu finden, w&auml;hlen Sie Alter 14 und invertieren Sie die Suche.</p>

</dd>
<dt id="Editorial-Rating"><b>Editorial Rating</b></dt>
<dd>

<p>Begrenzt die Auflistung auf Sendungen, die entsprechend der Bewertung des Inhalteanbieters mindestens eine bestimmte Qualit&auml;t besitzen. Der Bereich der Werteskala geht von 1 bis 7.</p>

<p>Zu bemerken ist, dass einige Anbieter nicht alle Werte verwenden, beispielsweise nur 1, 3, 5 (Daumen hoch, Mittel, Daumen runter). Aus diesem Grund werden beim Mischen von Datenbanken Ratings auch nur vom ersten Anbieter &uuml;bernommen (siehe auch <a href="#MERGED-DATABASES">&quot;MERGED DATABASES&quot;</a>.)</p>

</dd>
<dt id="Start-time"><b>Start time</b></dt>
<dd>

<p>Beschr&auml;nkt die Liste der Programme auf solche, deren Startzeit innerhalb des angegebenen Intervalls liegt und das am angegebenen Datum oder Wochentag l&auml;uft.</p>

<p>Folgende Optionen stehen zur Verf&uuml;gung: Wenn Sie &quot;<i>Start at current time</i>&quot; aktivieren, wird der Intervallstart auf die aktuelle Uhrzeit beim Setzen des Filters festgelegt und der als Stopzeit eingegebene Wert wird als Dauer interpretiert, d.h. er wird zum Intervallstart hinzuaddiert. Aktivieren Sie &quot;<i>Stop at end of day</i>&quot;, wird das Intervall-Ende auf 23:59 desselben Tages festgelegt.</p>

<p>F&uuml;r das Datum k&ouml;nnen Sie zwischen folgenden Modi w&auml;hlen: <i>Ignore date</i>: der Filter erlaubt Sendungen, die an irgendeinem Tag starten (im oberhalb stehenden Zeitfenster). <i>Relative date</i>: erlaube nur Sendungen, die in N Tagen von heute an starten, d.h. f&uuml;r Null: heute, f&uuml;r 1: morgen usw. <i>Weekday</i>: erlaube Sendungen, die am angegebenen Wochentag starten (die Skala l&auml;uft von Samstag bis Freitag). <i>Day of month</i>: erlaube nur Sendungen, die am n-ten Tag eines Monats starten (die Skala l&auml;uft von 1 bis 31).</p>

<p>Zur manuellen Navigation au&szlig;erhalb von Filtershortcuts gibt es praktikablere Alternativen als diesen Filter, wie z.B. die Wochentags-Skala und Dropdown-Men&uuml;s im Hauptfenster des Browsers oberhalb der Zeit- und Datumsspalten (nicht verf&uuml;gbar im Grid-Layout).</p>

</dd>
<dt id="Program-index"><b>Program index</b></dt>
<dd>

<p>Begrenzt die Auflistung auf Sendungen, deren Index innerhalb eines vorgegebenen Bereiches liegt. Die aktuell laufenden Programme eines jeden Senders besitzen den Index Null, die folgende Sendung jedes Senders Index Eins usw. Die drei wichtigsten Kombinationen sind als Radiobuttons verf&uuml;gbar: <i>now</i>: aktuell laufende Sendungen (Bereich 0-0), <i>next</i>: direkt folgende Sendungen (Bereich 1-1) und &quot;<i>now or next</i>&quot; (Bereich 0-1).</p>

<p>Bei zusammengef&uuml;hrten Datenbanken werden nur die Indizes 0 und 1 unterst&uuml;tzt.</p>

</dd>
<dt id="Duration"><b>Duration</b></dt>
<dd>

<p>Begrenzt die Auflistung auf Sendungen, deren Dauer (d.h. die Differenz zwischen Start- und Stopzeit) innerhalb eines vorgegebenen Bereichs liegt. Wird das Maximum auf Null gesetzt, wird der Filter ausgeschaltet.</p>

<p>Die Zeitdauer kann entweder durch die Skalen oder durch direkte Eingabe der Werte im Format SS:MM (Sekunde und Minute je zweistellig) in die Textfelder und durch Best&auml;tigen mit der ENTER-Taste erfasst werden.</p>

</dd>
<dt id="Expired-Programmes-Display"><b>Expired Programmes Display</b></dt>
<dd>

<p>Im Gegensatz zu allen anderen Filteroptionen wird diese genutzt, um den Satz zutreffender Sendungen zu <i>vergr&ouml;&szlig;ern</i>. Standardm&auml;&szlig;ig ist die Schwelle f&uuml;r die Ablaufzeit Null, sodass abgelaufene Sendungen sofort aus der Anzeige verschwinden. Die Optionen in diesem Dialog erbauben, die Schwelle zu &auml;ndern, so da&szlig; auch Sendungen mit Stoppzeit in der Vergangenheit angezeigt werden. Diese werden mit einem gelblichen Hintergrund gekennzeichnet (die Farbe k&ouml;nnen Sie &auml;ndern, siehe <code>.Xdefaults</code> und <code>nxtvepg.ad</code> in <a href="#FILES">&quot;FILES&quot;</a>).</p>

<p>Mit dem Schieberegler k&ouml;nnen Sie die Schwelle der Ablaufzeit minutengenau verstellen. Die Eingabefelder unterhalb des Schiebers geben die &auml;quivalente Zeitschwelle in Einheiten von Tagen und Stunden an. Sie k&ouml;nnen diese Felder auch direkt editieren; Dr&uuml;cken Sie die Return-Taste um &Auml;nderungen zu &uuml;bernehmen.</p>

<p>Mit der Option <i>Show all expired programmes</i> kann dieser Filter abgeschalten werden, so dass alle abgelaufenen Sendungen angezeigt werden. Die Programmliste beginnt dann mit der &auml;ltesten Sendung die noch in der Programmdatenbank vorhanden ist.</p>

<p>Beachten Sie, dass Sie nicht mehr Sendungen hinzuf&uuml;gen k&ouml;nnen, als in der Datenbank gespeichert sind. nxtvepg l&ouml;scht abgelaufene Programme zwar nicht aus der Datenbank, jedoch passiert dies &uuml;blicherweise bei der Aktualisierung des XMLTV Files. Ob bzw. wie lange abgelaufene Programme bei Aktualisierung erhalten bleiben h&auml;ngt von Ihrem Anbieter bzw. dem zur Aktualisierung verwendeten Programm ab. Beim Teletext EPG Grabber k&ouml;nnen sie den Schwellwert frei konfigurieren (siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a> Kapitel &quot;Teletext Grabber&quot;).</p>

</dd>
<dt id="VPS-PDC"><b>VPS/PDC</b></dt>
<dd>

<p>Begrenzt die Auflistung auf Sendungen, die eine g&uuml;ltige VPS/PDC-Startzeit-Kennung angeh&auml;ngt haben (VPS/PDC erlauben die Aufnahme eines Videos zum exakten Zeitpunkt des Programmstarts, sogar wenn dieser verschoben wurde; die Kennungen werden zur Zeit in Deutschland, &Ouml;sterreich, der Schweiz und England &uuml;bertragen). Zus&auml;tzlich k&ouml;nnen Sie Filter f&uuml;r Sendungen definieren, deren Kennung sich von der aktuellen Startzeit unterscheidet; dies sind &uuml;blicherweise Sendungen, deren Startzeit ge&auml;ndert wurde oder die f&uuml;r sp&auml;ter geplant wurden (gew&ouml;hnlich ist die VPS/PDC-Kennung dann die aktuelle Startzeit abz&uuml;glich einer Minute).</p>

</dd>
</dl>

<h2 id="Inverting-filters">Inverting filters</h2>

<p>Am Ende des Filtermen&uuml;s findet sich das Untermen&uuml; <i>Invert</i>, welches es erm&ouml;glicht das Ergebnis der Filterung ins Gegenteil umzukehren (d.h. nur die Programme anzuzeigen die sonst ausgefiltert worden w&auml;ren). Es gibt zwei M&ouml;glichkeiten: global und individuell.</p>

<p>Wenn Sie die globale Umkehrung (engl. &quot;<i>global inversion</i>&quot;) w&auml;hlen, werden Sie exakt diejenigen Sendungen erhalten, welche ansonsten ausgefiltert w&uuml;rden (ausgenommen Sendungen, die von Ihrer Sender- und Sendezeitwahl permanent ausgefiltert werden). Beachten Sie: durch die Art wie Filter-Shortcuts zusammengef&uuml;hrt werden, wenn mehr als einer gleichzeitig gew&auml;hlt wurde, ist es in den meisten F&auml;llen nicht angeraten, globales Umkehren f&uuml;r Filter-Shortcuts zu verwenden, solange Sie die Kombinationsregel nicht &auml;ndern (siehe <a href="#FILTER-SHORTCUTS:-Shortcut-combination-modes">&quot;FILTER SHORTCUTS: Shortcut combination modes&quot;</a>).</p>

<p>Das Invert-Men&uuml; erlaubt ebenso, bestimmte Filtertypen individuell zu invertieren (auch in einigen Filter-Untermen&uuml;s gibt es <i>Invert</i>-Buttons mit derselben Funktion). Die Logik hinter der Kombination von Filtern ist dieselbe wie ohne die Invertierung, d.h. es gibt ein logisches ODER zwischen Filtern des gleichen Typs (beispielsweise Sender A ODER Sender B) und ein logischen UND zwischen verschiedenartigen Filtertypen (z.B. Sender A UND Themenkategorie Spielfilm).</p>

<p><b>Beispiel 1:</b> Wenn Sie alle Sendungen wollen, die weder als Sport- noch als Kindersendungen kategorisiert sind, w&auml;hlen Sie die Themenfilter Sport und Kinder und invertieren danach den aktuellen Themenfilter (gew&ouml;hnlich Klasse #1; Sie k&ouml;nnen gleicherma&szlig;en das globale Umkehren verwenden, wenn Themen die einzigen Filter sind).</p>

<p>Beim Themenfilter ist es m&ouml;glich, nur Teile der Auswahl zu invertieren, sodass Sie voraussetzen k&ouml;nnen, dass die Sendung bestimmte Attribute und gleichzeitig kein weiteres Attribut besitzt.</p>

<p><b>Beispiel 2:</b> Wenn Sie alle Sendungen wollen, die Spielfilme aber NICHT f&uuml;r Erwachsene sind, w&auml;hlen Sie die Themenkategorie &quot;Spielfilm&quot;, schalten die Themenklasse nach 2 um, w&auml;hlen das Thema &quot;Erwachsene&quot; und invertieren Themenklasse 2.</p>

<p>Beachten Sie: obwohl das Feature Filter die Verwendung verschiedener Klassen anbietet und somit ein logisches ODER unterst&uuml;tzt, ist die Invertierung nicht auf Klassen basiert. Dies kommt daher, dass es ein logisches ODER zwischen den Featureklassen gibt (im Gegensatz zum logischen UND zwischen Themenklassen).</p>

<h1 id="FILTER-SHORTCUTS">FILTER SHORTCUTS</h1>

<p>Es gibt eine Reihe vordefinierter Filteroptionen im Hauptfenster unter der Uhr. Diese so genannten Shortcuts erm&ouml;glichen Ihnen, Filter mit einem einzelnen Mausklick zu aktivieren. Sie k&ouml;nnen beliebig Eintr&auml;ge zu dieser Liste hinzuf&uuml;gen, &auml;ndern oder l&ouml;schen.</p>

<p>Wollen Sie einen Shortcut hinzuf&uuml;gen, stellen Sie zun&auml;chst die Filter so ein, wie Sie diese speichern wollen. W&auml;hlen Sie also entweder vorhandene Shortcuts und/oder f&uuml;gen Sie Filter aus dem Hauptmen&uuml; oder dem Kontextmen&uuml; hinzu. Haben Sie eine interessante Konfiguration gefunden, w&auml;hlen Sie &quot;<i>Add filter shortcut</i>&quot; aus dem Men&uuml; <i>Shortcuts</i>.</p>

<p>Dies wird den Dialog zum Bearbeiten des Shortcuts (der unten detailliert beschrieben wird) mit Ihrem neuen Shortcut am Beginn der linken Liste &ouml;ffnen. Sie sollten die Shortcut-Kennung im Feld oben rechts &auml;ndern; standardm&auml;&szlig;ig ist es &quot;<i>new shortcut</i>&quot;. Die Kennung wird in der Shortcut-Liste im Hauptfenster angezeigt. Sind Sie fertig, dr&uuml;cken Sie den Button <i>Save</i>. Dr&uuml;cken Sie <i>Abort</i> wenn Sie es sich anders &uuml;berlegt haben und den Shortcut schlie&szlig;lich doch nicht hinzuf&uuml;gen wollen.</p>

<p>Mit Hilfe der gedr&uuml;ckten linken Maustaste oder durch gleichzeitiges Dr&uuml;cken der <i>STRG</i>- oder <i>SHIFT</i>-Tasten, k&ouml;nnen Sie mehrere Shortcuts parallel aktivieren, wenn Sie diese im Listenfeld des Hauptfensters ausw&auml;hlen. Siehe n&auml;chstes Kapitel bez&uuml;glich m&ouml;glicher Nebeneffekte beim Kombinieren von Shortcuts.</p>

<p>Die Shortcut-Liste besitzt ein kleines Kontextmen&uuml;, das beim Klick in sie mit der rechten Maustaste gezeigt wird. Dieses bietet schnelleren Zugriff auf dieselben Befehle, die im Hauptmen&uuml; zur Verf&uuml;gung stehen und zus&auml;tzlich einen <i>Delete</i>-Befehl; der Shortcut auf den Sie mit der Maustaste klicken, wird f&uuml;r die gew&auml;hlte Operation vorselektiert.</p>

<p>Wenn Sie einen Shortcut aktualisieren (engl. &quot;<i>update</i>&quot;) und Ihre aktuellen Filter-Einstellungen andere Filter als Ihre zuvor gespeicherten Einstellungen enthalten, werden Sie gefragt, ob die Filtermaske automatisch angepasst werden soll (z.B. wenn Ihr Filter zuvor nach der Themenkategorie &quot;Spielfilm&quot; gesucht hatte, der gegenw&auml;rtige Filter jedoch aus einer Textsuche besteht). Siehe unten nach mehr Details &uuml;ber Filtermasken; solange Sie diese Shortcut-Maske zuvor nicht manuell bearbeitet haben, k&ouml;nnen Sie sorglos auf &quot;Yes&quot; dr&uuml;cken.</p>

<h2 id="Editing-Filter-Shortcuts">Editing Filter Shortcuts</h2>

<p>Um Namen und/oder die Organisation Ihrer Shortcuts zu &auml;ndern, &ouml;ffnen Sie den <i>Edit</i>-Dialog (z.B. &uuml;ber das Hauptmen&uuml;). Auf der linken Seite des Dialogfensters steht eine Liste aller Ihrer Shortcuts. In der Mitte befindet sich eine Reihe von Befehlskn&ouml;pfen, die mit dem zur Linken markierten Shortcut zusammenarbeiten (unten erkl&auml;rt). Zur Rechten liegt ein editierbares Feld mit dem Shortcut-Namen, eine nicht-beschreibbare Anzeige der dem Shortcut momentan zugewiesenen Filter-Einstellungen, und Popupmen&uuml;s zum &Auml;ndern der Filtermaske und der Kombinationsregeln (unten ebenfalls detailliert erkl&auml;rt).</p>

<p>Die Buttons mit den auf/ab-Pfeilen werden den markierten Shortcut nach oben bzw. unten bewegen. Die Buttons mit den nach links oben oder rechts unten zeigenden Pfeilen werden verwendet, um einen Shortcut aus einem Unterordner heraus beziehungsweise in einen hinein zu bewegen.</p>

<p>Der Button <i>Delete</i> entfernt den ausgew&auml;hlten Shortcut aus der Liste (das L&ouml;schen wird das Hauptfenster nicht ver&auml;ndern, solange Sie nicht auf <i>Save</i> dr&uuml;cken, Sie k&ouml;nnen den Dialog also mit <i>Abort</i> verlassen, um die Aktion r&uuml;ckg&auml;ngig zu machen).</p>

<p>Der Button <i>Invoke</i> wird die Filter-Einstellungen des Shortcuts genau so auf das Hauptfenster anwenden, als wenn Sie den Shortcut in der Liste des Hauptfensters ausw&auml;hlen. Sie k&ouml;nnen danach die Filter-Einstellungen &uuml;ber das Filtermen&uuml; &auml;ndern. Verwenden Sie den Button <i>Update</i>, um dem bearbeiteten Shortcut die Filter-Einstellungen des Hauptfensters zuzuweisen.</p>

<p>Sie sollten vorsichtig mit dem <i>Update</i>-Button umgehen, da leicht ein falscher Shortcut &uuml;berschrieben werden kann. Haben Sie solch einen Irrtum festgestellt, k&ouml;nnen Sie die &Auml;nderung r&uuml;ckg&auml;ngig machen, entweder indem Sie den <i>Edit</i>-Dialog &uuml;ber den Button <i>Abort</i> verlassen oder indem Sie den entsprechenden Shortcut im Hauptfenster markieren und ihm die Originaleinstellungen &uuml;ber <i>Update</i> zuweisen.</p>

<h2 id="Filter-Masks">Filter Masks</h2>

<p>Wenn Sie einen Shortcut deselektieren, sei es weil Sie einen anderen Shortcut w&auml;hlen oder weil Sie ein zweites Mal mit gedr&uuml;ckter <i>STRG</i>-Taste draufklicken, werden alle seine Filter automatisch r&uuml;ckg&auml;ngig gemacht. Infolgedessen werden Sie, wenn Sie zwei Themen-Shortcuts haben, z.B. &quot;Spielfilm&quot; und &quot;Sport&quot;, und zuerst Spielfilm dann Sport ausw&auml;hlen, hinterher nur Sportsendungen sehen. Jedoch, wenn Sie das Thema &quot;Spielfilm&quot; manuell ausgew&auml;hlt hatten, beispielsweise &uuml;ber das im n&auml;chsten Kapitel beschriebene Kontextmen&uuml;, bleibt der Filter Spielfilm m&ouml;glicherweise gesetzt, sodass Sie alle Sendungen mit Thema Spielfilm ODER Sport bekommen werden. Da dies normalerweise nicht der Erwartung entspricht, wurde bei den Shortcut-Einstellungen eine Filtermaske eingef&uuml;hrt.</p>

<p>Die Filtermaske wird im Dialog Shortcuts mittels je einer Checkbox pro Filterkategorie definiert. Standardm&auml;&szlig;ig ist die Maske f&uuml;r jede Filterkategorie aktiviert, die Sie in die Einstellungen der Shortcut-Filter eingebunden haben. Rufen Sie den Shortcut sp&auml;ter aus dem Hauptfenster heraus auf, werden alle Filter der entsprechenden Kategorie entfernt (demaskiert) bevor die Shortcut-Filter hinzugef&uuml;gt werden.</p>

<p>Das Maskieren kann auch aktiviert werden, wenn kein Filter dieser Kategorie ausgew&auml;hlt wurde. Dies kann verwendet werden, um &quot;L&ouml;sch-Shortcuts&quot; zu definieren. W&auml;hlen Sie z.B. die Maske &quot;Themen&quot; aus, wenn Sie einen Shortcut haben wollen, der erlaubt, alle themen-bezogenen Filter auf einmal aufzuheben. Oder aktivieren Sie alle Masken f&uuml;r einen <i>Reset</i>-Button (der einzige Unterschied zum vordefinierten <i>Reset</i>-Button w&auml;re, dass die Anzeige nicht zur ersten aktuellen Sendung springt).</p>

<h2 id="Shortcut-combination-modes">Shortcut combination modes</h2>

<p>Wenn Sie Shortcuts miteinander kombinieren, werden standardm&auml;&szlig;ig alle Filter aller gew&auml;hlten Shortcuts zusammengef&uuml;hrt und weiter verarbeitet, als w&uuml;rden sie alle zu einem Shortcut geh&ouml;ren. Es treffen die selben Kombinationsregeln zu wie in <a href="#FILTERING">&quot;FILTERING&quot;</a> beschrieben.</p>

<p>Sucht zum Beispiel ein Shortcut nach Spielfilmen, ein anderer nach Untertiteln, wird die Kombination nach Sendungen suchen, die Spielfilme sind <b>UND</b> Untertitel besitzen. Weiterhin wird die Kombination nach allen Sendern filtern, die entweder Dramen <b>ODER</b> Kom&ouml;dien sind, wenn Sie einen Shortcut haben der nach Dramen, und einen der nach Kom&ouml;dien filtert.</p>

<p>Bei solch einfachen Shortcuts, die aus einem einzigen Filtertyp bestehen, ist dieses Verhalten gew&ouml;hnlich intuitiv. Wenn Sie komplexe Filter kombinieren, wird jedoch das Ergebnis der Mischung m&ouml;glicherweise nicht Ihren Erwartungen entsprechen. Wenn Sie zum Beispiel die Shortcuts &quot;Dramen auf Sender A&quot; und &quot;Kom&ouml;dien auf Sender B&quot; haben, w&uuml;rde die Zusammenf&uuml;hrung &quot;Dramen ODER Kom&ouml;dien auf Sender A ODER B&quot; ergeben (d.h. beispielsweise w&uuml;rde die Liste ebenso Dramen auf Sender B beinhalten).</p>

<p>Deshalb besitzt der Dialog zum Bearbeiten der Shortcuts eine &quot;<i>Combination rule</i>&quot;-Option, wo Sie den Modus in <i>ODER</i> oder <i>UND</i> &auml;ndern k&ouml;nnen. Versetzen Sie einen Shortcut in diesen Modus, werden dessen Filter getrennt von allen anderen behandelt.</p>

<p>Der einzige Nachteil ist, dass derartige Shortcut-Filter nicht &uuml;ber die Filtermen&uuml;s editierbar sind. Sollten Sie irgendwann die Filter-Einstellungen &auml;ndern wollen, ohne alles von vorne erstellen zu m&uuml;ssen, verwenden Sie die Buttons <i>Invoke</i> und <i>Update</i> im <i>Edit</i>-Dialog (siehe <a href="#FILTER-SHORTCUTS:-Editing-Filter-Shortcuts">&quot;FILTER SHORTCUTS: Editing Filter Shortcuts&quot;</a>).</p>

<h2 id="Shortcut-update-dialog">Shortcut update dialog</h2>

<p>Wenn Sie den Befehl &quot;<i>Shortcut Update</i>&quot; im Hauptmen&uuml; ausw&auml;hlen, wird ein kleiner Dialog mit einer Liste aller Shortcuts eingeblendet. Die Filter-Einstellungen des Shortcuts, den Sie in der Liste w&auml;hlen, werden wenn Sie den Button <i>Update</i> dr&uuml;cken mit den momentan aktiven Filter-Einstellungen &uuml;berschrieben. Sie k&ouml;nnen genauso gut die Buttons <i>Update</i> oder <i>Edit</i> verwenden, um in den Dialog f&uuml;r die Filterbearbeitung zu springen (siehe weiter oben in diesem Kapitel).</p>

<p><b>Tipp:</b> W&auml;hrend das Dialogfenster zum Editieren der Shortcuts ge&ouml;ffnet ist, werden jedwede &Auml;nderungen (z.B. L&ouml;schungen oder Hinzuf&uuml;gungen) nur auf die tempor&auml;re Liste im Dialogfenster angewandt. Erst wenn Sie den Button <i>Save</i> dr&uuml;cken erscheinen die &Auml;nderungen in der Shortcut-Liste im Hauptfenster. Ebenso besteht die f&uuml;r Shortcut-Aktualisierungen angebotene Liste aus den Shortcuts der tempor&auml;ren Liste. Dies gibt Ihnen die M&ouml;glichkeit Ihre &Auml;nderungen zu Testen bevor Sie sie speichern und sie gegebenenfalls mit <i>Abort</i> zu verwerfen.</p>

<p><b>Tipp:</b> Noch schneller k&ouml;nnen Sie einen einzelnen Shortcut &auml;ndern indem Sie das Kontextmen&uuml; der Shortcut-Liste verwenden. Dort entf&auml;llt der Zwischenschritt der Shortcut-Auswahl.</p>

<h1 id="COMPOSITE-ATTRIBUTES">COMPOSITE ATTRIBUTES</h1>

<p>Standardm&auml;&szlig;ig zeigt die Programmliste f&uuml;r jede Sendung eine Auswahl an elementaren Attributen wie Datum, Startzeit, Titel, TV-Sender. Indem Sie die Composite-Attribute verwenden, k&ouml;nnen Sie die TV-Programmtabelle Ihren pers&ouml;nlichen Vorlieben entsprechend anpassen. Beispielsweise k&ouml;nnten Sie (1) das Anzeigeformat vordefinierter Attribute ver&auml;ndern (z.B. Farben zur Hervorhebung benutzen), (2) neue Attribute hinzuf&uuml;gen, beispielsweise f&uuml;r Bilder als Kennzeichnung bevorzugter Sendungen, und/oder (3) die Anzeige durch die Kombination verschiedener Attribute in ein einziges verdichten.</p>

<p>Zusammengesetzte Attribute (&quot;composite attribute&quot;) ersetzen einzelne Attribute in der Anzeige (z.B. nur die Spalte mit den Themenkategorien). Neu erstellte Composite-Attribute werden an die Liste der vordefinierten Attribute angeh&auml;ngt. Sie k&ouml;nnen dann Ihre Sendungsliste als eine Mischung aus vordefinierten und Composite-Attributen konfigurieren (siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;Select attributes&quot;).</p>

<p>Composite-Attribute werden &uuml;ber den Dialog &quot;<i>Attribute composition</i>&quot; im <i>Configure</i>-Men&uuml; erstellt und bearbeitet (siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;Attribute composition&quot;).</p>

<p>Das &quot;Herz&quot; der Attribut-Komposition ist eine Liste von Filter-Shortcuts und Reminder-Gruppen, die Sie als Auswahl Ihrer pers&ouml;nlichen Filter-Shortcuts und/oder Reminder-Gruppen aufbauen (siehe auch <a href="#FILTER-SHORTCUTS">&quot;FILTER SHORTCUTS&quot;</a> und <a href="#REMINDERS">&quot;REMINDERS&quot;</a>).</p>

<p>Immer wenn nxtvepg ein Composite-Attribut im Browser anzeigt, vergleicht es die aktuellen Attribute der Sendung (beispielsweise Themenkategorien oder zugewiesene Reminder) mit den entsprechenden Composite-Attributen, die den Shortcuts und Reminder-Gruppen zugewiesenen sind. Die Vergleiche erfolgen in der gegebenen Reihenfolge, d.h. von oben nach unten in der Liste des Dialogs. Wird beim Vergleich ein Treffer gefunden, wird ein diesem Shortcut zugewiesener Text, Bild oder Attribut im auf der rechten Seite spezifizierten Format innerhalb der Programmliste angezeigt. Wenn keines trifft (und es existiert kein <i>*no match*</i>-Eintrag, siehe unten), wird an der Stelle des Attributs nichts dargestellt.</p>

<p>Beachten Sie, <i>Vergleich</i> bedeutet in diesem Zusammenhang, dass die Filter eines Shortcuts gegen die TV-Sendung gepr&uuml;ft werden, d.h. eine Sendung &quot;trifft&quot; einen Filter, wenn sie weiterhin angezeigt w&uuml;rde, wenn Sie diesen Filter-Shortcut im Hauptfenster aktivieren. Entsprechend wird eine Reminder-Gruppe als zutreffend angenommen, wenn die jeweilige Sendung als ein Reminder innerhalb dieser Gruppe programmiert ist (oder auf einen Shortcut zutrifft, der einer gegebenen Reminder-Gruppe zugewiesen ist - aber der Einfachheit halber sei diese Option hier &uuml;bergangen).</p>

<p><b>Beispiel</b>: um eine pers&ouml;nlich gestaltete Version der Spalte <i>Editorial rating</i> (ER) zu erstellen, k&ouml;nnten Sie drei Shortcuts erzeugen: einen mit dem auf &quot;&gt;=6&quot; gesetzten ER-Filter, einen mit &quot;&gt;=4&quot; und einen mit &quot;&gt;=2&quot;; danach k&ouml;nnten Sie eine neue benutzerdefinierte Spalte erzeugen und diese drei Shortcuts in gleicher Reihenfolge einf&uuml;gen; dem ersten Shortcut-Treffer k&ouml;nnten Sie den Text &quot;sehr gut&quot;, dem zweiten &quot;ok&quot; und dem dritte &quot;mies&quot; zuweisen. Als Resultat h&auml;tten Sie eine Spalte, in der die numerischen Wertungen durch Ihren Text ersetzt w&auml;ren.</p>

<p>Es gibt auch einen speziellen Eintrag namens <i>*no match*</i> am Ende der Shortcut-Liste des Dialogs. Er wirkt wie ein Auffangnetz (d.h. Wildcard oder auch Joker), falls keiner der Shortcuts in der Spalte auf den aktuellen Programm-Eintrag zutrifft. Im obigen Beispiel w&auml;ren dies alle Sendungen mit einem ER unterhalb 2 oder ohne ein Rating.</p>

<p>Das <i>*no-match*</i> ist insbesondere zum &Uuml;berlagern von Standardspalten mit alternativem Text f&uuml;r gew&auml;hlte Sendungen n&uuml;tzlich. Um beim obigen Beispiel zu bleiben, k&ouml;nnten Sie eine Spalte mit zwei Shortcut-Eintr&auml;gen erzeugen: &quot;&gt;=6&quot; und &quot;*no-match*&quot;. Dem Treffer des Shortcuts &quot;&gt;=6&quot; k&ouml;nnten Sie einen Bild-Marker zuordnen; allen anderen das Attribut &quot;ER&quot;. Infolgedessen w&uuml;rde bei Sendungen mit einem ER &gt;=6 (d.h. alle Sendungen mit &quot;sehr gut&quot;) ein Bild angezeigt und diese w&uuml;rden sich somit von allen anderen Sendungen, die den regul&auml;ren Inhalt der ER-Spalte bekommen, klar abheben (d.h. dem numerischen Rating oder einer leeren Spalte f&uuml;r nicht bewertete Sendungen).</p>

<p>Sie k&ouml;nnen diesen Mechanismus auch nutzen, um mehrere Spalten in eine zu kombinieren, damit die Auflistung kompakt bleibt. Zum Beispiel k&ouml;nnen Sie die ER-Spalte mit der Themenspalte kombinieren, so dass bei Spielfilmen mit einem ER &gt;=6 der Text &quot;1A Spielfilm&quot; angezeigt wird, bei allen anderen die regul&auml;re Themenbeschreibung.</p>

<h1 id="REMINDERS">REMINDERS</h1>

<p>Reminder erm&ouml;glichen es ausgew&auml;hlte TV-Sendungen hervorzuheben. nxtvepg kann diese in der Programmliste markieren und, falls gew&uuml;nscht, vor deren Beginn eine Meldung anzeigen oder ein externes Kommando ausf&uuml;hren. Sie k&ouml;nnen in der Programmliste sowohl individuelle Sendungen markieren als auch alle Treffer auf Filter-Shortcuts, um z.B. TV-Serien zu markieren.</p>

<p>Um einen neuen Reminder zu setzen, markieren Sie einfach eine Sendung in der Programmliste und w&auml;hlen Sie &quot;<i>Add reminder for selected title</i>&quot; aus dem <i>Reminder</i>-Men&uuml;. Der gleiche Befehl steht auch im Kontextmen&uuml; zur Verf&uuml;gung, d.h. durch Anklicken des gew&auml;hlten Titels mit der rechten Maustaste. Um einen Reminder zu entfernen, markieren Sie den Titel einfach noch einmal und w&auml;hlen &quot;<i>Remove reminder for selected title</i>&quot;.</p>

<p>Standardm&auml;&szlig;ig zeigt nxtvepg eine Einblendung f&uuml;r jedes zu erinnernde Programm 5 Minuten vor Beginn und noch mal direkt beim Beginn an. Dieses Verhalten kann man im Dialog &quot;<i>Configure reminder groups...</i>&quot; &auml;ndern, wie im Folgenden beschrieben.</p>

<p>Wollen Sie einen Reminder f&uuml;r eine TV-Serie setzen, m&uuml;ssen Sie zuerst einen Filter-Shortcut erstellen, der auf diese Serie zutrifft. Um den Programmieraufwand zu reduzieren, k&ouml;nnen Sie einen Shortcut erzeugen, der auf alle Ihre Lieblingsserien zugleich zutrifft, und einen Reminder f&uuml;r diese Kollektion setzen. Um dem Shortcut einen Reminder zuzuordnen, verwenden Sie &quot;<i>Edit reminder list</i>&quot;, was im n&auml;chsten Kapitel beschrieben wird.</p>

<p><b>Tipp:</b> Sie k&ouml;nnen auch individuelle Reminder f&uuml;r Eintr&auml;ge hinzuf&uuml;gen, die bereits durch Shortcut-basierte Reminder markiert sind. Dies erlaubt es Ihnen zum einen, eine weitere spezifische Aktion f&uuml;r diese TV-Sendung anzuf&uuml;gen (indem Sie Reminder-Gruppen mit verschiedenen Aktionen verwenden, siehe unten). Au&szlig;erdem k&ouml;nnen Sie die Markierung f&uuml;r die einzelne ausgew&auml;hlte Sendung unterdr&uuml;cken (engl. &quot;to supress&quot;). Diese &quot;<i>supress</i>&quot;-Option wird in den Reminder- und Kontextmen&uuml;s angeboten, wenn anwendbar (durch diese M&ouml;glichkeit wird vermieden dass Shortcut-basierte Reminder mit komplexen Ausnahmeregeln eingeschr&auml;nkt werden m&uuml;ssen, um die Markierung unbeliebter Sendungen zu verhindern).</p>

<p>Standardm&auml;&szlig;ig besitzt nxtvepg (im &quot;<i>single list</i>&quot;-Layout) eine mit <i>Mark</i> betitelte Spalte, die bei allen Sendungen f&uuml;r die ein Reminder eingetragen ist einen roten Punkte enth&auml;lt. Selbstverst&auml;ndlich werden auch Sendungen markiert auf die Shortcuts mit zugeordneten Remindern zutreffen. Sie k&ouml;nnen auch einen Filter setzen der nur Sendungen mit Remindern in der Programmliste anzeigt, indem Sie &quot;<i>Show reminder matches</i>&quot; im Reminder-Men&uuml; ausw&auml;hlen.</p>

<h2 id="Edit-reminder-list">Edit reminder list</h2>

<p>&Ouml;ffnet eine Liste mit allen Remindern. Individuelle Reminder und Shortcut-basierte Reminder sind getrennt aufgelistet: Durch Klicken auf die Karteireiter im Dialogfenster wird zwischen den Listen gewechselt.</p>

<p>Die Liste &quot;<b>single programmes</b>&quot; ist nach Startzeit und Sender sortiert. Wenn Sie einen Reminder doppelklicken, springt die Anzeige im Hauptfenster zur Startzeit der Sendung (wenn diese aktuell in der Datenbank vorhanden ist). Um einen Reminder zu l&ouml;schen, klicken Sie auf den Button <i>Delete</i> oder dr&uuml;cken Sie die Entf-Taste auf Ihrem Keyboard. Sie k&ouml;nnen auch die &quot;Gruppe&quot; des Reminders (siehe unten) w&auml;hlen, entweder indem Sie eine Gruppe im Popupmen&uuml; des Men&uuml;buttons &quot;<i>Set group</i>&quot; w&auml;hlen oder durch einen Rechtsklick mit der Maus auf die Gruppenspalte.</p>

<p>Die Liste zeigt Reminder f&uuml;r Sendungen die abgelaufen sind nicht mehr an. Sie k&ouml;nnen das <i>Display</i>-Men&uuml; zur rechten verwenden, um dies zu &auml;ndern (nach ca. zwei Wochen werden die Reminder jedoch endg&uuml;ltig gel&ouml;scht). Sie k&ouml;nnen auch &quot;unterdr&uuml;ckte&quot; Reminder einbinden, d.h. Eintr&auml;ge, die &uuml;ber den entsprechenden Eintrag im Reminder Hauptmen&uuml; zum Unterdr&uuml;cken von Shortcut-Treffern erstellt wurden; diese erscheinen dann mit der Gruppenzuordnung <i>suppress</i> in der Liste.</p>

<p>Wenn Sie zum Karteireiter <b>Shortcuts</b> umschalten, sehen Sie eine Liste aller Shortcut-basierten Reminder. Beim ersten &Ouml;ffnen ist die Liste leer. Sie k&ouml;nnen Shortcuts hinzuf&uuml;gen, indem Sie diese aus dem Men&uuml; zur Rechten ausw&auml;hlen. &Auml;hnlich wie bei einzelnen Sendungen k&ouml;nnen Sie danach die Gruppe ver&auml;ndern oder die Reminder wieder entfernen. Alle &Auml;nderungen an der Liste werden unmittelbar gespeichert und die Markierungen in der Programmliste unmittelbar aktualisiert.</p>

<p>Alle &Auml;nderungen, die in diesem Dialog vorgenommen werden, treten sofort in Kraft.</p>

<h2 id="Reminder-group-configuration">Reminder group configuration</h2>

<p>&Ouml;ffnet einen Konfigurationsdialog f&uuml;r Reminder-Gruppen. Jeder Reminder ist genau einer Gruppe zugeordnet, die festlegt welche Aktionen zur Startzeit der Sendungen ausgef&uuml;hrt werden. Gruppen erlauben Ihnen, Aktionen leicht zu &auml;ndern (und insbesondere: sie zu deaktivieren, wenn Sie nicht in Stimmung sind, TV zu kucken), ohne jeden einzelnen Reminder editieren zu m&uuml;ssen. Wenn Sie einen neuen Reminder mit dem Men&uuml;befehl &quot;<i>add reminder</i>&quot; erstellen, wird dieser immer der ersten Gruppe zugeordnet, d.h. Index 0.</p>

<p>Standardm&auml;&szlig;ig hat nxtvepg nur eine Gruppe, die eine Nachricht 5 Minuten vor und direkt zur Startzeit auftauchen l&auml;sst. Sie k&ouml;nnen dies &auml;ndern, indem Sie die Gruppe in der linken Liste ausw&auml;hlen und dann die Parameter rechts modifizieren. Oder erstellen Sie einen neuen Reminder durch eine Klick auf <i>New</i>. Ebenso k&ouml;nnen Sie die Sortierreihenfolge der Gruppen &auml;ndern (nur aus Komfortgr&uuml;nden vorhanden; au&szlig;er f&uuml;r Gruppe Null ist die Reihenfolge irrelevant). Der Button <i>Show</i> setzt einen Filter f&uuml;r die Programmliste, sodass nur Sendungen angezeigt werden, die auf Reminder in der gleichen Gruppe zutreffen, wie der aktuell gew&auml;hlte Shortcut.</p>

<p>Am oberen Rand der Sektion zur Parametereingabe befindet sich das Eingabefeld <i>Label</i>. Es erlaubt der Gruppe einen Namen zu geben, welcher dann in den Reminderlisten und in den Best&auml;tigungsmeldungen der Reminder Verwendung findet. Darunter liegt eine Checkbox mit Namen &quot;<i>Temporarily disable all group events</i>&quot;. Ist diese aktiviert, werden alle Aktionen f&uuml;r diese Gruppe unterdr&uuml;ckt. Sie bekommen beispielsweise keine Popupnachricht und Skripte werden nicht ausgef&uuml;hrt. Die Sendungen werden somit im Listenfeld nur markiert. Die Einstellung ist nur w&auml;hrend der aktuellen Sitzung g&uuml;ltig und wird beim n&auml;chsten Start von nxtvepg zur&uuml;ckgesetzt. (Um die Benachrichtigungen dauerhaft zu unterdr&uuml;cken leeren Sie die Aktionsliste.)</p>

<p>Weiter unten liegt ein Eingabefeld, in das Sie eine Liste durch Kommas getrennter Werte eingeben k&ouml;nnen, die definieren, mit welchen Zeitvers&auml;tzen Remindernachrichten angezeigt werden; diese Vers&auml;tze werden von der Startzeit subtrahiert, d.h. wenn Sie &quot;5&quot; eingeben, wird eine Nachricht 5 Minuten vor der nominalen Startzeit der Sendung erscheinen. Sie k&ouml;nnen auch negative Werte verwenden (z.B. &quot;-5&quot;), wenn Sie Reminder nach der Startzeit erscheinen lassen wollen. Zus&auml;tzlich k&ouml;nnen Sie Startzeiten f&uuml;r Befehle setzen. Befehle werden still im Hintergrund ausgef&uuml;hrt, es sei denn Sie aktivieren &quot;<i>Ask before executing script</i>&quot;.</p>

<p>Anmerkung: &Auml;nderungen an der Konfiguration (einschlie&szlig;lich Hinzuf&uuml;gen oder L&ouml;schen von Gruppen) werden nicht angewandt, bevor man den Dialog mit OK verl&auml;sst.</p>

<h2 id="Reminder-Messages">Reminder Messages</h2>

<p>Ist die nominale Startzeit (abz&uuml;glich des konfigurierten Zeitversatzes) einer &quot;gemerkten&quot; Sendung erreicht, erscheint ein Benachrichtigungsfenster. Wird mehr als eine Nachricht gleichzeitig ausgel&ouml;st oder wenn Sie das Fenster offen lassen und Reminder f&uuml;r zus&auml;tzliche Sendungen ausgel&ouml;st werden, werden alle in einem Fenster zusammengestellt; in diesem Fall gibt es eine Schreibmarke, die bestimmt, zu welchen Remindern die unten erkl&auml;rte Steuerung geh&ouml;rt. Wenn Sie <i>OK</i> klicken, werden alle Meldungen als &quot;erledigt&quot; markiert und nicht wieder erscheinen. Durch einen Doppelklick oder mit dem Button &quot;<i>Tune TV</i>&quot; k&ouml;nnen Sie den Kanal mit der gew&auml;hlten Sendung in einer verbundenen TV-Anwendung wechseln, so wie Sie es auch in der Hauptprogrammliste tun.</p>

<p>In den Benachrichtigungsfenstern gibt es verschiedene Eingabeelemente zur Kontrolle der weiteren Reminder-Prozedur. <i>Suppress</i> verhindert weitere Meldungen f&uuml;r die Sendung (zu bemerken ist, dass dies nicht das Selbe ist wie das Verhindern von Remindern im Hauptmen&uuml;, da Sie hier nur Meldungen unterdr&uuml;cken, die Sendung jedoch als Reminder markiert bleibt). <i>Repeat</i> erlaubt Ihnen, zus&auml;tzliche Reminder-Meldungen mit beliebigen Zeitverschiebungen zu planen. Beachten Sie, dass die f&uuml;r die Gruppe konfigurierten Meldungen bis zur manuellen Wiederholung unterdr&uuml;ckt werden, danach aber wieder normal abgearbeitet werden.</p>

<h1 id="CONTEXT-MENU">CONTEXT MENU</h1>

<p>Ein schneller Weg Filter aus- und abzuw&auml;hlen f&uuml;hrt &uuml;ber das Kontextmen&uuml;, welches nach einem Klick der rechten Maustaste auf einen Programmeintrag im Hauptfenster des Browsers ge&ouml;ffnet wird.</p>

<p>Dieses Men&uuml; besteht aus mehreren Teilen, die durch horizontale Linien getrennt sind, welche von der aktuell ausgew&auml;hlten Sendung abh&auml;ngen und daher nicht immer sichtbar sind.</p>

<dl>

<dt id="Deaktivieren-von-Filteroptionen"><b>Deaktivieren von Filteroptionen</b></dt>
<dd>

<p>Die erste Sektion enth&auml;lt Eintr&auml;ge, die das Deaktivieren des aktuell gew&auml;hlten Filters erlauben entweder einen nach dem anderen oder global (Reset). Siehe auch <a href="#FILTERING:-Filter-Types">&quot;FILTERING: Filter Types&quot;</a></p>

</dd>
<dt id="Hinzufgen-von-Filteroptionen"><b>Hinzuf&uuml;gen von Filteroptionen</b></dt>
<dd>

<p>Die zweite Sektion bietet eine Anzahl neuer Filteroptionen an, die vom aktuell gew&auml;hlten Titel und den bereits gew&auml;hlten Filtern abh&auml;ngen. Zu den angebotenen Filtertypen z&auml;hlen: Themen und Sender des gew&auml;hlten Programmtitels, Unterdr&uuml;ckung von Wiederholungs- oder Original&uuml;bertragung (nur in Verbindung mit Titeltextfiltern) und zu guter Letzt der Titeltext.</p>

<p>Die Titeltextfilter erlaubt sehr schnell nach Wiederholungen einer Sendung zu sehen. Diese Filteroption wird nur beigef&uuml;gt, wenn auch ein Treffer vorliegt, d.h. wenn eine andere Sendung mit gleichem Titel existiert.</p>

</dd>
<dt id="Hinzufgen-von-Erinnerungen"><b>Hinzuf&uuml;gen von Erinnerungen</b></dt>
<dd>

<p>Dieser Men&uuml;eintrag wird einen Reminder f&uuml;r die aktuell gew&auml;hlte Sendung hinzuf&uuml;gen. Der Reminder wird der Standard-Remindergruppe angeh&ouml;ren. Um Reminder in anderen Gruppen anzulegen verwenden Sie &quot;<i>Add reminder into group</i>&quot; im Reminder-Hauptmen&uuml; (siehe auch <a href="#REMINDERS">&quot;REMINDERS&quot;</a>).</p>

</dd>
<dt id="Benutzerdefinierte-Eintrge"><b>Benutzerdefinierte Eintr&auml;ge</b></dt>
<dd>

<p>Die optionale, vierte Sektion ist standardm&auml;&szlig;ig leer, kann aber dazu verwendet werden, benutzerdefinierte externe Programme f&uuml;r die selektierte Sendung aufzurufen. Genauer gesagt k&ouml;nnen Sie auf ihrer Befehlszeile Parameter (wie beispielsweise Titel oder Startzeit) der gew&auml;hlten Sendung einschlie&szlig;en. Die Befehle k&ouml;nnen &uuml;ber ein Konfigurationsmen&uuml; hinzugef&uuml;gt werden (siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;Context menu configuration&quot;).</p>

</dd>
</dl>

<h1 id="CONTROL-MENU">CONTROL MENU</h1>

<p>&Uuml;bersicht der im Control-Men&uuml; verf&uuml;gbaren Befehle:</p>

<h2 id="Load-XMLTV-file">Load XMLTV file</h2>

<p>&Ouml;ffnet den Dialog Laden von EPG Daten aus einer Datei im XMLTV Format. Dieser Dialog zeigt alle XMLTV Dateien im Verzeichnis an das im Eingabefeld an der Oberseite des Dialogfensters ausgew&auml;hlt ist. Ein anderes Verzeichnis kann mit Klick auf den Knopf ganz rechts neben dem Eingabefeld gew&auml;hlt werden. Der Verzeichnisname kann auch manuell editiert werden; Nach Dr&uuml;cken der Return-Taste wird die Liste der Dateien aktualisiert. (Zu beachten ist dass nur Dateien mit Endung &quot;.xml&quot; und g&uuml;ltigem XMLTV Schema in der Liste angezeigt werden.)</p>

<p>Wurde eine Datei in der Liste durch Anklicken selektiert, werden in dieser XML Datei enthaltenen Informationen &uuml;ber die Quelle der Daten die Liste der abgedeckten Sender rechts im Dialogfenster angezeigt. Durch Doppelklick auf einen Dateinamen, oder den OK Knopf, wird die ausgew&auml;hlte XMLTV Datei in den Browser geladen.</p>

<p>Wurde die Datenbank &uuml;ber l&auml;ngere Zeit nicht aufgefrischt, kann die Programmliste leer sein. In dem Fall sollten Sie den zur Erstellung der Datei verwendeten EPG Grabber nochmals starten.</p>

<h2 id="Merge-XMLTV-files">Merge XMLTV files</h2>

<p>&Ouml;ffnet einen Dialog, der erlaubt, mehrere Datenbanken in eine zusammenzuf&uuml;hren. Siehe <a href="#MERGED-DATABASES">&quot;MERGED DATABASES&quot;</a> f&uuml;r Details.</p>

<h2 id="Load-Teletext-EPG">Load Teletext EPG</h2>

<p>F&uuml;hrt alle vom Teletext EPG Grabber erzeugten XMLTV Dateien zusammen und zeigt diese an. Welche Programme abgedeckt sind, wird &uuml;ber die Programmwahl in der Teletext Grabber Konfiguration bestimmt. Diese Option ist vorausgew&auml;hlt wenn beim Start keine XMLTV Daten geladen wurden.</p>

<p>Diese Option kann schon ausgew&auml;hlt werden wenn der Teletext Grabber noch keine Daten geladen hat. In dem Fall wird nur das nxtvepg Logo und ein entsprechender Hinweis angezeigt. Sobald Daten von einem Sender geladen wurden, werden diese automatisch angezeigt. W&auml;hrend der Wartezeit k&ouml;nnen Sie den Fortschritt &uuml;ber die im Control Men&uuml; verf&uuml;gbaren &quot;Statistik&quot; Fenster verfolgen.</p>

<p>Diese Option ist &auml;quivalent zum manuellen Zusammenf&uuml;hren der vom Teletext EPG Grabber erzeugten Dateien &uuml;ber &quot;Merge XMLTV files&quot;, wenn in diesem Dialog die Option &quot;Add all Teletext EPG data&quot; gew&auml;hlt wird, au&szlig;er da&szlig; dies nicht m&ouml;glich ist bevor wenigstens eine Datei erzeugt wurde.</p>

<h2 id="Enable-acquisition">Enable acquisition</h2>

<p>Schaltet die Teletext-EPG Datenakquisition tempor&auml;r an oder aus. Diese Option ist nur w&auml;hlbar wenn der Teletext EPG Grabber konfiguriert wurde (siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;Teletext Grabber&quot;) und eine TV-Karte verf&uuml;gbar ist.</p>

<p>Wenn Sie den Browser starten, wird die Akquisition automatisch aktiviert falls die entsprechende Option im Teletext-Grabber Konfigurationsmen&uuml; angw&auml;hlt wurde. Sie k&ouml;nnen den automatischen Start tempor&auml;r unterdr&uuml;cken, indem Sie Befehlszeilenschalter <b>-noacq</b> auf der Kommandozeile angeben. Das Abschalten der Akquisition erlaubt anderen Anwendungen, wie z.B. einer TV-Applikation, die TV-Karte zu nutzen und TV-Kan&auml;le zu wechseln.</p>

<p>Sie werden eine Fehlermeldung erhalten, wenn das Ger&auml;t bereits von einer anderen Anwendung belegt ist. Ebenso erhalten Sie eine Fehlermeldung, wenn Sie keine Berechtigung besitzen auf das Ger&auml;t zuzugreifen (UNIX, siehe auch <a href="#FILES">&quot;FILES&quot;</a>) bzw. den Treiber zu starten (Windows). Bei vermuteten Treiber- oder Empfangsproblemen, testen Sie am Besten zuerst mit einer TV-Anwendung, da diese mit Hilfe des TV-Bilds eine leichtere Fehlerdiagnose erlaubt. Siehe auch <a href="#GETTING-STARTED">&quot;GETTING STARTED&quot;</a>.</p>

<p>UNIX: Wird die Akquisition ausgeschaltet, wird auch das <i>/dev/vbi</i> device freigegeben. Die Akquisition kann auch automatisch an- und ausgeschaltet werden (d.h. von einem Shell-Skript aus) indem man das Signal HUP (z.B. mit dem Befehl kill(1)) an einen der nxtvepg-Prozesse oder -Threads sendet. Sollten Sie einen Daemon zur Akquisition benutzen (siehe n&auml;chster Befehl), m&uuml;ssen Sie das Signal an einen der Daemon-Prozesse/-Threads senden. Um dies zu vereinfachen, wird die &quot;PID&quot; des Prozesses der den Device ge&ouml;ffnet h&auml;lt in <i>/tmp/.vbi.pid</i> gespeichert.</p>

<h2 id="Connect-to-acq.-daemon">Connect to acq. daemon</h2>

<p>Starten oder trennen Sie die Verbindung zwischen dem Browser und einem im Hintergrund laufenden Akquisitions-Daemon. Der Daemon kann auf dem gleichen Host oder sonst wo im lokalen Netzwerk laufen. Die Adresse des Daemons und andere Parameter werden im <i>Client/Server</i>-Men&uuml; konfiguriert (siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;Client/Server&quot;). Standardm&auml;&szlig;ig wird der Daemon lokal gestartet. Der Hauptvorteil des Gebrauchs eines Daemon ist, dass Sie die Akquisition permanent im Hintergrund laufen lassen k&ouml;nnen, auch wenn Sie den Browser (oder auf UNIX den X11-Server, d.h. das &quot;windowing system&quot;) beenden. In M$ Windows wird der Daemon beendet, wenn Sie sich ausloggen.</p>

<p>Wenn Sie versuchen zu verbinden, aber der Daemon l&auml;uft noch nicht, wird Ihnen angeboten den Daemon automatisch zu starten, vorausgesetzt Sie haben den Server-Hostnamen <i>localhost</i> konfiguriert. Der Daemon wird mit denselben Datenbank- und rcfile-Pfaden wie der Browser gestartet.</p>

<p>Zu bemerken ist, dass das Trennen der Verbindung zum Daemon oder das Beenden des Browsers die Akquisition nicht stoppt und infolgedessen das Ger&auml;t nicht freigibt. Ist dies das, was Sie wollen, w&auml;hlen Sie stattdessen den Befehl &quot;<i>Enable acquisition</i>&quot;, welcher den Daemon beendet. Nat&uuml;rlich ist diese Option nur verf&uuml;gbar, wenn Ihr Daemon auf demselben Host und mit derselben Benutzerkennung l&auml;uft wie der Browserprozess.</p>

<h2 id="View-statistics-timescales">View statistics/timescales</h2>

<p>Die folgenden Kommandos &ouml;ffnen Fenster mit Statistiken zu den Programmdaten und dem Fortschritt der Datenakquisition. Siehe auch <a href="#STATISTICS">&quot;STATISTICS&quot;</a> f&uuml;r eine detaillierte Beschreibung der einzelnen Angaben.</p>

<dl>

<dt id="View-coverage-timescales"><b>View coverage timescales</b></dt>
<dd>

<p>Blendet das Zeitskalenfenster f&uuml;r die Browserdatenbank ein und aus. Das Fenster spiegelt f&uuml;r jeden in der gew&auml;hlten Datenbank eingebundenen Sender wieder, welche Zeitspannen mit Programminformationen belegt sind. Arbeitet die Akquisition an der Datenbank, k&ouml;nnen Sie fortlaufend beobachten, wie sich die Datenbank f&uuml;llt. Siehe auch <a href="#STATISTICS">&quot;STATISTICS&quot;</a>, Abschnitt &quot;Timescale popup window&quot;&gt;.</p>

</dd>
<dt id="View-database-statistics"><b>View database statistics</b></dt>
<dd>

<p>Blendet das Statistikfenster f&uuml;r die Browser-Datenbank ein oder aus. Die Statistik gibt Auskunft &uuml;ber die Anzahl der Programmeintr&auml;ge in der Datenbank, den prozentualen F&uuml;llungsgrad, den Prozentsatz der abgelaufenen Eintr&auml;ge, das Datum des letzten Updates usw. L&auml;uft die Akquisition auf der gleichen Datenbank, enth&auml;lt es zus&auml;tzlich Information zu Status und Fortschritt der Akquisition. F&uuml;r Details siehe <a href="#STATISTICS">&quot;STATISTICS&quot;</a>, Abschnitt &quot;Database statistics&quot;&gt;.</p>

</dd>
<dt id="Teletext-Grabber-Statistics1"><b>Teletext Grabber Statistics</b></dt>
<dd>

<p>Blendet das Statistikfenster f&uuml;r den Teletext EPG Grabber ein oder aus. Dieses gibt &uuml;ber Status und Fortschritt der Akquisition Auskunft. Zus&auml;tzlich werden Statistiken &uuml;ber Teletextdatenempfang aus den aktuell eingestellten TV-Programmen angezeigt. F&uuml;r Details siehe <a href="#STATISTICS">&quot;STATISTICS&quot;</a>, Abschnitt &quot;Teletext Grabber statistics&quot;.</p>

</dd>
</dl>

<h2 id="Export-as-text">Export as text</h2>

<p>&Ouml;ffnet einen Dialog, der es erlaubt, alle Programminformationen in einem fixen Textformat in eine Datei zu exportieren. Jede Zeile dieser Datei wird einen Eintrag in der Datenbank repr&auml;sentieren. Die einzelnen Datenfelder der Zeilen sind durch Tabulator-Zeichen getrennt; die Zeile wird durch ein einziges new-line-Zeichen abgeschlossen (d.h. UNIX-Textformat, auch auf Windows). Fehlende Werte werden in einigen F&auml;llen durch <code>\N</code> repr&auml;sentiert, welches den MySQL-NULL-Identifier darstellt (zurzeit nur f&uuml;r das VPS/PDC-Feld verwendet).</p>

<p>Zeilenumbr&uuml;che im Beschreibungstext werden im Export durch &quot;<code> // </code>&quot; ersetzt. In einer zusammengef&uuml;hrten Datenbank wird zwischen aus mehrereren Quellen zusammengesetzten Beschreibungstexten &quot;<code> //%// </code>&quot; eingef&uuml;gt. Diese Ersatzzeichen sollten bei Anzeige der Texte durch Zeilenumbr&uuml;che bzw. eine horizontale Trennlinie ersetzt werden.</p>

<p>Die erzeugte Textdatei kann direkt in eine relationale Datenbank geladen werden. Sie ist nicht f&uuml;r das Betrachten in einem regul&auml;ren Texteditor formatiert. Sender werden entsprechend als numerische Indizes innerhalb Sender- und Thementabelle dargestellt. Deshalb wird die Sendertabelle zus&auml;tzlich zur Programminformationstabelle ben&ouml;tigt. Um sie in eine Datenbank zu laden, m&uuml;ssen Sie sie in unterschiedliche Dateien exportieren.</p>

<p>F&uuml;r <i>MySQL</i> k&ouml;nnen Sie die Tabellen wie folgt definieren:</p>

<pre><code>CREATE TABLE PI (
   netwop smallint(2) unsigned NOT NULL,
   Dstart date NOT NULL,
   Hstart time NOT NULL,
   Hstop time NOT NULL,
   vpspdc_pil datetime,
   parental_rating tinyint(2) unsigned,
   editorial_rating tinyint(2) unsigned,
   editorial_max_val tinyint(2) unsigned,
   sound enum(&quot;none&quot;,&quot;mono&quot;,&quot;2-chan&quot;,&quot;stereo&quot;,&quot;surround&quot;,&quot;dolby&quot;),
   is_wide BOOL,
   no_video BOOL,
   is_video_hd BOOL,
   is_video_bw BOOL,
   is_new BOOL,
   is_premiere BOOL,
   is_repetition BOOL,
   is_last_repetition BOOL,
   subtitles enum(&quot;no&quot;,&quot;yes&quot;,&quot;onscreen&quot;,&quot;deaf-signed&quot;,&quot;onscreen,deaf-signed&quot;),
   theme_0 text,
   theme_1 text,
   theme_2 text,
   theme_3 text,
   theme_4 text,
   theme_5 text,
   theme_6 text,
   theme_7 text,
   title varchar(40) NOT NULL,
   descr text,
   PRIMARY KEY (netwop, Dstart, Hstart)
);

CREATE TABLE AI (
   netwop_idx smallint(2) unsigned NOT NULL,
   cni smallint(5) unsigned,
   lto_mins smallint(5),
   daycount smallint(5) unsigned,
   alphabet smallint(5) unsigned,
   addinfo smallint(5) unsigned,
   name text,
   UNIQUE netwop_idx (netwop_idx)
);

CREATE TABLE themes (
   theme_idx smallint(3) unsigned NOT NULL,
   category_name text,
   UNIQUE theme_idx (theme_idx)
);</code></pre>

<p><b>Tipp:</b> Die Dateien k&ouml;nnen auch direkt &uuml;ber die Befehlszeile mittels der Schalter <b>-dump pi</b>, <b>-dump ai</b> bzw. <b>-dump themes</b> geschrieben werden. (Siehe auch <a href="#OPTIONS">&quot;OPTIONS&quot;</a>)</p>

<h2 id="Export-as-XMLTV">Export as XMLTV</h2>

<p>&Ouml;ffnet einen Dialog, der es erlaubt, alle Programminformationen im XML-Format zu exportieren. Das Format ist durch die <b>XmlTV DTD</b> genau festgelegt (siehe <a href="http://xmltv.org/">http://xmltv.org/</a>.) Die erzeugte Datei enth&auml;lt sowohl die Sendertabelle als auch die Programmdaten. Sie umfasst auch Sender, die Sie m&ouml;glicherweise in der Auflistung innerhalb nxtvepg abgestellt haben.</p>

<p><b>Tipp:</b> Sie k&ouml;nnen die Menge der exportierten Daten einschr&auml;nken indem Sie eine zusammengef&uuml;hrte Datenbank konfigurieren. Dies ist auch f&uuml;r einen einzelnen Provider m&ouml;glich. Auf diese Weise k&ouml;nnen Sie bestimmte Sender oder Attribute ausschlie&szlig;en, z.B. um Themen-Kategorien von der Ausgabe auszuschlie&szlig;en (siehe Untermen&uuml; <i>Configure</i> im Dialog der Merge-Konfiguration). Siehe auch unten f&uuml;r Alternativen beim Export &uuml;ber die Komandozeile.</p>

<p>Einige TV-Anwendungen sind daf&uuml;r bekannt, XMLTV-Zeitstempel nicht korrekt auszuwerten. Um diese Probleme zu umgehen gibt es eine Option, die erlaubt, Datumsangaben und Uhrzeiten in lokaler Zeit anstatt UTC (auch bekannt als <i>Greenwich Mean Time</i> oder GMT) zu exportieren. Erscheinen alle Programmdaten um eine oder zwei Stunden verschoben in Ihrer TV-Anwendung, versuchen Sie es mit dieser Option.</p>

<p><b>Tipp:</b> Die Datenbank kann auch direkt &uuml;ber die Befehlszeile mittels des Schalters <b>-dump xml</b> exportiert werden. Dabei k&ouml;nnen sie auch eine oder mehrere <b>-epgquery</b> Optionen anf&uuml;gen um den Export auf ausgew&auml;hlte Sender oder Programme einzuschr&auml;nken (f&uuml;r Details siehe <a href="#OPTIONS">&quot;OPTIONS&quot;</a>)</p>

<h2 id="Export-as-HTML">Export as HTML</h2>

<p>&Ouml;ffnet einen Dialog, der erlaubt, die komplette Datenbank oder markierte Sendungen in eine Datei im HTML-Format (Hypertext Markup Language) zu exportieren. Die Datei kann dann in einen WWW-Browser geladen werden, z.B. <i>Mozilla</i> oder <i>Opera</i>. Dies ist insbesondere n&uuml;tzlich, wenn Sie Ihre TV-Beschreibungen ausdrucken wollen.</p>

<p>Oben im Dialogfenster m&uuml;ssen Sie den Namen der Ausgabedatei eingeben; wenn Sie Ihr keine Erweiterung geben, wird automatisch ein <i>.html</i> angeh&auml;ngt. Klicken Sie auf den kleinen Verzeichnisauswahlknopf rechts daneben, um einen Dialog zur Dateiauswahl zu &ouml;ffnen. Dr&uuml;cken Sie den Button <i>Export</i>, um das HTML-Dokument zu erstellen und <i>Dismiss</i>, um das Dialogfenster zu schlie&szlig;en.</p>

<p>Standardm&auml;&szlig;ig ist die Checkbox &quot;<i>All matching programmes, but max ...</i>&quot; aktiviert. In diesem Modus werden alle Sendungen exportiert, die auf die aktuellen Filter-Einstellungen zutreffen, jedoch nur bis zur angegebenen Maximalzahl an Sendungen. Es wird empfohlen die Zahl der Sendungen immer zu beschr&auml;nken, da sonst sehr gro&szlig;e HTML-Dokumente erzeugt werden, was zu einer langen Ladezeit in Ihrem Web-Browser f&uuml;hren kann.</p>

<p>Verwenden Sie den Modus &quot;<i>Selected programme only</i>&quot;, um nur die Sendung zu exportieren, die aktuell im Hauptfenster des Browsers markiert ist. In Kombination mit dem Modus <i>Append to file</i> erlaubt dies Schritt-f&uuml;r-Schritt ein Dokument mit genau den Sendungen zu erstellen, die Sie interessieren.</p>

<p>Im Feld darunter befinden sich drei Auswahlkn&ouml;pfe, mit denen Sie das Ausgabeformat ausw&auml;hlen k&ouml;nnen. Wenn Sie <i>Write titles</i> w&auml;hlen, erhalten Sie eine Tabelle in derselben Konfiguration wie in der Programmtitelliste des Hauptfensters. Wollen Sie andere Spaltentypen haben, k&ouml;nnen Sie eine separate Spalten-Konfiguration mittels der Auswahl von &quot;<i>Different columns than main window</i>&quot; und dem Dr&uuml;cken des Buttons <i>Configure</i> zur Wahl des anzuzeigenden Spaltentyps erstellen.</p>

<p>Wenn Sie &quot;<i>Write descriptions</i>&quot; w&auml;hlen, werden Sie f&uuml;r jede exportierte Sendung eine Feature&uuml;bersicht und -beschreibung erhalten, &auml;hnlich der Info im unteren Teil des Hauptfensters.</p>

<p>Wenn Sie &quot;<i>Write titles and descriptions</i>&quot; w&auml;hlen, enth&auml;lt das HTML-Dokument zuerst eine tabellarische Titel&uuml;bersicht und darunter die zugeh&ouml;rigen Beschreibungen. In diesem Modus k&ouml;nnen Sie &quot;<i>Add hyperlinks to titles</i>&quot; ausw&auml;hlen, um Hyperlinks von den Titeln in der Tabelle zu den entsprechenden Beschreibungen hinzuzuf&uuml;gen.</p>

<p>Das Aussehen des erzeugten Dokuments wird durch ein internes CSS-Stylesheet festgelegt. M&ouml;gen Sie dieses Aussehen nicht, k&ouml;nnen Sie es mit einem eigenen Stylesheet &uuml;berschreiben. Speichern Sie dieses in eine Datei mit Namen <i>nxtvhtml.css</i> und legen Sie diese in dasselbe Verzeichnis wie die generierte HTML-Datei. Siehe <a href="http://www.w3.org/">http://www.w3.org/</a> f&uuml;r mehr Informationen zu HTML und Stylesheets. Wenn Ihre Spalten-Konfiguration Bilder enth&auml;lt (siehe <a href="#COMPOSITE-ATTRIBUTES">&quot;COMPOSITE ATTRIBUTES&quot;</a>), m&uuml;ssen Sie diese in ein Unterverzeichnis namens <i>images</i> legen; des Weiteren sollte Ihr Web-Browser das Bildformat <b>PNG</b> unterst&uuml;tzen.</p>

<p><b>Tipp:</b> Die HTML Datei kann auch direkt &uuml;ber die Befehlszeile mittels des Schalters <b>-dump html</b> erzeugt werden. In dem Fall k&ouml;nnen sie die Zahl der geschriebenen Sendungen durch Anh&auml;ngen von &quot;:&quot; und einer Zahl angeben (z.B. &quot;-dump html:50&quot; f&uuml;r den Export von 50 Programmen.) Weiterhin k&ouml;nnen Sie eine oder mehrere <b>-epgquery</b> Optionen anf&uuml;gen um den Export auf ausgew&auml;hlte Sender oder Programme einzuschr&auml;nken (f&uuml;r Details siehe <a href="#OPTIONS">&quot;OPTIONS&quot;</a>)</p>

<h2 id="Quit">Quit</h2>

<p>Schlie&szlig;t alle Fenster und beendet die Anwendung. Wurde die Akquisition als Daemon gestartet, wird dieser nicht beendet (siehe <a href="#CONTROL-MENU:-Connect-to-acq.-daemon">&quot;CONTROL MENU: Connect to acq. daemon&quot;</a>).</p>

<h1 id="CONFIGURE-MENU">CONFIGURE MENU</h1>

<p>&Uuml;bersicht der im Configure-Men&uuml; verf&uuml;gbaren Befehle:</p>

<h2 id="Teletext-Grabber">Teletext Grabber</h2>

<p>&Ouml;ffnet einen Dialog, mit dem der Teletext EPG Grabber eingeschaltet und konfiguriert werden kann. Eine Einf&uuml;hrung zur Funktionsweise und Verwendung des Grabbers findet sich in Kapitel <a href="#TELETEXT-EPG-GRABBER">&quot;TELETEXT EPG GRABBER&quot;</a>.</p>

<p>Der oberste Knopf <i>Enable teletext grabber</i> im Dialogfenster schaltet den Teletext EPG Akquisition global ein oder aus. Die anderen Elemente des Dialogs sind nur bedienbar wenn dieser Knopf aktiviert ist.</p>

<p>Wenn der Knopf <i>Start acquisition automatically</i> aktiviert ist, startet die Teletext EPG Akquisition automatisch sobald der Dialog mittels &quot;Ok&quot; geschlossen wird als auch bei jedem Neustart von nxtvepg. Wenn die Option nicht aktiviert ist, kann die EPG Akquisition jederzeit manuell &uuml;ber den Befehl <i>Enable acquisition</i> im <a href="#CONTROL">&quot;CONTROL&quot;</a> Men&uuml; gestartet werden.</p>

<p>Im unter den beiden Kn&ouml;pfen befindlichen Rahmen &quot;Teletext options&quot; befinden folgende Optionen:</p>

<dl>

<dt id="Number-of-TV-channels-to-grab"><i>Number of TV channels to grab</i></dt>
<dd>

<p>Dies ist die wichtigste Option in dieser Sektion, da hier festgelegt wird von welchen TV-Sendern der Grabber Teletext empfangen und in die Anzeige geladen wird. Der Wert im Eingabefeld w&auml;hlt daf&uuml;r die Anzahl der Sender ab dem Beginn der konfigurierten TV-Kanalliste aus (siehe unten; Radiosender werden dabei nicht mitgez&auml;hlt).</p>

<p>Sie sollten den Wert von der Voreinstellung von 100 Sendern auf die Zahl der f&uuml;r Sie interessanten Sender reduzieren. Dies setzt jedoch voraus, dass Sie die TV-Kanalliste so sortiert haben, dass interessante Sender am Anfang stehen. Andernfalls kann es sein dass sie den Wert erh&ouml;hen m&uuml;ssen; dies wird jedoch die vom Grabber ben&ouml;tigte Ladezeit erh&ouml;hen.</p>

<p>F&uuml;r TV-Sender die keinen Teletext ausstrahlen wird der Grabber keine XMLTV Dateien erzeugen. Der Grabber ist nicht in der Lage den Zusammenhang zwischen den Normal- und HD-Versionen der TV-Sender zu erkennen, daher werden EPG Daten doppelt angelegt falls beide Versionen im ausgew&auml;hlten Bereich der Kanalliste liegen.</p>

</dd>
<dt id="Capture-page-range"><i>Capture page range</i></dt>
<dd>

<p>Diese Option legt fest, welche Seiten aus dem Teletext geladen werden. Der Grabber wird auf diesen Seiten nach TV-Programm&uuml;bersichtstabellen suchen. Um die Wahrscheinlichkeit von Fehldetektion zu reduzieren empfiehlt es sich den Bereich auf das n&ouml;tigste einzuschr&auml;nken. Aktuell k&auml;&szlig;t sich die Einstellung jedoch nur global f&uuml;r alle Sender vornehmen, so da&szlig; der Bereich so gew&auml;hlt werden mu&szlig; dass er f&uuml;r Programm&uuml;bersicht verwendete Teletextseiten aller TV-Sender einschlie&szlig;t.</p>

</dd>
<dt id="Capture-duration"><i>Capture duration</i></dt>
<dd>

<p>Diese Option legt die Zeit in Sekunden fest f&uuml;r die Teletext von jedem ausgew&auml;hlten TV-Sender geladen wird (bzw. f&uuml;r jeden Transponder bei DVB). Zu beachten ist, dass fast alle TV-Sender Mehrfachseiten f&uuml;r die Programm&uuml;bersicht verwenden, so dass mehrere Seitenzyklen ben&ouml;tigt werden um alle ben&ouml;tigten &quot;Unterseiten&quot; zu laden. Der voreingestellte Wert von 120 Sekunden ist f&uuml;r TV-Sender die z.B. 8 Unterseiten verwenden schon an der unteren Grenze. Falls Sie L&uuml;cken in den Programminformationen solcher Sender bemerken, sollten Sie die Einstellung hier erh&ouml;hen.</p>

</dd>
<dt id="Keep-expired-programmes"><i>Keep expired programmes</i></dt>
<dd>

<p>Diese Option legt fest, wie lange nach Ende einer TV-Sender die Programminformationen aus der XMLTV Datei gel&ouml;scht werden. Diese L&ouml;schung erfolgt automatisch bei jeder Aktualisierung, damit die Dateigr&ouml;&szlig;e nicht ins unendliche w&auml;chst. Siehe auch Abschnitt &quot;Expired Programmes Display&quot; im Kapitel <a href="#FILTERING">&quot;FILTERING&quot;</a> dazu wie man abgelaufene Programminformationen noch einsehen kann.</p>

</dd>
</dl>

<p>Im zweiten Rahmen des Konfigurationsdialogs wird festgelegt von wo die TV-Kanalliste geladen wird. Der Teletext Grabber ben&ouml;tigt diese um die Namen und Frequenzen der zu bearbeitenden Sender zu ermitteln um von dort Teletext zu empfangen. nxtvepg selber erm&ouml;glicht nicht eine solche Tabelle anzulegen, da davon ausgegangen wird dass Sie bereits eine solche Liste in einer TV-Applikation erstellt haben. Daher wird hier die M&ouml;glichkeit geboten, diese wiederzuverwenden.</p>

<p>nxtvepg kann die Kanallisten der gebr&auml;uchlichsten TV-Applikationen lesen. Nach Auswahl einer TV-Applikation aus dem Men&uuml; wird nxtvepg versuchen die Kanaltabellendatei automatisch zu finden. Falls der Pfad nicht im Eingabefeld unterhalb des Auswahlmen&uuml;s erscheint, klicken Sie bitte auf das Verzeichnissymbol neben dem Eingabefeld und geben Sie den Pfad manuell an (bei DVB hei&szlig;t diese Datei meist <code>channels.conf</code>). Danach kann der <i>Test</i> Knopf verwendet werden um zu pr&uuml;fen ob nxtvepg die Kanaltabelle aus der Datei auslesen kann. Falls Sie Ihre TV-Applikation nicht in der Liste finden, k&ouml;nnen Sie versuchen die Kanallistendatei mit einer anderen TV-Applikationseinstellung zu laden. (F&uuml;r Linux k&ouml;nnen Sie zur Not das externe Tool <i>w_scan</i> verwenden um eine neue Kanalliste im VDR oder mplayer Format zu erzeugen.)</p>

<p>Im dritten Rahmen <i>Acquisition mode</i> kann eine Strategie f&uuml;r Akquisition von EPG Daten ausgew&auml;hlt werden. Die hier angebotenen Optionen sind im Abschnitt &quot;Acquisition modes&quot; im Kapitel <a href="#TELETEXT-EPG-GRABBER">&quot;TELETEXT EPG GRABBER&quot;</a> beschrieben.</p>

<p>Mit dem untersten Knopf <i>Keep teletext raw capture data</i> des Dialogfensters kann eingestellt werden dass der Grabber die empfangenen Teletextseiten in einer Datei mit Endung &quot;.dat&quot; neben den normalerweise erzeugten &quot;.xml&quot; Dateien abspeichert (siehe auch Kapitel <a href="#FILES">&quot;FILES&quot;</a>). Die Dateien enthalten die rohen Teletextdaten in unverarbeiteter Form. Die Dateien sind in Textform und k&ouml;nnen mit jedem Texteditor ge&ouml;ffnet werden. Der Seiteninhalt ist i.d.R. erkennbar, wenn auch mit Sonderzeichen durchsetzt, da etwa Umlaute und Farbkodierung in Teletext speziell kodiert sind.</p>

<p>Diese Dateien k&ouml;nnen benutzt werden um Fehler bei der Extraktion von EPG zu analysieren. Die Verbindung zwischen Programminformationen in der XMLTV Datei kann &uuml;ber in Kommentaren innerhalb der &quot;&lt;programme&gt;&quot; Tags hergestellt werden: Der Kommentar oberhalb des Programmtitels gibt die Teletextseite an auf der die Programm&uuml;bersicht gefunden wurde. Der Kommentar oberhalb des Beschribungstext die Zusatzseite der diese Information entstammt. Zum Debuggen der Extraktion sollte am besten die auf der nxtvepg Homepage erh&auml;ltliche Kommandozeilenversion des Grabbers <i>tv_grab_ttx</i> verwendet werden. Die Datei kann mit folgendem Kommando geladen werden: <code>tv_grab_ttx -debug -verify FILENAME.dat</code>.</p>

<h2 id="TV-channel-scan">TV channel scan</h2>

<p>&Ouml;ffnet einen Dialog mit dem alle TV-Kan&auml;le auf Teletext&uuml;bertragung gepr&uuml;ft werden k&ouml;nnen. Der Scan kann auch daf&uuml;r verwendet werden den Empfang aller TV-Kan&auml;le zu pr&uuml;fen. Die Ergebnisse des Scans sind nur zu Ihrer Information und werden innerhalb nxtvepg nicht weiterverwendet.</p>

<p>Bevor Sie den Scan starten, sollten Sie die TV-Karte und eine TV-Kanaltabelle konfigurieren. Die dazu notwendigen beiden Konfigurationsdialoge k&ouml;nnen Sie direkt &uuml;ber die beiden Kn&ouml;pfe in der unteren rechten Ecke des Dialogfensters erreichen. Beachten Sie da&szlig; f&uuml;r den Betrieb des Scan der interne TV-Tuner als Video-Input eingestellt werden mu&szlig;. (Siehe dazu auch Kapitel <a href="#GETTING-STARTED">&quot;GETTING STARTED&quot;</a>.)</p>

<p>F&uuml;r alte analoge TV-Karten unterst&uuml;tzt der Scan noch einen Frequenzbandmodus der &uuml;ber die <i>Channel table</i> Optionskn&ouml;pfe &quot;Western Europe&quot; (PAL) bzw. &quot;France&quot; (SECAM) angew&auml;hlt wird. In diesem Modus wird in allen in der gew&auml;hlten Zone definierten TV-Frequenzb&auml;ndern nach TV-Signalen gesucht; f&uuml;r jede Frequenz auf der ein Signal detektiert wurde wird dann versucht den Kanal mittels VPS/PDC und Teletext zu identifizieren; das Ergebnis wird im Mitteilungsfenster ausgegeben. Diese Prozedur entspricht dem initialen Kanalsuchlauf auf fr&uuml;heren analogen Fernsehern. F&uuml;r nxtvepg ist dieser Modus nicht mehr sinnvoll, da die Ergebnisse nicht verwendet werden k&ouml;nnen.</p>

<p>Daher sollten die die Option <i>Load from TV app</i> einschalten und dann den <i>Start scan</i> Knopf dr&uuml;cken. Falls der Teletext EPG grabber aktiv ist, wird dieser f&uuml;r die Zeit des Scans suspendiert und danach neu gestarted. In diesem auf Kanaltabelle basierendem Modus untersucht der Scan nur genau die in der TV-Kanaltabelle aufgef&uuml;hrten TV-Frequenzen. F&uuml;r jeden dieser Kan&auml;le wird versucht Teletext und VPS/PDC zu empfangen und das Ergebnis mit Mitteilungsfenster ausgegeben. F&uuml;r DVB TV-Karten wird zuerst noch die &quot;PID&quot; des Teletextdatenstroms ermittelt; ist keine im Transponderverzeichnis angegeben, strahlt dieser Sender definitiv kein Teletext aus. Bei DVB k&ouml;nnen Ergebnisse in nicht aufsteigender Reihenfolge erscheinen, da der Scan Kan&auml;le die auf derselben Transponderfrequenz liegen zusammenfa&szlig;t um den Scan zu beschleunigen. Am Ende des Scans erscheint noch eine Zusammenfassung mit der Zahl der gefundenen Sender mit Teletext.</p>

<p>Setzen Sie ein H&auml;kchen an der Checkbox <i>Slow</i>, wenn Sie auf manchen Kan&auml;len einen schlechten Empfang haben. Im Slow-Modus wird der Suchlauf Kan&auml;le mit &quot;instabilem&quot; Videosignal nicht &uuml;berspringen (d.h. kein PLL H-lock innerhalb 150 Millisekunden) und auf alles doppelt so lange als sonst warten, d.h. bis zu 12 Sekunden auf eine VPS/PDC Kanalidentifikation. Zu bemerken ist, dass Sie die Einstellung &quot;Slow&quot; auch w&auml;hrend des Suchlaufs &auml;ndern k&ouml;nnen.</p>

<h2 id="TV-card-input">TV card input</h2>

<p>&Ouml;ffnet einen Dialog, in dem die Parameter der Hardware der TV-Karte konfiguriert werden k&ouml;nnen.</p>

<p>Im oberen Teil des Dialogfensters wird die TV-Karte ausgew&auml;hlt. Zuerst sollte &uuml;ber die Kn&ouml;pfe ein Kartentyp ausgew&auml;hlt werden: Digital TV steht f&uuml;r DVB Karten (die die aktuellen &Uuml;bertragungsstandards), Analog TV f&uuml;r PAL/SECAM (d.h. die &auml;lteren, in Europa nicht mehr f&uuml;r TV verwendeten &Uuml;bertragungsstandards). Nach der Auswahl wird der vom Treiber identifizierte Name der TV-Karte oberhalb angezeigt.</p>

<p>Haben Sie mehr als eine TV-Tunerkarte in Ihrem Rechner, k&ouml;nnen Sie w&auml;hlen, welche Sie nutzen wollen. Dieselbe Auswahl wird &uuml;ber die Befehlszeilenoption <b>-card</b> getroffen (siehe <a href="#OPTIONS">&quot;OPTIONS&quot;</a>). Das Popupmen&uuml; wird Ihnen alle Kartentypen - wie im Treiber konfiguriert - auflisten. Zu bemerken ist, dass sich das &Auml;ndern der Karte ebenso auf die folgende Input-Wahl auswirken wird, insbesondere wenn die Karten unterschiedliche Sortierreihenfolgen der Input-Typen besitzen.</p>

<p>Die Auswahl <i>Video source</i> erlaubt die Wahl der Quelle des Video-Inputs, d.h. wo Sie ein Kabel f&uuml;r den Video-Eingang mit Ihrer TV-Karte verbunden haben. Die Anschlu&szlig;bezeichnungen werden vom Treiber Ihrer TV-Karte bestimmt, daher k&ouml;nnen die Begriffe variieren: <i>Tuner</i> oder <i>Television</i> verweist auf einen Eingang via Antennenkabel (d.h. terrestrischer Empfang, Satellit oder Kabel-TV); <i>Composite</i> verweist auf ein Cinch-Video-Kabel, wie es von externen Satelliten-Receivern oder billigen Video-Rekordern verwendet wird; <i>S-Video</i> ist eine Variante von Composite mit besserer Bildqualit&auml;t (oft f&auml;lschlich S-VHS-Kabel genannt, weil es meistens von S-VHS-Recordern verwendet wird) und leicht zu erkennen an den Sub-D-Anschl&uuml;ssen (in deutsch &quot;Hosidenstecker&quot; genannt). Abh&auml;ngig von Ihrer Hardware werden Sie nur eine Teilmenge dieser Input-Typen sehen oder zus&auml;tzliche (z.B. <i>Radio</i>, welches jedoch nicht als Input f&uuml;r nxtvepg brauchbar ist).</p>

<p>Zu beachten ist, dass wenn nicht der TV-Tuner als Eingabe gew&auml;hlt wird, nxtvepg nicht automatisch auf den Sender Ihres EPG-Anbieters umschalten kann. Siehe auch <a href="#TELETEXT-EPG-GRABBER">&quot;TELETEXT EPG GRABBER&quot;</a>.</p>

<p>Die Option &quot;<i>Slicer Quality</i>&quot; w&auml;hlt zwischen verschiedenen Algorithmen aus, mit denen der Teletext aus dem analogen Videosignal extrahiert wird. Der Algorithmus <i>simple</i> funktioniert nur bei ausgezeichnetem TV-Empfang, hat jedoch den Vorteil, sehr wenig CPU-Ressourcen zu verbrauchen. Der Algorithmus <i>elaborate</i> (aus Zappings libzvbi zapping.sourceforge.net und urspr&uuml;nglich f&uuml;r den Linux-Teletextviewer <i>alevt</i> entwickelt) ist wesentlich fehlertoleranter. Wenn Sie <i>automatic</i> w&auml;hlen, wird die Akquisition immer mit dem einfachen Algorithmus starten, jedoch auf den aufwendigeren umschalten, wenn die Fehlerrate bestimmte Grenzwerte &uuml;bersteigt (siehe auch <a href="#STATISTICS:-Teletext-Grabber-Statistics">&quot;STATISTICS: Teletext Grabber Statistics&quot;</a>).</p>

<p><b>Nur Windows:</b> Sollten Sie Datenverlust w&auml;hrend hoher Systemauslastung feststellen, k&ouml;nnen Sie die Priorit&auml;t des Akquisitions-Threads erh&ouml;hen (dies kann in einigen Windows-Versionen spezielle Privilegien erfordern). Standard ist <i>normal</i>, d.h. die gleiche wie f&uuml;r alle Benutzeranwendungen.</p>

<h2 id="Client-Server">Client/Server</h2>

<p>&Ouml;ffnet einen Dialog, der die Konfiguration der Verbindung zwischen Browser und einem Akquisitions-Daemon erlaubt (d.h. eine separate Instanz von nxtvepg, die im Server-Modus l&auml;uft, siehe Befehlszeilenschalter <i>-daemon</i> in <a href="#OPTIONS">&quot;OPTIONS&quot;</a>). Der Daemon erlaubt es, alle neu erhaltenen EPG-Daten an einen oder mehrere verbundenen Browser weiterzuleiten und deren Akquisitions-Fortschritt zu beobachten.</p>

<p>Der Dialog enth&auml;lt Einstellungen, von denen sich manche nur auf die Serverseite, manche nur auf die Clientseite und manche auf beide Parteien beziehen. Um Klarheit zu schaffen, gibt es die drei Radiobuttons am oberen Rand des Fenster: Damit k&ouml;nnen Sie die sich nicht auf Client bzw. Server beziehenden Parameter ausgrauen. Beachten Sie: damit eine Server-Konfiguration aktiv wird, muss der Daemon neu gestartet werden. L&auml;uft dieser lokal, k&ouml;nnen Sie dies &uuml;ber das Control-Men&uuml; erledigen (siehe <a href="#CONTROL-MENU:-Connect-to-acq.-daemon">&quot;CONTROL MENU: Connect to acq. daemon&quot;</a>).</p>

<dl>

<dt id="Enable-remote-control"><i>Enable remote control</i></dt>
<dd>

<p>Achtung: Dieses Feature ist noch nicht implementiert. Durch das Aktivieren der Fernbedienung (remote-control) k&ouml;nnen Sie die Akquisition stoppen oder den Akquisitionsmodus, die Parameter der TV-Karte oder irgendwelche anderen, in diesem Dialog konfigurierten Parameter, in einem laufenden Daemon &uuml;ber eine Netzwerkverbindung &auml;ndern.</p>

</dd>
<dt id="Enable-TCP-IP"><i>Enable TCP/IP</i></dt>
<dd>

<p>Wenn Sie Verbindungen &uuml;ber das TCP/IP-Netzwerk-Protokoll erlauben, erm&ouml;glichen Sie Verbindungen von bzw. zu anderen Rechnern im Netzwerk. Da es in nxtvepg momentan keinerlei Zugriffskontrolle gibt, k&ouml;nnen sich diese Hosts an beliebiger Stelle innerhalb des Netzwerks befinden oder sonst wo in der Welt, w&auml;hrend Sie mit dem Internet verbunden sind. Falls Sie keine Firewall besitzen, der eingehende Verbindungen von nicht-vertrauensw&uuml;rdigen Hosts abwehrt, ist dieser Modus &auml;u&szlig;erst gef&auml;hrlich, da nxtvepg nicht gegen b&ouml;swillige Client-Verbindungen abgesichert ist.</p>

<p>Bemerkung: Auf Windows wird derzeit nur TCP/IP unterst&uuml;tzt, d.h. diese Option muss aktiviert sein, um den Daemon starten zu k&ouml;nnen.</p>

</dd>
<dt id="Server-hostname"><i>Server hostname</i></dt>
<dd>

<p>Nur Client-Seite: diese Einstellung identifiziert den Host, auf dem der Daemon l&auml;uft. Sie k&ouml;nnen entweder den Hostnamen im Format dot.com oder eine IP-Adresse im Format 127.0.0.1 eingeben. Wenn Sie ihn auf <i>localhost</i> setzen, wird automatisch eine Verbindung via UNIX-Domain-Sockets etabliert (d.h. pipes), da diese effizienter sind als TCP/IP. Den Automatismus k&ouml;nnen Sie umgehen, indem Sie als Hostnamen den Namen ihres lokalen Host angeben.</p>

</dd>
<dt id="Server-TCP-port"><i>Server TCP port</i></dt>
<dd>

<p>Ist TCP/IP aktiviert, sagt diese Einstellung Server und Client, welcher Port genutzt werden soll. Sie k&ouml;nnen hier irgendeine Nummer zwischen 1024 und 65535 verwenden, jedoch sollten Sie sich vergewissern, dass kein anderer Server den gleichen Port verwendet. Stellen Sie sicher, dass Sie f&uuml;r Client und Server die gleiche Port-Nummer konfigurieren. Vorgabe ist 7658.</p>

</dd>
<dt id="Bind-IP-address"><i>Bind IP address</i></dt>
<dd>

<p>Ist TCP/IP aktiviert und der Host Ihres Servers besitzt mehr als eine IP-Adresse, k&ouml;nnen Sie hier w&auml;hlen, auf welcher nach eingehenden Verbindungen gelauscht wird. Vergewissern Sie sich, dass Sie auf der Client-Seite dieselbe IP-Adresse als Namen des Serverhosts verwenden oder einen Hostnamen, der nach dieser IP-Adresse aufl&ouml;st. Diese Einstellung ist optional; wenn Sie das Feld leer lassen (Standard), wird der Server an allen IP-Adressen Verbindung aufnehmen.</p>

<p>Beachten Sie: auf Systemen die dies unterst&uuml;tzen, werden TCP/IP-Sockets standardm&auml;&szlig;ig in der IPv6-Domain (<i>PF_INET6</i>) erzeugt. Auf einigen Systemen (z.B. NetBSD) k&ouml;nnen Sie keine Verbindung via IPv4 mit einem IPv6-Server und umgekehrt aufnehmen, d.h. Sie m&uuml;ssen an beiden Enden dieselbe Domain verwenden. Unterst&uuml;tzt Ihr Client nur IPv4, k&ouml;nnen Sie Ihren Server zwingen, durch eine Anbindung an eine IPv4-Adresse einen IPv4-Socket zu erzeugen. Schl&auml;gt die Verbindung mit einem lokalen IPv6-Server &uuml;ber die IPv4-Loopback-Adresse 127.0.0.1 fehl, verwenden Sie das &Auml;quivalent &quot;::1&quot;.</p>

</dd>
<dt id="Max.-connections"><i>Max. connections</i></dt>
<dd>

<p>Diese Einstellung limitiert die Anzahl von Client-Verbindungen, die der Server erlauben wird. Ist das Limit erreicht, wird der Server keine neuen Verbindungen mehr annehmen.</p>

</dd>
<dt id="Log-filename"><i>Log filename</i></dt>
<dd>

<p>Wenn Sie das Generieren einer Protokolldatei (Log) durch folgende Option aktivieren, k&ouml;nnen Sie hier w&auml;hlen, wohin das Log geschrieben werden soll. Stellen Sie sicher, dass die Datei von der Benutzerkennung, unter welcher der Daemon-Prozess l&auml;uft, beschreibbar ist. Die Datei wird jedes Mal neu ge&ouml;ffnet, wenn eine Logzeile angeh&auml;ngt wird (&uuml;blicherweise flie&szlig;t sehr wenig Traffic in diese Datei). Dadurch k&ouml;nnen Sie die Datei modifizieren oder l&ouml;schen ohne den Daemon neu zu starten.</p>

</dd>
<dt id="File-min.-log-level"><i>File min. log level</i></dt>
<dd>

<p>Hier k&ouml;nnen Sie w&auml;hlen, ob Log-Informationen in eine Datei geschrieben werden sollen. Wenn Sie nxtvepg mit deaktiviertem TCP/IP laufen lassen, besteht f&uuml;r Sie kein Bedarf, Logging zu verwenden; wenn Sie jedoch Remote-Verbindungen erlauben, sollten Sie Log-Dateien im &quot;info&quot;-Level halten, um &uuml;berpr&uuml;fen zu k&ouml;nnen, welche Hosts mit dem Server Verbindung aufnehmen.</p>

<p>Folgende Einstellungen stehen zur Verf&uuml;gung: &quot;<i>no logging</i>&quot; deaktiviert das Logging; &quot;<i>error</i>&quot; aktiviert das Logging von internen Fehlern, die zu einem unmittelbaren Beenden des Daemon f&uuml;hren k&ouml;nnen; &quot;<i>warning</i>&quot; aktiviert zus&auml;tzlich das Logging von unerwarteten Ereignissen, d.h. von internen Fehlern, die nicht zum Beenden f&uuml;hren; &quot;<i>notice</i>&quot; aktiviert zus&auml;tzlich das Logging von &Auml;nderungen des Serverstatus, d.h. Start und Shutdown; &quot;<i>info</i>&quot; aktiviert zus&auml;tzlich das Logging des Etablierens von Verbindungen und deren Shutdown.</p>

</dd>
<dt id="Syslog-min.-level"><i>Syslog min. level</i></dt>
<dd>

<p>Hier k&ouml;nnen Sie Logging nach UNIX syslog und das Windows-Logging von Anwendungsereignissen aktivieren oder deaktivieren (der Anwendungsname ist <i>nxtvepg daemon</i>; dieses Feature wird von Windows 95 nicht unterst&uuml;tzt). Sehen Sie in den UNIX man pages nach <i>syslogd(8)</i> und <i>syslog.conf(5)</i> oder unter Windows in der Hilfe zur Ereignisanzeige nach Details &uuml;ber die M&ouml;glichkeiten des Ereignisprotokolls. Die Log-Levels, die Sie hier w&auml;hlen k&ouml;nnen, sind dieselben wie sie im vorherigen Abschnitt &uuml;ber das Logging nach Dateien beschrieben wurden.</p>

</dd>
</dl>

<p>Es sei erneut darauf hingewiesen, dass sich Konfigurations&auml;nderungen auf Serverseite erst nach einem Neustart auswirken. Wenn Sie dieselbe rc/ini-Datei f&uuml;r Daemon und GUI verwenden, werden die ge&auml;nderten Einstellungen vom Daemon nach dem n&auml;chsten Start automatisch benutzt.</p>

<h2 id="TV-application-interaction">TV application interaction</h2>

<p>&Ouml;ffnet einen Dialog, der es erlaubt, die Interaktion zwischen TV-Anwendungen und nxtvepg zu konfigurieren. Sie sollten hier zumindest Ihren TV-Anwendungstyp und -pfad konfigurieren, wenn Sie eine der unterst&uuml;tzten Anwendungen verwenden. Dies ist ein w&auml;hrend der anf&auml;nglichen Installation empfohlener Schritt, um den EPG-Provider-Suchlauf zu beschleunigen, wie in <a href="#GETTING-STARTED">&quot;GETTING STARTED&quot;</a> beschrieben.</p>

<p>Die ersten vier Optionen (nur drei unter UNIX) erlauben es Ihnen, die Interaktionsfeatures an- oder auszuschalten. Wollen Sie die Startgeschwindigkeit unter UNIX verbessern, k&ouml;nnen Sie alle abstellen; in diesem Fall braucht nxtvepg nicht nach dem <i>xawtv</i>-Toplevelfenster zu suchen (was bis zu mehreren Sekunden dauern kann, wenn Sie viele Anwendungen am Laufen oder eine langsame Verbindung zu Ihrem X-Server haben). Standardm&auml;&szlig;ig sind alle Interaktionsfeatures aktiviert.</p>

<dl>

<dt id="General-enable"><i>General enable</i></dt>
<dd>

<p>Nur Windows: die Option erlaubt es, die Zuordnung der Kommunikations-Ressourcen zu aktivieren und wieder zu deaktivieren und implizit alle Interaktions-Features ab- oder anzuschalten. W&auml;hrend sie deaktiviert ist, wird nxtvepg f&uuml;r die TV-Anwendung unsichtbar sein. Die Verwendung dieser Option ist nicht empfohlen, da nxtvepg den Treiber nicht automatisch freigeben wird, wenn die TV-Anwendung gestartet wird und nxtvepg nicht in der Lage sein wird, die Akquisition zu starten, w&auml;hrend eine TV-Anwendung l&auml;uft. Benutzen Sie diese Option nur, wenn Sie Kompatibilit&auml;tsprobleme zwischen der TV-Applikation und nxtvepg erwarten (z.B. wenn eine Anwendung w&auml;hrend des Starts h&auml;ngt oder abst&uuml;rzt, wenn die andere bereits l&auml;uft; damit sei aber nicht gesagt, dass so ein Verhalten zu bef&uuml;rchten w&auml;re).</p>

</dd>
<dt id="Tune-TV-button"><i>Tune TV button</i></dt>
<dd>

<p>Diese Option erm&ouml;glicht es, den gleichnamigen Button unterhalb der Uhr im Hauptfenster von nxtvepg zu zeigen oder zu verstecken. Wenn Sie kein Interesse an einer Fernbedienung der TV-Anwendung haben, schalten Sie die Option ab.</p>

<p><b>Tipp:</b> Der Button hat ein kleines Kontextmen&uuml;, das sich mit der rechten Maustaste &ouml;ffnet. Es enth&auml;lt einige Kommandos zur Kontrolle der TV-Applikation (nicht alle TV-Applikationen unterst&uuml;tzen alle angebotenen Kommandos).</p>

</dd>
<dt id="Cursor-follows-channel-changes"><i>Cursor follows channel changes</i></dt>
<dd>

<p>W&auml;hrend diese Option aktiviert ist, wird nxtvepg TV-Kanal-Wechsel &uuml;berwachen. Immer wenn ein Wechsel erkannt wird, wird der Zeiger im Programmlistenfeld auf den Titel der aktuell auf diesem Sender laufenden Sendung gesetzt. Wenn die EPG-Akquisition eingeschaltet ist, wird VPS/PDC dazu verwendet, die aktuelle Sendung exakt zu bestimmen (nur bei Sendern, die VPS/PDC unterst&uuml;tzen); befindet sich die nominale Laufzeit der Sendung jedoch in der Vergangenheit, ist es leider nicht m&ouml;glich, die Sendung im Listenfeld anzuzeigen. Diese Info kann dennoch an die TV-Anwendung gesendet werden (siehe n&auml;chste Option).</p>

<p>Wenn Sie gerade einen Senderfilter aktiviert haben, wird dieser zum neuen Sender umgeschaltet, sodass Sie eine komplette Auflistung der Sendungen dieses einen Senders erhalten werden, beginnend mit dem aktuell Laufenden. Dies funktioniert sogar, wenn Sie diesen Sender in der Senderwahl-Konfiguration ausgeschlossen haben. Sind mehrere oder andere Senderfilter aktiviert, bleiben diese unber&uuml;hrt. Trifft diese Filtereinstellung auf die aktuell auf diesem Sender laufende Sendung nicht zu, wird weder der Zeiger noch das Listenfeld ver&auml;ndert.</p>

</dd>
<dt id="Display-EPG-info-in-TV-app"><i>Display EPG info in TV app</i></dt>
<dd>

<p>Falls diese Option aktiviert ist, wird nxtvepg TV-Kanal-Wechsel &uuml;berwachen. Wenn die EPG-Akquisition eingeschaltet ist, wird ebenso VPS/PDC auf &Auml;nderungen &uuml;berwacht, um so den Start einer neuen Sendung zu bestimmen. Ebenso erlaubt VPS/PDC, Kanalwechsel auf einer externen Input-Quelle zu erkennen, z.B. einem &uuml;ber einen Composite-Anschluss verbundenen Satelliten-Receiver.</p>

<p>Nach einem Kanalwechsel oder dem Wechsel des aktuellen Programmtitels wird die Info &uuml;ber den im Moment laufenden Titel innerhalb der TV-Anwendung angezeigt. Auf Windows liegt es vollst&auml;ndig in der Hand der TV-Anwendung, wie diese Information dargestellt wird.</p>

<p>Auf UNIX kann das Anzeigeformat durch Ausw&auml;hlen der folgenden Radiobuttons festgelegt werden:</p>

<dl>

<dt id="Separate-popup"><i>Separate popup</i></dt>
<dd>

<p>Mit dieser Option wird nxtvepg ein kleines Popupfenster erzeugen und es genau neben dem xawtv-Fenster platzieren. Die blaue Fl&auml;che in dem kleinen Streifen am oberen Rand gibt an, welcher Anteil der (nominalen) Laufzeit in der Vergangenheit liegt.</p>

</dd>
<dt id="Video-overlay"><i>Video overlay</i></dt>
<dd>

<p>Mit dieser Option wird nxtvepg ein &auml;hnliches Popup generieren, jedoch wird dies &uuml;ber das Videobild gelegt (bitte beachten Sie, dass diese Option nur mit XFree86 Version 4 und der Erweiterung XVideo ordentlich funktioniert; verwenden Sie den Befehl <b>xvinfo</b>, um zu &uuml;berpr&uuml;fen, ob Ihr Server dieses Feature unterst&uuml;tzt). Sie k&ouml;nnen Schriftart und -farbe in diesem Popup &uuml;ber die X Resources &auml;ndern (siehe <a href="#FILES">&quot;FILES&quot;</a> f&uuml;r Details).</p>

</dd>
<dt id="Video-overlay-2-lines"><i>Video overlay, 2 lines</i></dt>
<dd>

<p>Diese Option ist identisch zur vorherigenau&szlig;er ausgenommen dass es Laufzeit und Titel auf zwei separate Zeilen verteilt und zus&auml;tzlich den Prozentsatz der abgelaufenen Laufzeit angibt.</p>

</dd>
<dt id="Xawtv-window-title"><i>Xawtv window title</i></dt>
<dd>

<p>Mit dieser Option wird die Info an xawtv gesendet und im Fenstertitel dargestellt. Au&szlig;er f&uuml;r diese letzte Option k&ouml;nnen Sie die gew&uuml;nschte Anzeigedauer mit einem Schieberegler am unteren Ende des Dialogs konfigurieren. Eine Dauer von Null bedeutet dass die Anzeige endlos stehen bleibt.</p>

</dd>
<dt id="Use-external-application"><i>Use external application</i></dt>
<dd>

<p>Mit dieser Option kann eine beliebige externe Applikation zur Anzeige verwendet werden. Titel und Laufzeit des aktuellen Programms k&ouml;nnen auf der Kommandozeile &uuml;bergeben werden. Die Syntax ist dieselbe wie beim Aufruf externer Applikationen im Kontextmen&uuml; (siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;Context menu configuration&quot;)</p>

</dd>
</dl>

</dd>
</dl>

<p>In der Mitte des Dialogs befindet sich eine Zeile, die den aktuellen Verbindungsstatus der TV-Anwendung anzeigt. Sie enth&auml;lt den Namen der verbundenen Applikation oder &quot;<i>not connected</i>&quot;. Letztere Meldung erscheint wenn keine TV-Anwendung l&auml;uft oder eine die nicht mit nxtvepg interagiert (siehe auch <a href="#GETTING-STARTED:-Configuring-a-TV-application">&quot;GETTING STARTED: Configuring a TV application&quot;</a>). Sie k&ouml;nnen mit anderen Applikationen als unten konfiguriert Verbindung aufnehmen, sind jedoch die Sendernamen nicht mit nxtvepg synchronisiert, wird die Interaktion nicht optimal funktionieren (d.h. nxtvepg k&ouml;nnte nicht in der Lage dazu sein, alle Sender zu identifizieren, und daher keine Sendungstitel bereitstellen).</p>

<p>Im unteren Teil des Dialogfensters k&ouml;nnen Sie Typ und den Installationspfad Ihrer bevorzugten TV-Anwendung konfigurieren. Diese Information wird genutzt, um die Kanalliste der TV-Anwendung (d.h. Frequenzen und Stationsnamen des TV-Tuners) zu laden. Die Kanalliste wird vom Teletext EPG Grabber, dem &quot;TV channel scan&quot; (siehe vohergehendes Kapitel) und dem Dialog zur Konfiguration der Sendernamen verwendet (siehe folgendes Kapitel &quot;Network names&quot;).</p>

<p>Nachdem Sie die Einstellungen ge&auml;ndert haben, k&ouml;nnen Sie den Button <i>Test</i> dr&uuml;cken, um zu &uuml;berpr&uuml;fen, ob nxtvepg die Kanaltabelle korrekt einlesen kann. Eine Fehlermeldung wird ausgegeben, wenn die Datei oder (auf Windows) der Registry-Schl&uuml;ssel nicht ge&ouml;ffnet werden kann, oder wenn keine TV-Kan&auml;le gefunden werden. Nachdem der Test erfolgreich abgeschlossen ist, sollten Sie den Dialog zur Konfiguration der Sendernamen &ouml;ffnen und diese mit nxtvepg synchronisieren. (Letzteres ist bei Verwendung des Teletext-EPG Grabbers nicht erfoderlich, da der Grabber von vornherein die Sendernamen aus der hier eingestellten Kanalliste &uuml;bernimmt.)</p>

<p>Wird Ihre TV-Anwendung nicht unterst&uuml;tzt, w&auml;hlen Sie <i>none</i>. (Ist es eine Freeware-Anwendung, tun Sie sich keinen Zwang an und mailen Sie mir eine Download-URL und ich werde &uuml;berlegen, ob ich diese unterst&uuml;tzen werde. Nichtsdestotrotz werde ich keine propriet&auml;re Closed-Source-Software unterst&uuml;tzen, au&szlig;er auf Anfrage des Autors selbst.)</p>

<p>Zu bemerken ist, dass nicht alle TV-Anwendungen, die im Popupmen&uuml; aufgelistet werden, wirklich mit nxtvepg interagieren k&ouml;nnen. Die Interaktion erfordert Modifikationen auf Seite der TV-Anwendungen; es liegt an den entsprechenden Autoren der Anwendungen, ob sie dies implementieren wollen. (Sind Sie ein Autor einer TV-Applikation, k&ouml;nnen Sie mir gerne eine Mail zuschicken, wenn ich eine EPG-Unterst&uuml;tzung f&uuml;r Ihre Anwendung hinzuf&uuml;gen soll; eine Demo-Anwendung und Quelltext f&uuml;r eine Referenz-Implementierung stehen auf der nxtvepg-Homepage zur Verf&uuml;gung.)</p>

<h2 id="Select-attributes">Select attributes</h2>

<p>&Ouml;ffnet den Konfigurationsdialog f&uuml;r &quot;Sendungsattribute&quot;, d.h. hier k&ouml;nnen Sie w&auml;hlen, welche Daten f&uuml;r die Sendungen im Hauptfenster angezeigt werden. Im Listenfeld zur Linken des Dialogfensters steht eine Auflistung aller verf&uuml;gbaren Attributkategorien, z.B. Titel, Laufzeit, Wochentag, TV-Sendername, Ratings, ... d.h. genau die gleichen, die f&uuml;r das Filtern verf&uuml;gbar sind. <b>Tipp:</b> Mit dem im n&auml;chsten Kapitel beschriebenen Dialog k&ouml;nnen Sie sich eigene Attribute zusammenstellen, um diese Liste zu erweitern.</p>

<p>Das Listenfeld zur Rechten enth&auml;lt die Typen, die aktuell zur Anzeige ausgew&auml;hlt sind. Der oberste Eintrag erscheint im &quot;single list&quot;-Layout auf der Linken Seite des Listenfelds; im tabellarischen &quot;grid&quot;-Layout erscheint entsprechend der oberste Eintrag in der ersten Zeile usw. Dr&uuml;cken Sie <i>Apply</i>, um das Browserlistenfeld mit der neuen Spaltenauswahl aktualisieren zu lassen.</p>

<p>Im &quot;single list&quot;-Layout (siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;List layout&quot;) besitzt jedes Attribut seine eigene Spalte in TV-Programm&uuml;bersicht und ein damit verbundenes Filtermen&uuml; im Button oberhalb der Spalte (vorausgesetzt die Spaltenk&ouml;pfe wurden nicht deaktiviert, siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;Show/Hide&quot;). Sie k&ouml;nnen die Breite jeder Spalte &auml;ndern, indem Sie den Mauspfeil an die rechte Seite jedes Men&uuml;eintrages bewegen bis ein Pfeil an einem senkrechten Strich zu sehen ist und diesen dann mit gedr&uuml;ckter Maustaste an die neue Position ziehen.</p>

<p>Im &quot;separate network columns&quot;-Layout werden die Attribute untereinander in separaten Zeilen der Spalten des TV-Programm&uuml;bersicht ausgedruckt, es sei denn Sie w&auml;hlen &quot;<i>No new line after element</i>&quot; w&auml;hrend das jeweilig Attribut im rechten Listenfeld gew&auml;hlt ist. Leere Zeilen werden automatisch unterdr&uuml;ckt, sodass im Gegensatz zum &quot;single list&quot;-Layout die tats&auml;chlich gezeigte Anzahl an Attributen variieren kann. Dies ist insbesondere bei benutzerdefinierten Attributen n&uuml;tzlich: So k&ouml;nnten Sie z.B. das Attribut so definieren, dass Themen-Kategorien nur f&uuml;r Filme ausgedruckt werden, um die Auflistung kompakter zu halten.</p>

<h2 id="Attribute-composition">Attribute composition</h2>

<p>&Ouml;ffnet den Konfigurations-Dialog f&uuml;r &quot;<i>composite attributes</i>&quot;, welcher erlaubt, neue Spaltentypen f&uuml;r das &quot;single list&quot;-Layout der TV-Programm&uuml;bersicht zu erstellen (siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;List layout&quot;) beziehungsweise neue Zeilen im &quot;spearate network columns&quot;-Layout, die danach zus&auml;tzlich zu den vorgegebenen Attributtypen gew&auml;hlt werden k&ouml;nnen (z.B. &quot;Titel&quot; und &quot;Thema&quot;) wie im vorherigen Kapitel beschrieben.</p>

<p>F&uuml;r eine allgemeine Beschreibung von Composite-Attributen siehe <a href="#COMPOSITE-ATTRIBUTES">&quot;COMPOSITE ATTRIBUTES&quot;</a>. Dieses Kapitel beschreibt lediglich den Gebrauch des Konfigurations-Dialoges. Dieses Kapitel geht auch davon aus, dass Sie mit dem Konzept der Filter-Shortcuts (siehe <a href="#FILTER-SHORTCUTS">&quot;FILTER SHORTCUTS&quot;</a>) und Reminder vertraut sind (siehe <a href="#REMINDERS">&quot;REMINDERS&quot;</a>).</p>

<p>Der Dialog besteht aus drei Sektionen: ganz oben rechts befindet sich ein Dropdown-Men&uuml;, das alle im Moment definierten Composite-Attribute auflistet. Hier w&auml;hlen Sie, welche Attribut-Definition Sie bearbeiten wollen. Darunter zur Linken liegt eine Liste von Shortcuts und Reminder-Gruppen sowie 4 Buttons, um diese Liste zu bearbeiten. Auf der rechten Seite der Shortcut-Liste befinden sich diverse Schalter zur Definition, wie Shortcuts und Reminder-Gruppen, die auf Sendungen zutreffen, angezeigt werden sollen.</p>

<p>Zu bemerken ist, dass es Abh&auml;ngigkeiten der Sektionen untereinander gibt: wenn Sie mit dem Dropdown-Men&uuml; oben zu einer anderen Attribut-Definition wechseln, wird der Rest des Dialogs augenblicklich aktualisiert und zeigt die aktuelle Definition des Composite-Attributs (Sie werden eine Warnung erhalten, sollten &Auml;nderungen an der vorherigen Zuordnung noch nicht per &quot;Apply&quot;-Button gespeichert worden sein). Ebenso werden die Anzeigeformat-Optionen zur Rechten aktualisiert, wenn Sie einen Shortcut im Listenfeld w&auml;hlen.</p>

<p>Um ein neues Composite-Attribut zu erstellen, beginnen Sie mit dem Befehl &quot;<i>Create new definition</i>&quot; im Men&uuml; oben rechts im Dialogfenster. Sie sollten dem Attribut m&ouml;glichst sofort eine Kennung geben, sodass Sie Ihre Definition wieder finden, siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;Select attributes&quot;. Ebenso sollten Sie der Kennung einen Text f&uuml;r den Spaltenkopf zuordnen (nur im &quot;single list&quot;-Layout), der oberhalb der Sendungsliste im Hauptfenster auftauchen wird; wenn m&ouml;glich sollten Sie hier einen k&uuml;rzeren Text verwenden als in der Kennung.</p>

<p>Danach f&uuml;gen Sie einen oder mehrere Filter zur Liste hinzu, indem Sie die Dropdown-Men&uuml;s &quot;<i>Add shortcut</i>&quot; oder &quot;<i>Add reminder</i>&quot; links des Listenfeldes verwenden. Neue Eintr&auml;ge werden immer an das Ende der Liste angef&uuml;gt, jedoch k&ouml;nnen Sie die Sortierreihenfolge mit Hilfe der auf/ab-Pfeil-Buttons ver&auml;ndern. Um einen Shortcut oder eine Reminder-Gruppe aus der Liste zu entfernen, markieren Sie den Eintrag zuerst, dann klicken Sie den Button <i>Delete</i> oder die <i>Entf</i>-Taste. Beachten Sie: die Reihenfolge wird dann relevant, wenn eine Sendung auf mehrere der ausgew&auml;hlten Shortcuts zutrifft oder wenn Sie Shortcuts mit Reminder-Gruppen mischen. Denn das Anzeigeformat wird vom ersten zutreffenden Eintrag in der Liste, von oben beginnend, bestimmt (siehe auch Einf&uuml;hrung in <a href="#COMPOSITE-ATTRIBUTES">&quot;COMPOSITE ATTRIBUTES&quot;</a>).</p>

<p>Zur Rechten der Shortcut-Liste befinden sich Schalter, die definieren, was abh&auml;ngig von einem Shortcut- oder Reminder-Treffer in der Sendungsliste angezeigt wird (Sendungen, die auf keinen der gegebenen Shortcuts zutreffen, werden nicht dargestellt, es sei denn Sie haben einen Eintrag <i>*no match*</i>). Standardm&auml;&szlig;ig wird ein Treffer als der Name des zutreffenden Shortcuts oder der Reminder-Gruppe angezeigt, Sie k&ouml;nnen dies jedoch ganz einfach &uuml;ber die Schalter rechts des Listenfelds &auml;ndern. Die Wahlm&ouml;glichkeiten sind: frei definierter aber statischer Text, eines der vordefinierten Bilder oder Attribute der Sendung (wenn Sie beispielsweise <i>Time</i> w&auml;hlen, wird die Startzeit der Sendung angezeigt).</p>

<p>Falls Sie sich entscheiden Text zu verwenden (dies schlie&szlig;t auch Attribute ein), k&ouml;nnen Sie fette, unterstrichene oder durchgestrichene Schrift sowie die Textfarbe ausw&auml;hlen. Unabh&auml;ngig vom Typ k&ouml;nnen Sie eine Hintergrundfarbe w&auml;hlen: entweder nur f&uuml;r die Spalte/Zeile in der das Element angezeigt wird oder f&uuml;r das komplette Programmelement. Das hieraus resultierende Erscheinungsbild wird in einem <b>Text sample</b> &uuml;ber der Steuerung angezeigt. Diese Anzeigeoptionen k&ouml;nnen separat f&uuml;r jeden Shortcut-Treffer konfiguriert werden. Eine Ausnahme bildet die Hintergrundfarbe der Gesamtspalte; wird solch ein Format in mehreren Attributen vorgefunden, z&auml;hlt das letzte davon.</p>

<p>Wollen Sie Ihre Attribut-Definition ausprobieren, dr&uuml;cken Sie unten den Button <i>Apply</i>. Die Definition wird in der Konfigurationsdatei gespeichert und der Browserinhalt aktualisiert. Sollte das Attribut momentan nicht im Browser verwendet werden, wird ihnen in einer Popup-Mitteilung angeboten, das Attribut automatisch dem TV-Plan anzuh&auml;ngen. Sie k&ouml;nnen dessen Position sp&auml;ter &uuml;ber die Konfiguration der &quot;<i>Attribute selection</i>&quot; ver&auml;ndern.</p>

<p>Unten gibt es auch einen <i>Delete</i>-Button, der das Entfernen veralteter Definitionen erlaubt. Wird das Composite-Attribut nach wie vor im Browser angezeigt, wird es automatisch entfernt. Zu bemerken ist, dass eine L&ouml;schung nicht r&uuml;ckg&auml;ngig gemacht werden kann, d.h. die Information ist unwiederbringlich verloren.</p>

<h2 id="Select-networks">Select networks</h2>

<p>&Ouml;ffnet den Dialog zur Senderwahl. Er erlaubt das permanente Abschalten eines TV-Senders in einer Provider-Auflistung, z.B. wenn Sie den Kanal gar nicht empfangen k&ouml;nnen. Sie k&ouml;nnen auch die Anordnung der Sender andern, z.B. indem Sie ihre Favoriten-Sender an die Spitze des Filtermen&uuml;s setzen.</p>

<p>Dieses Fenster enth&auml;lt zwei Listen: auf der linken Seite werden Sie alle vom Provider abgedeckten Sender in Ihrer originalen Anordnung vorfinden, auf der rechten Seite diejenigen, welche f&uuml;r die Programmauflistung in Ihrer bevorzugten Reihenfolge gew&auml;hlt wurden. Standardm&auml;&szlig;ig werden beide Listen den genau gleichen Inhalt haben. Wollen Sie Sender ausschlie&szlig;en, markieren Sie sie in der rechten Liste und dr&uuml;cken Sie auf <i>Delete</i>. Sie k&ouml;nnen sie jederzeit wieder einschlie&szlig;en, indem Sie sie in der linken Liste markieren und auf <i>Add</i> dr&uuml;cken. Die Reihenfolge k&ouml;nnen Sie in der rechten Liste durch das Markieren eines oder mehrerer Sender und dem Dr&uuml;cken der <i>Auf</i>- oder <i>Ab</i>-Pfeile ver&auml;ndern.</p>

<p>Am unteren Ende des Dialogfensters steht ein Eingabefeld namens <b>Air times</b>, das die Begrenzung der Programmauflistung eines Senders auf einen bestimmten Zeitrahmen erlaubt. Zum Beispiel, wenn Sie <i>Arte</i> nur von 19:00 bis 07:00 Uhr empfangen, w&auml;hlen Sie &quot;Arte&quot; entweder in der linken oder der rechten Liste, geben dann &quot;19:00&quot; und &quot;07:00&quot; in die Felder ein (stellen Sie sicher, dass Sie immer 4 Ziffern und einen trennenden Doppelpunkt verwenden). Sendungen, die vollkommen au&szlig;erhalb dieses Zeitfensters liegen, werden im Browserfenster nicht auftauchen. Wollen Sie die Begrenzung r&uuml;ckg&auml;ngig machen, geben Sie 00:00 bis 00:00 oder gleiche Zeitwerte ein.</p>

<p><b>Tipp:</b> Sie k&ouml;nnen diesen Dialog (und alle anderen Dialoge mit vergleichbaren Listenfeldern) auch &uuml;ber das Keyboard bedienen: benutzen Sie die TAB-Taste oder die Maus, um den Fokus auf die Keyboardeingabe zum linken oder rechten Listenfeld zu bewegen. Verwenden Sie die &quot;Pfeil auf/ab&quot;-Tasten, um einen Eintrag zu markieren; halten Sie die SHIFT-Taste gedr&uuml;ckt, um mehrere Eintr&auml;ge zu markieren. Dr&uuml;cken Sie in der linken Liste auf Eingabe, um einen Sender in der rechten Liste hinzuzuf&uuml;gen. Dr&uuml;cken Sie in der rechten Liste auf die ENTF-Taste, um einen Sender zu entfernen oder dr&uuml;cken Sie STRG und die &quot;Pfeil auf/ab&quot;-Tasten, um die Position der markierten Eintr&auml;ge innerhalb der Liste zu ver&auml;ndern.</p>

<h2 id="Network-names">Network names</h2>

<p>&Ouml;ffnet einen Dialog zur Konfiguration der Sendernamen. Der Hauptzweck des Dialogs ist die Sendernamen zwischen nxtvepg und Ihrer TV-Anwendungen zu synchronisieren. Dies ist notwendig, weil der Sendername der Kommunikation dient, wenn Sie die &quot;<i>Tune TV</i>&quot;-Fernbedienung verwenden und ebenso f&uuml;r die Bekanntgaben der Kanalwechsel von Seiten der TV-Anwendungen. Bei vielen Sendern muss nichts ver&auml;ndert werden, bei anderen jedoch bestehen mehrere Varianten, z.B. in Deutschland &quot;Super RTL&quot; versus &quot;S-RTL&quot; oder &quot;MDR3&quot; versus &quot;MDR&quot;.</p>

<p>Falls Sie also eine der von nxtvepg unterst&uuml;tzten TV-Applikationen verwenden und Features wie den &quot;Tune-TV&quot; Knopf zum Senderwechsel verwenden wollen, sollten Sie diese zuerst mittels des Dialogs &quot;<i>TV app. interaction</i>&quot; im <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a> konfigurieren. Ansonsten k&ouml;nnen Sie den Dialog verwenden um die Sendernamen individuall anzupassen.</p>

<p>Auf der linken Seite des Dialogs finden Sie eine Liste aller Sender der aktuell geladenen bzw. zusammengef&uuml;hrten XMLTV Dateien. Beim ersten Aufruf des Dialogs nachdem eine TV-Applikation konfiguriert wurde, wird nxtvepg nach &auml;hnlichen Namen in der TV-Sendertabelle suchen, die sich nur durch Leerzeichen oder Punktierung vom Namen in der XMLTV Datei unterscheidet. Diese Namen werden automatisch in der Namensliste ersetzt. Falls keiner TV-Applikation konfiguriert ist, wird der Name aus der XMLTV unver&auml;ndert &uuml;bernommen. Im Fall einer zusammengef&uuml;hrten Datenbank, wird der Name der ersten XMLTV Datei &uuml;bernommen.</p>

<p>Namen in der linken Liste sind rot markiert, wenn eine TV-Applikation konfiguriert ist aber der Name nicht in der TV-Sendertabelle enthalten ist.</p>

<p>Auf der rechten Seite werden Ihnen drei M&ouml;glichkeiten angeboten, den Namen zu &auml;ndern: zuoberst liegt ein normales Eingabefeld, in das Sie einen beliebigen Namen eintippen k&ouml;nnen. Im Rahmen darunter werden &auml;nlich lautende Namen in der Sendertabelle der TV-Applikation aufgef&uuml;hrt. Im untersten Rahmen werden die Originalnamen in der XMLTV Datei angezeigt. Sie k&ouml;nnen einen Namen aus den Listen durch einen Doppelclick in das Eingebefeld &uuml;bernehmen.</p>

<p>Wollen Sie die ge&auml;nderte Liste speichern, verlassen Sie den Dialog mit <i>Save</i>, andernfalls benutzen Sie <i>Abort</i>.</p>

<p><b>Wichtig</b>: wenn Sie Kan&auml;le empfangen, die mehrere Sender &uuml;bertragen, z.B. in Deutschland &quot;Arte / Kinderkanal&quot;, ist zu empfehlen, alle Sendernamen im Namen des Senders auf Seite der TV-Anwendung durch einen Schr&auml;gstrich &quot;/&quot; getrennt einzubeziehen. Der Schr&auml;gstrich wird von nxtvepg als ein Trennzeichen erkannt und so lassen sich alle daraus ergebenden Abschnitte als Sendernamen in nxtvepg verwenden.</p>

<h2 id="Context-menu-configuration">Context menu configuration</h2>

<p>&Ouml;ffnet den Konfigurationsdialog f&uuml;r das Kontextmen&uuml;. Hier k&ouml;nnen Sie bestimmen welche der Kontext-abh&auml;ngigen Befehle enthalten sein sollen. Ebenso k&ouml;nnen Sie das Men&uuml; durch selbst definierte Befehle erweitern (f&uuml;r eine allgemeine Beschreibung des Kontextmen&uuml;s siehe <a href="#CONTEXT-MENU">&quot;CONTEXT MENU&quot;</a>).</p>

<p>Oben innerhalb des Dialogfensters steht eine Liste aller aktuell definierten Men&uuml;eintr&auml;ge. Wenn Sie den Dialog zum ersten Mal &ouml;ffnen, werden Sie nur die standardm&auml;&szlig;ig vordefinierten &quot;Pseudo&quot;-Kommandos sehen (wie z.B. &quot;Add programme filters&quot;). Deren Titel erscheinen nicht als solche im Kontextmen&uuml;, sondern sie repr&auml;sentieren die beim &Ouml;ffnen des Men&uuml;s in Abh&auml;ngigkeit vom selektierten Programm generierten Kommandos (z.B. um einen Suchfilter f&uuml;r den Sender zu dem das Programm geh&ouml;rt zu definieren).</p>

<p>Wie &uuml;blich k&ouml;nnen Sie die Reihenfolge der Eintr&auml;ge in der Liste &auml;ndern indem Sie einen Eintrag selektieren und dann die &quot;Pfeil auf/ab&quot;-Kn&ouml;pfe anklicken. Um einen Eintrag zu l&ouml;schen, selektieren Sie ihn und klicken Sie <i>Delete</i>. Falls Sie eine &Auml;nderung r&uuml;ckg&auml;ngig machen wollen, verlassen Sie den Dialog mit <i>Abort</i>. &Auml;nderungen werden nicht in das Hauptfenster &uuml;bernommen bis Sie den Dialog mit <i>OK</i> schlie&szlig;en.</p>

<p>Der Knopf &quot;<i>Add new</i>&quot; erlaubt einen neuen Men&uuml;eintrag unterhalb des aktuell selektierten zu erzeugen. Die folgenden Kommandotypen sind zu unterscheiden:</p>

<dl>

<dt id="External-command"><b>External command</b></dt>
<dd>

<p>Startet ein externes Programm mit der angegebenen Befehlszeile, genauso als ob Sie diese in einer UNIX Shell oder bei <i>Ausf&uuml;hren</i>-Befehl unter Windows eingeben w&uuml;rden. Die Befehlszeile kann substituierte Parameter enthalten, wie unten beschrieben. Um das Verwenden der gleichen Konfigurationsdatei unter Windows und UNIX zu erm&ouml;glichen, gibt es die Unterscheidung nach Betriebssystem. Es werden nur die dem aktuellen System zugeordneten Befehle im Kontextmen&uuml; angezeigt.</p>

<p>Im Eingabefeld <i>Titel</i> geben Sie den Namen an, der sp&auml;ter im Kontextmen&uuml; erscheint. Im Feld <i>Command</i> geben Sie die Befehlszeile ein. Falls die Zeile zu kurz ist, k&ouml;nnen Sie das Dialogfenster auch verbreitern.</p>

</dd>
<dt id="TV-application-remote-command"><b>TV application remote command</b></dt>
<dd>

<p>Sendet die angegebene Befehlszeile an eine verbundene TV-Anwendung, z.B. um den TV-Sender umzuschalten. Auch hier k&ouml;nnen sie Parametersubstitution verwenden. Auf welchem Weg das Kommando zur TV-Anwendung &uuml;bertragen wird h&auml;ngt von der Anwendung ab. Wenn keine TV-Anwendung verbunden ist, erscheinen die Eintr&auml;ge dieses Typs ausgegraut (siehe auch <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;TV application interaction&quot;).</p>

<p>Beispiel:</p>

<pre><code>setstation ${network}</code></pre>

<p>Bewirkt dass die TV-Anwendung auf den Sender des aktuell in nxtvepg selektierten Programms umschaltet (d.h. identisch zum Klicken des Knopfs &quot;<i>Tune TV</i>&quot;). Welche Kommandos die TV-Applikation unterst&uuml;tzt entnehmen Sie bitte deren Dokumentation.</p>

</dd>
<dt id="Menu-title-und-Menu-separator"><b>Menu title</b> und <b>Menu separator</b></dt>
<dd>

<p>Diese Elemente dienen der &Uuml;bersichtlichkeit. Sie k&ouml;nnen sie einf&uuml;gen um die Eintr&auml;ge des Kontextmen&uuml;s in Gruppen zu gliedern. F&uuml;r Men&uuml;titel geben Sie den gew&uuml;nschten Text im Eingabefeld <i>Title</i> ein. Der Trennstrich hat keine Parameter.</p>

</dd>
<dt id="Add-Undo-programme-filters"><b>Add/Undo programme filters</b></dt>
<dd>

<p>An Stelle dieses Eintrags wird im Kontextmen&uuml; eine Liste von Kommandos erscheinen um Filter hinzuzuf&uuml;gen. F&uuml;r Details siehe <a href="#CONTEXT-MENU">&quot;CONTEXT MENU&quot;</a>.</p>

</dd>
<dt id="Add-remove-reminder"><b>Add/remove reminder</b></dt>
<dd>

<p>An Stelle dieses Eintrags wird im Kontextmen&uuml; eine Liste von Kommandos erscheinen mit denen Sie eine Erinnerung f&uuml;r den selektierte Programmeintrag hinzuf&uuml;gen oder l&ouml;schen k&ouml;nnen. Es gibt eine kurze und eine lange Variante dieser Option: in der langen Version erscheint zus&auml;tzlich ein Kommando mit dem Sie die Reminder-Gruppe &auml;ndern k&ouml;nnen (nur sinnvoll wenn Sie zuvor mehr als eine Gruppe angelegt haben, siehe <a href="#REMINDERS">&quot;REMINDERS&quot;</a>).</p>

</dd>
</dl>

<p>Wenn Sie den Knopf &quot;<i>Add Example</i>&quot; klicken, erscheint eine kleine Liste von Beispielkommandos die Sie zu Testzwecken Ihrem Kontextmen&uuml; hinzuf&uuml;gen k&ouml;nnen.</p>

<p>Wie oben bereits erw&auml;hnt, k&ouml;nnen die Befehlszeilen Platzhalter umgeben von <code>${}</code> beinhalten, die beim Aufruf durch Attribute des im Hauptfenster selektierten Programms ersetzt werden. Im Folgenden finden Sie eine Liste aller verf&uuml;gbaren Variablen. Die Bedeutung sollte selbsterkl&auml;rend sein, au&szlig;er eventuell &quot;CNI&quot;: dies ist ein Europaweit eindeutiger Senderidentifikations-Code; e/p_rating: bezeichnet Wertung bzw. Altersfreigabe.</p>

<pre><code>${title}
${network}
${start}
${stop}
${relstart}
${duration}
${CNI}
${description}
${themes}
${VPS}  or  ${PDC}
${e_rating}
${p_rating}
${sound}
${format}
${digital}
${encrypted}
${live}
${repeat}
${subtitle}</code></pre>

<p>Auf Start- und Stopzeit bezogene Schl&uuml;sselw&ouml;rter k&ouml;nnen optional entweder von einem Plus- oder Minuszeichen und einer Zeitabweichung gefolgt werden. Der Wert der Abweichung wird in Minuten angenommen. F&uuml;r Start und Dauer kann die Genauigkeit je nach Format ge&auml;ndert werden (siehe unten). Beispiel: um die Startzeit minus 5 Minuten ausgeben zu lassen (z.B. um eine Aufnahme 5 Minuten fr&uuml;her zu starten) verwenden Sie <code>${start-5:%H:%M}</code>.</p>

<p>Nach den Schl&uuml;sselw&ouml;rtern k&ouml;nnen optional ein Semikolon und eine Ausgabeformatierung stehen. Die Optionen f&uuml;r die Formatierung h&auml;ngen von dieser Variablen-Substitution ab:</p>

<dl>

<dt id="Start-Stop-und-VPS-PDC-Codes"><i>Start, Stop und VPS/PDC-Codes</i></dt>
<dd>

<p>Alle in der <b>strftime(3)</b> Dokumentation definierten Optionen sind verf&uuml;gbar; Vorgabe ist %H:%M-%d.%m.%Y (Stunde, Minute, Tag, Monat, Jahr).</p>

</dd>
<dt id="Relative-Startzeit-und-Laufzeit"><i>Relative Startzeit und Laufzeit</i></dt>
<dd>

<p>Man kann zwischen Minuten (Vorgabe) und Sekunden durch Anh&auml;ngen von &quot;m&quot; oder &quot;s&quot; w&auml;hlen.</p>

</dd>
<dt id="Themenkategorien"><i>Themenkategorien</i></dt>
<dd>

<p>Man kann zwischen numerischer oder textueller Ausgabe durch Anh&auml;ngen von &quot;n&quot; oder &quot;t&quot; w&auml;hlen. Eine Liste aller Kategorien erhalten Sie mit der Befehlszeilenoption <i>-dump themes</i> (siehe <a href="#OPTIONS">&quot;OPTIONS&quot;</a>.)</p>

</dd>
</dl>

<p>Bei allen anderen Variablen werden Zusatzangaben derzeit ignoriert.</p>

<p>In UNIX werden die resultierenden Ersetzungstexte mit einfachen Anf&uuml;hrungszeichen umgeben, weil die Befehlszeile an eine System-Shell zur Ausf&uuml;hrung &uuml;bergeben wird (/bin/sh, d.h. die <i>Bourne Shell</i> je nach <i>System</i>-Funktion; siehe auch system man pages <b>sh</b> oder <b>bash</b>) und weil es sehr viele Zeichen mit spezieller Bedeutung gibt. Der in einfache Anf&uuml;hrungszeichen gesetzte String wird vor Interpretation durch die Shell gesch&uuml;tzt.</p>

<p>Beispiel: Die Befehlszeile</p>

<pre><code>plan ${start:%d.%m.%Y %H:%M} ${title}</code></pre>

<p>w&uuml;rde zum Beispiel resultieren in</p>

<pre><code>plan &#39;22.08.2001 13:05&#39; &#39;K&auml;pt&#39;\&#39;&#39;n Blaub&auml;rs Seemannsgarn&#39;</code></pre>

<p>Unter Windows werden nur einfache und doppelte Anf&uuml;hrungszeichen sowie Leerzeichen mit einem Backslash &quot;\&quot; gesch&uuml;tzt. Daher &auml;ndert sich die Ausgabe des obigen Beispiels folgenderma&szlig;en:</p>

<pre><code>plan 22.08.2001\ 13:05 K&auml;pt\&#39;n\ Blaub&auml;rs\ Seemannsgarn</code></pre>

<p><b>Tipp:</b> Sie k&ouml;nnen zwei separate Substitutionen f&uuml;r Datum und Uhrzeit verwenden, wenn Sie einen Backslash innerhalb Datum und Uhrzeit vermeiden wollen (falls das aufgerufene Programm den Backslash nicht verarbeiten kann). Beispiel:</p>

<pre><code>plan ${start:%d.%m.%Y} ${start:%H:%M} ${title}</code></pre>

<h2 id="Themes-language">Themes language</h2>

<p>W&auml;hlt die Sprache f&uuml;r die Themenkategorienamen (siehe <a href="#FILTERING">&quot;FILTERING&quot;</a>) in Haupt- und Filtermen&uuml;. Standardm&auml;&szlig;ig ist diese auf <i>automatic</i> gesetzt, wobei in diesem Fall die Sprache aus der gew&auml;hlten Provider-Datenbank abgeleitet wird. Bitte beachten Sie, dass Men&uuml;s und Dialoge momentan nur in Englisch zur Verf&uuml;gung stehen.</p>

<h2 id="Show-Hide">Show/Hide</h2>

<p>Umschalten der Sichtbarkeit verschiedener Komponenten im Hauptfenster:</p>

<dl>

<dt id="Show-shortcuts"><i>Show shortcuts</i></dt>
<dd>

<p>Schaltet die Sichtbarkeit des Shortcut-Listenfeldes zur Linken der Programmliste an oder aus. Wenn Sie die Shortcut-Liste und die Senderliste unten unsichtbar machen, werden Uhr- und Reset-Button ebenfalls unsichtbar, sodass Sie nur die Programmliste erhalten.</p>

</dd>
<dt id="Show-networks-left"><i>Show networks (left)</i></dt>
<dd>

<p>Macht das Senderfilter-Listenfeld unterhalb der Shortcut-Liste, oder unterhalb der Uhr, wenn Sie die Shortcut-Liste versteckt haben, sichtbar oder unsichtbar.</p>

</dd>
<dt id="Show-networks-middle"><i>Show networks (middle)</i></dt>
<dd>

<p>Versteckt oder zeigt das Senderfilter-Listenfeld zwischen Shortcut- und Programmliste.</p>

</dd>
<dt id="Show-layout-button"><i>Show layout button</i></dt>
<dd>

<p>Versteckt oder zeigt die Checkbox &quot;<i>Grid layout</i>&quot; unterhalb Shortcuts- oder Senderliste im Hauptfenster (siehe auch <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;List layout&quot;). Sollten Sie das eine oder das andere Layout permanent verwenden, wollen Sie wom&ouml;glich diese Box verstecken (sie ist haupts&auml;chlich pr&auml;sent, um Benutzer, die von &auml;lteren Versionen upgraden, von dieser neuen Option wissen zu lassen).</p>

</dd>
<dt id="Show-status-line"><i>Show status line</i></dt>
<dd>

<p>Zeigt oder versteckt die Datenbank und den Akquisitionsstatus in der Statuszeile unten im Browser.</p>

</dd>
<dt id="Show-column-headers"><i>Show column headers</i></dt>
<dd>

<p>Versteckt oder zeigt die Men&uuml;bar im Spaltenkopf des Browserlistenfeldes, d.h. die Reihe Men&uuml;buttons oberhalb der Programmliste im &quot;single list&quot;-Layout.</p>

</dd>
<dt id="Show-weekday-scale"><i>Show weekday scale</i></dt>
<dd>

<p>Versteckt oder zeigt die Wochentags-Skala zur Rechten der Programmliste (beachten Sie, dass Sie Ansichten, d.h. Schriften, Farben, Breite und Datumsformat, &uuml;ber die Ressource-Datei <code>nxtvepg.ad</code> oder <code>.Xdefaults</code> auf UNIX, siehe <a href="#FILES">&quot;FILES&quot;</a> konfigurieren k&ouml;nnen).</p>

</dd>
<dt id="Hide-on-minimize"><i>Hide on minimize</i></dt>
<dd>

<p>Nur Windows: Ist diese Option aktiviert, wird in der Taskleiste der Eintrag des Hauptfensters entfernt, wenn dieses minimiert wird oder das Programm mit dem Befehlszeilenschalter <i>-iconic</i> gestartet wird. Stattdessen wird ein Icon in das Systemtray der Taskleiste gelegt. Ein Klick darauf mit der rechten Maustaste &ouml;ffnet ein kleines Popupmen&uuml;. Die Eintr&auml;ge in diesem Men&uuml; haben dieselbe Bedeutung, wie die gleichnamigen im Control-Men&uuml; (siehe <a href="#CONTROL-MENU">&quot;CONTROL MENU&quot;</a>).</p>

</dd>
</dl>

<h2 id="List-layout">List layout</h2>

<p>W&auml;hlt das Layout der Programmliste im Hauptfenster:</p>

<dl>

<dt id="Single-list-for-all-networks"><i>Single list for all networks</i></dt>
<dd>

<p>Dies ist das Original-Layout (das einzige Layout bis nxtvepg Version 2.4) in dem alle Programme der Sender in einer Liste bzw. Tabelle stehen die nach Anfangszeiten sortiert ist.</p>

</dd>
<dt id="Separate-columns-for-each-network"><i>Separate columns for each network</i></dt>
<dd>

<p>In diesem Layout werden die Sendungen immer nach Startzeit sortiert, aber in getrennten Spalten f&uuml;r jeden Sender pr&auml;sentiert. Die TV-Programme der verschiedenen Sender werden so angeordnet, dass Programme die gleichzeitig laufen, ann&auml;hernd auf gleicher H&ouml;he stehen.</p>

<p>Sie k&ouml;nnen &uuml;ber das <i>Control</i>-Men&uuml; mehrere Spalten zu einer einzigen verbinden (gedacht f&uuml;r Sender, die sich den selben Kanal teilen; verwenden Sie dies im Zusammenhang mit der &quot;<i>air times restriction</i>&quot; wie in <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;Select networks&quot; beschrieben). Das Control-Men&uuml; ist Teil des Dropdown-Men&uuml;s unterhalb des Buttons am oberen Ende der Spalte. Dieses Men&uuml; beinhaltet ebenso Befehle, um die Anzahl sichtbarer Spalten zu erh&ouml;hen oder zu senken.</p>

</dd>
</dl>

<p>In beiden Layouts k&ouml;nnen Sie w&auml;hlen, welche Attributtypen f&uuml;r jeden Sender ausgegeben werden, indem Sie auf das Icon in der Buttonreihe oberhalb der Liste klicken (solange die Spaltenkopfbuttons nicht versteckt sind).</p>

<h1 id="FILES">FILES</h1>

<h2 id="Files-used-on-UNIX-systems">Files used on UNIX systems</h2>

<dl>

<dt id="HOME-.config-nxtvepg-nxtvepgrc"><b>$HOME/.config/nxtvepg/nxtvepgrc</b></dt>
<dd>

<p>Standardpfad f&uuml;r die Konfigurationsdatei in der alle pers&ouml;nlichen Einstellungen gespeichert werden. Ein abweichender Pfad kann mit der Option <b>-rcfile</b> spezifiziert werden (siehe <a href="#OPTIONS">&quot;OPTIONS&quot;</a>).</p>

</dd>
<dt id="HOME-.cache-nxtvepg"><b>$HOME/.cache/nxtvepg/</b></dt>
<dd>

<p>Verzeichnis, in dem der Teletext EPG Grabber die erzeugten XMLTV Dateien speichert. Ein anderes Verzeichnis kann &uuml;ber die Option <b>-dbdir</b> spezifiziert werden (siehe <a href="#OPTIONS">&quot;OPTIONS&quot;</a>).</p>

<p>Dateien in diesem Verzeichnis haben Namen im Format <i>ttx-SID.xml</i>, wobei &quot;SID&quot; die DVB Service ID des TV-Programms in Datei <code>channels.conf</code> ist. (Es wird hier die SID anstatt des Namens verwendet, damit die Datei auch bei Namens&auml;nderungen zugreifbar bleibt. Nur bei analogen Sendern wird anstelle der SID der aktuelle Sendername verwendet.) Das Dateiformat ist XML mit XMLTV Schema. F&uuml;r jeden TV-Sender wird eine separate Datei erzeugt.</p>

</dd>
<dt id="dev-dvb-adapter0-frontend0-dev-dvb-adapter0-demux0"><b>/dev/dvb/adapter0/frontend0</b>, <b>/dev/dvb/adapter0/demux0</b></dt>
<dd>

<p>Ger&auml;tedateien, aus denen die Teletext w&auml;hrend der Akquisition gelesen wird wenn eine DVB-Karte konfiguriert wurde. (Das erste Ger&auml;t wird zum Einstellen der Empfangsfrequenz verwendet, das zweite zum Lesen des Datenstroms.) Der Index des &quot;adapter&quot; Unterverzeichnisses kann mit der Befehlszeilenoption <b>-card</b> (siehe <a href="#OPTIONS">&quot;OPTIONS&quot;</a>) spezifiziert werden.</p>

</dd>
<dt id="dev-vbi0-dev-vbi1-etc"><b>/dev/vbi0</b>, <b>/dev/vbi1</b>, etc.</dt>
<dd>

<p>Ger&auml;tedateien, aus denen Teletext w&auml;hrend der Akquisition gelesen wird wenn eine analoge TV-Karte konfiguriert wurde. Der Index von Postfix kann mit der Befehlszeilenoption <b>-card</b> (siehe <a href="#OPTIONS">&quot;OPTIONS&quot;</a>) spezifiziert werden. Sie m&uuml;ssen Lese-/Schreibzugriff auf diese Dateien haben; standardm&auml;&szlig;ig ist dies bei vielen Linux-Distributionen aus Sicherheitsgr&uuml;nden nicht der Fall (da Sie eine Webcam angeschlossen haben k&ouml;nnten und Mike oder sonst wer Sie aus der Ferne ausspionieren k&ouml;nnte). Auf einem Einzelplatzsystem ist es aber sicher, diese world-readable und writable zu machen, geben Sie dazu in der Root-Shell ein:</p>

<pre><code>chmod 666 /dev/vbi</code></pre>

<p>Alternativ kann man sich zum Mitglied einer Gruppe in <i>/etc/groups</i> - die Zugriff auf die Ger&auml;te hat - machen, oder eine solche Gruppe erstellen.</p>

</dd>
<dt id="dev-video0-dev-video1-etc"><b>/dev/video0</b>, <b>/dev/video1</b>, etc.</dt>
<dd>

<p>In Linux-Kernelserien 2.4 und fr&uuml;her (d.h. vor Revision 2 der video4linux API) werden diese Ger&auml;tedateien dazu benutzt, die Input-Quelle (z.B. TV-Tuner oder einen der Composite- oder S-Video-Anschl&uuml;sse) und die Empfangsfrequenz auszuw&auml;hlen, solange Sie nicht den passiven Akquisitionsmodus w&auml;hlen. Der Index kann mit der Befehlszeilenoption <b>-card</b> angegeben werden. Sie m&uuml;ssen Lese- und Schreibrechte f&uuml;r das Ger&auml;t haben.</p>

<p>Das Ger&auml;t wird nur w&auml;hrend der Teletextanbietersuche ge&ouml;ffnet gehalten (siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;TV channel scan&quot;). Ansonsten wird es nur kurzeitig ge&ouml;ffnet, um die Input-Quelle und die Empfangsfrequenz zu setzen. Ist das Ger&auml;t belegt (z.B. durch eine TV-Anwendung), startet die Akquisition auf dem momentan ausgew&auml;hlten Kanal und folgt automatisch jeder Kanal&auml;nderung (dies wird z.B. in der Statuszeile am unteren Ende des Browserfensters als Akquisitionsmodus &quot;<i>forced passive</i>&quot; gemeldet, siehe <a href="#STATISTICS:-Status-line">&quot;STATISTICS: Status line&quot;</a>).</p>

<p>Beachten Sie: das Video-Ger&auml;t muss zwingend denselben Index wie das VBI-Ger&auml;t besitzen. Haben Sie ein Video-Ger&auml;t an index 0, das kein Teletext unterst&uuml;tzt (eine Webcam zum Beispiel), kann das zum Video-Ger&auml;t 1 geh&ouml;rende VBI-Ger&auml;t an index 0 auftauchen. Sie sollten den Treiber dazu zwingen, das Ger&auml;t an index 1 des VBI-Index zu setzen. Auf Linux ist dies mittels der Parameter <i>insmod</i> in <i>/etc/modules.conf</i> m&ouml;glich, z.B. f&uuml;r bttv:</p>

<pre><code>options bttv video_nr=1 vbi_nr=1</code></pre>

</dd>
<dt id="dev-v4l-vbi0-dev-v4l-video0"><b>/dev/v4l/vbi0</b>, <b>/dev/v4l/video0</b></dt>
<dd>

<p>Haben Sie <i>devfs</i> in in Ihrem Linux-Kernel aktiviert, werden die VBI- und Video-Ger&auml;te in einem Unterverzeichnis erscheinen. nxtvepg entdeckt die Existenz dieses Verzeichnisses automatisch und wird dort anstatt in den regul&auml;ren Pfaden nach den Ger&auml;ten suchen.</p>

</dd>
<dt id="tmp-.vbi0.pid-tmp-.vbi1.pid-etc"><b>/tmp/.vbi0.pid</b>, <b>/tmp/.vbi1.pid</b>, etc.</dt>
<dd>

<p>Diese Datei enth&auml;lt die PID des nxtvepg Prozesses (oder des Akquisitions-Subprozesses, wenn kein Threading genutzt wird) solange ein VBI device ge&ouml;ffnet ist. Der Prozess kann gezwungen werden, das Ger&auml;t freizugeben, indem ihm das Signal SIGHUP gesendet wird, zum Beispiel durch ein Wrapper-Skript f&uuml;r einen Teletextdekoder. Ein Beispiel, das mit allen Shells funktioniert:</p>

<pre><code>kill -HUP `cat /tmp/.vbi0.pid`</code></pre>

<p>Zu bemerken ist, dass der Daemon nicht am Leben gehalten wird, wenn die Akquisition deaktiviert ist, sodass das Senden des HUP gleichbedeutend dem Senden des TERM ist. Sie k&ouml;nnen die Akquisition neu starten, indem Sie einen neuen Daemon starten. Der Browser versucht alle 10 Sekunden Verbindung aufzunehmen, wenn diese unterbrochen wurde. Sie k&ouml;nnen jedoch auch eine unmittelbare Wiederaufnahme der Verbindung ausl&ouml;sen, in dem Sie ihm ein HUP signalisieren.</p>

<p>Um die Akquisition im Nicht-Daemon-Modus neu zu starten, signalisieren Sie entweder dem zugeh&ouml;rigen Akquisitionsprozess oder dem Browserprozess nochmals ein HUP.</p>

</dd>
<dt id="tmp-nxtvepg.0"><b>/tmp/nxtvepg.0</b></dt>
<dd>

<p>Diese nicht-regul&auml;re Datei wird vom Daemon erzeugt, um dem lokalen Client Verbindungen &uuml;ber UNIX-Domain-Sockets zu erlauben. Derselbe Socket kann zu mehr als einer Client-Verbindung genutzt werden. Er wird gel&ouml;scht, wenn der Daemon beendet wird (es sei denn der Daemon st&uuml;rzt ab oder empf&auml;ngt ein nicht-empfangbares Signal wie das ber&uuml;chtigte Signal 9, auch KILL genannt). Siehe auch <a href="#CONTROL-MENU:-Connect-to-acq.-daemon">&quot;CONTROL MENU: Connect to acq. daemon&quot;</a>.</p>

</dd>
<dt id="channels.conf"><b>.../channels.conf</b></dt>
<dd>

<p>Nur mit DVB: Der Teletext EPG Grabber ben&ouml;tigt eine TV-Kanaltabelle mit den Namen, Frequenzen und Teletext PID aller empfangbaren TV Sender. nxtvepg kann die TV-Kanaltabelle nicht selber erzeugen. Sie ben&ouml;tigen daher eine externe Applikation die die DVB Kanalsuche durchf&uuml;hrt und eine solche Datei erzeugt. (Empfehlenswert daf&uuml;r ist <b>w_scan</b>.) nxtvepg underst&uuml;tzt sowohl das von VDR definierte Format als auch das von diversen anderen Applikationen wie <i>mplayer</i>, <i>Kaffeine</i>, <i>xine</i>, und <i>Totem</i> gemeinsam verwendete Format. Siehe auch <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;TV application interaction&quot;.</p>

</dd>
<dt id="HOME-.Xdefaults"><b>$HOME/.Xdefaults</b></dt>
<dd>

<p>Diese Datei wird normalerweise unter Verwendung des Befehls <i>xrdb</i> beim Start (oder w&auml;hrend des Login) in den X Server geladen. Sie enth&auml;lt so genannte <i>X Ressourcen</i>, d.h. Parameterzuordnungen, f&uuml;r eine beliebige Anzahl von Anwendungen. Beachten Sie: abh&auml;ngig von Ihren X11-Startskripten k&ouml;nnte diese Datei einen anderen Namen besitzen, z.B. <i>.Xresources</i>. Die Datei k&ouml;nnte dazu verwendet werden, den &quot;Look&quot; nahezu jeden Elements in jedem Dialogfenster (innerhalb gewisser Grenzen, da manche Optionen fest programmiert sind) oder das Aussehen von vollst&auml;ndig unsichtbaren Fenster-Klassen, wie Men&uuml;s oder Buttons, zu &auml;ndern und ist im Allgemeinen nicht sonderlich n&uuml;tzlich, daher nicht zu empfehlen.</p>

<p>Standardwerte f&uuml;r alle offiziell unterst&uuml;tzten Optionen werden in der so genannten &quot;app-defaults&quot;-Datei <i>Nxtvepg.ad</i> aufgelistet, die gew&ouml;hnlich nach <i>/usr/X11/lib/X11/app-defaults</i> installiert wird (die Erweiterung .ad wird w&auml;hrend der Installation weggelassen). Sie sollten dort jedoch keine Werte ver&auml;ndern, da diese bei der Installation einer neuen Version &uuml;berschrieben werden. Kopieren Sie stattdessen ge&auml;nderte Zeilen in Ihre Datei .Xdefaults (ohne das vorangehende &quot;!&quot; Kommentarzeichen). Beachten Sie, dass Sie nxtvepg neu starten m&uuml;ssen, um diese &Auml;nderungen wirksam werden zu lassen. Wenn X11 bereits l&auml;uft, k&ouml;nnen Sie individuelle Einstellungen mittels xrdb wie folgt &uuml;berschreiben:</p>

<pre><code>echo &quot;nxtvepg*text_bg: #E9E9EC&quot; | xrdb -merge</code></pre>

<p>Farben k&ouml;nnen entweder symbolisch (z.B. &quot;red&quot;) oder als hexadezimale RGB-Werte im Format #RRGGBB angegeben werden. Ein Sonderfall sind die 7 Farben f&uuml;r den Wochentagshintergrund im Hauptfenster: ihr Wert besteht aus einer kommagetrennten Liste von 7 Farben.</p>

<p>Schriften m&uuml;ssen als Triplets bestehend aus Familie, Gr&ouml;&szlig;e (verwenden Sie negative Werte, um die Werte in Pixel anzugeben und positive f&uuml;r Gr&ouml;&szlig;en in Point) und Aussehen (nur &quot;normal&quot; und &quot;bold&quot; (fett) werden empfohlen) spezifiziert werden. Zeilen, die mit einem &quot;!&quot; (Ausrufezeichen) beginnen werden als Kommentar behandelt und daher ignoriert. Eintr&auml;ge, die sich nicht an diese Syntax halten, werden stillschweigend verworfen.</p>

</dd>
</dl>

<h2 id="Files-used-on-Windows-systems">Files used on Windows systems</h2>

<dl>

<dt id="nxtvepg.ini"><b>nxtvepg.ini</b></dt>
<dd>

<p>Konfigurationsdatei, in die alle Konfigurations- und pers&ouml;nliche Einstellungen gespeichert werden. Standardm&auml;&szlig;ig wird diese im Arbeitsverzeichnis erzeugt, es kann jedoch ein anderer Pfad oder Dateiname mittels der Option <b>-rcfile</b> spezifiziert werden (siehe <a href="#OPTIONS">&quot;OPTIONS&quot;</a>).</p>

</dd>
<dt id="Nxtvepg.ad"><b>Nxtvepg.ad</b></dt>
<dd>

<p>Erlaubt die &Auml;nderung des Erscheinungsbildes der Anwendung, d.h. Farben oder Schrift des Textes. Das Format und der Inhalt der Datei ist identisch der Datei <i>.Xdefaults</i>, wie in der UNIX-Sektion beschrieben.</p>

</dd>
<dt id="ttx-SID.xml"><b>ttx-SID.xml</b></dt>
<dd>

<p>Vom Teletext EPG Grabber erzeugte Dateien haben Namen im Format <i>ttx-SID.xml</i>, wobei &quot;SID&quot; die DVB Service ID des TV-Programms in Datei <code>channels.conf</code> ist. (Es wird hier die SID anstatt des Namens verwendet, damit die Datei auch bei Namens&auml;nderungen zugreifbar bleibt. Nur bei analogen Sendern wird anstelle der SID der aktuelle Sendername verwendet.) Das Dateiformat ist XML mit XMLTV Schema. F&uuml;r jeden TV-Sender wird eine separate Datei erzeugt.</p>

<p>Das Verzeichnis in dem der Teletext EPG Grabber die XMLTV Dateien speichert kann &uuml;ber die Option <b>-dbdir</b> spezifiziert werden (siehe <a href="#OPTIONS">&quot;OPTIONS&quot;</a>).</p>

</dd>
<dt id="vbi_map.dat"><b>vbi_map.dat</b></dt>
<dd>

<p>Diese versteckte Datei wird verwendet, um gemeinsam genutzten Arbeitsspeicher einzurichten, der Informationsaustausch zwischen nxtvepg und der angeschlossenen TV-Anwendung erlaubt. Sie wird beim Beenden von nxtvepg automatisch entfernt und es sollte nie mit externen Anwendungen auf sie zugegriffen werden (d.h. indem in sie &uuml;berschrieben oder gel&ouml;scht wird). Die Datei wird nicht erzeugt, wenn die Interaktion mit der TV-Anwendung deaktiviert ist (siehe <a href="#CONFIGURE-MENU">&quot;CONFIGURE MENU&quot;</a>, Kapitel &quot;TV application interaction&quot;).</p>

</dd>
</dl>

<h1 id="AUTHOR">AUTHOR</h1>

<p>T. Z&ouml;rner (<code>tomzo (at) users (dot) sourceforge (dot) net</code>)</p>

<p>Der beste Weg Feedback zu &uuml;bermitteln, ist &uuml;ber das Diskussionsforum auf der nxtvepg-Homepage. Sehen Sie in der README-Datei nach Instruktionen dar&uuml;ber, welche Informationen im Bug-Report stehen sollten (z.B. die Meldung &quot;geht nicht&quot; reicht in den seltensten F&auml;llen.)</p>

<p>Vielen Dank an N&eacute;o f&uuml;r die fortlaufende Bereitstellung der setup.exe f&uuml;r Windows Releases, das K!TV Instellationsmanual und die franz&ouml;sische &Uuml;bersetzung der Web-Seiten; an Kurt Lettmaier f&uuml;r seine Bug Reports; an Kurt Lettmaier und Olaf N&ouml;hring f&uuml;r die deutsche &Uuml;bersetzung des Manuals; an Thierry M&eacute;n&eacute;trier und Peter Rolf f&uuml;r ihr wertvolles Feedback und ihre Anregungen; an Simon Barner f&uuml;r die FreeBSD-Portierung; an Matthieu f&uuml;r die Franz&ouml;sische &Uuml;bersetzung von PDC-Themen-Deskriptoren; an E-nek f&uuml;r die DScaler-Treiber-Portierung und seiner Zusammenarbeit bei der Entwicklung der Interaktion mit der TV-Anwendung; an John Adcock f&uuml;r den DScaler-Treiber; an Jan Schuster f&uuml;r seinen Beta-Test an nxtvepg 0.7.0; an Mario Kemper f&uuml;r seinen Beta-Test der NetBSD-Portierung und fr&uuml;here Beta-Tests; an &quot;Mario&#39;s Bruder&quot; f&uuml;r seinen Beta-Test an der ersten Windows-Portierung; an Gerd Knorr f&uuml;r xawtv und das Warten der Debian- und SuSE-nxtvepg-Packages; an Ralph Metzler f&uuml;r seinen Teletext-Dekoder; an Edgar Toernig f&uuml;r die Latin-1 Konvertierungstabellen in alevt; und nicht zuletzt an die Autoren von bttv und v4l f&uuml;r ihre exzellente Arbeit, und die Autoren der Cygwin GNU &amp; XFree86, ohne die nxtvepg nie nach Windows portiert worden w&auml;re.</p>

<p>Urspr&uuml;nglich wurde nxtvepg als Dekoder f&uuml;r das vom European Telecommunications Standards Institute (ETSI) standardisierte <i>nexTView</i> EPG Protokoll entwickelt (ETS 300 707: &quot;Protocol for a TV Guide using electronic data transmission&quot;). Bis 2012 wurden &uuml;ber das Protokoll von verschiedenen Anbietern in Deutschland, &Ouml;sterreich, Frankreich, Belgien und der Schweiz Programm&uuml;bersichten f&uuml;r alle &uuml;berregionalen TV-Sender &uuml;bertragen. Mit dem Wechsel zu digitaler TV-&Uuml;bertragung wurde dieser Service jedoch eingestellt, da z.B. DVB einen eigenen EPG Standard beinhaltet. Aufgrund dessen ist der Nextview Standard heute obsolet, und wurde aus nxtvepg mit Release 3.0 entfernt.</p>

<h1 id="COPYRIGHT">COPYRIGHT</h1>

<p>Copyright (C) 1999 - 2009, 2020 - 2023 by T. Z&ouml;rner. Alle Rechte vorbehalten.</p>

<p>Zus&auml;tzliche Copyrights gelten f&uuml;r Teile des verwendeten Quelltexts. Bitte in der Datei COPYRIGHT und den Kommentaren im Quelltext nach Details sehen.</p>

<p>Dieses Programm ist freie Software; Sie k&ouml;nnen es unter den Bedingungen der GNU General Public License Version 2, wie von der Free Software Foundation unter <a href="http://www.fsf.org/">http://www.fsf.org/</a> ver&ouml;ffentlicht, verbreiten oder ver&auml;ndern.</p>

<p>Dieses Programm wird in der Hoffnung weitergegeben, n&uuml;tzlich zu sein, jedoch <b>OHNE JEDE GARANTIE</b>; insbesondere ohne Garantie zur Eignung zu jedweden Anwendungszwecken. Siehe Datei <i>COPYRIGHT</i> f&uuml;r mehr Details.</p>

</DIV>
</BODY>
</HTML>
